/* automatically generated by rust-bindgen 0.56.0 */

#[repr(C)]
#[derive(Copy, Clone, Debug, Default, Eq, Hash, Ord, PartialEq, PartialOrd)]
pub struct __BindgenBitfieldUnit<Storage, Align> {
  storage: Storage,
  align: [Align; 0],
}
impl<Storage, Align> __BindgenBitfieldUnit<Storage, Align> {
  #[inline]
  pub const fn new(storage: Storage) -> Self {
    Self { storage, align: [] }
  }
}
impl<Storage, Align> __BindgenBitfieldUnit<Storage, Align>
where
  Storage: AsRef<[u8]> + AsMut<[u8]>,
{
  #[inline]
  pub fn get_bit(&self, index: usize) -> bool {
    debug_assert!(index / 8 < self.storage.as_ref().len());
    let byte_index = index / 8;
    let byte = self.storage.as_ref()[byte_index];
    let bit_index = if cfg!(target_endian = "big") {
      7 - (index % 8)
    } else {
      index % 8
    };
    let mask = 1 << bit_index;
    byte & mask == mask
  }
  #[inline]
  pub fn set_bit(&mut self, index: usize, val: bool) {
    debug_assert!(index / 8 < self.storage.as_ref().len());
    let byte_index = index / 8;
    let byte = &mut self.storage.as_mut()[byte_index];
    let bit_index = if cfg!(target_endian = "big") {
      7 - (index % 8)
    } else {
      index % 8
    };
    let mask = 1 << bit_index;
    if val {
      *byte |= mask;
    } else {
      *byte &= !mask;
    }
  }
  #[inline]
  pub fn get(&self, bit_offset: usize, bit_width: u8) -> u64 {
    debug_assert!(bit_width <= 64);
    debug_assert!(bit_offset / 8 < self.storage.as_ref().len());

pub const SFILE_VERIFY_MPQ_HEADER: u32 = 1;
pub const SFILE_VERIFY_HET_TABLE: u32 = 2;
pub const SFILE_VERIFY_BET_TABLE: u32 = 3;
pub const SFILE_VERIFY_HASH_TABLE: u32 = 4;
pub const SFILE_VERIFY_BLOCK_TABLE: u32 = 5;
pub const SFILE_VERIFY_HIBLOCK_TABLE: u32 = 6;
pub const SFILE_VERIFY_FILE: u32 = 7;
pub const SIGNATURE_TYPE_NONE: u32 = 0;
pub const SIGNATURE_TYPE_WEAK: u32 = 1;
pub const SIGNATURE_TYPE_STRONG: u32 = 2;
pub const ERROR_NO_SIGNATURE: u32 = 0;
pub const ERROR_VERIFY_FAILED: u32 = 1;
pub const ERROR_WEAK_SIGNATURE_OK: u32 = 2;
pub const ERROR_WEAK_SIGNATURE_ERROR: u32 = 3;
pub const ERROR_STRONG_SIGNATURE_OK: u32 = 4;
pub const ERROR_STRONG_SIGNATURE_ERROR: u32 = 5;
pub const MD5_DIGEST_SIZE: u32 = 16;
pub const SHA1_DIGEST_SIZE: u32 = 20;
pub const CCB_CHECKING_FILES: u32 = 1;
pub const CCB_CHECKING_HASH_TABLE: u32 = 2;
pub const CCB_COPYING_NON_MPQ_DATA: u32 = 3;
pub const CCB_COMPACTING_FILES: u32 = 4;
pub const CCB_CLOSING_ARCHIVE: u32 = 5;
pub const MPQ_HEADER_SIZE_V1: u32 = 32;
pub const MPQ_HEADER_SIZE_V2: u32 = 44;
pub const MPQ_HEADER_SIZE_V3: u32 = 68;
pub const MPQ_HEADER_SIZE_V4: u32 = 208;
pub const MPQ_HEADER_DWORDS: u32 = 52;
pub type size_t = ::std::os::raw::c_ulonglong;
pub type TCHAR = u16;
pub type ULONG = ::std::os::raw::c_ulong;
pub type USHORT = ::std::os::raw::c_ushort;
pub type UCHAR = ::std::os::raw::c_uchar;
pub type DWORD = ::std::os::raw::c_ulong;
pub type BOOL = ::std::os::raw::c_int;
pub type BYTE = ::std::os::raw::c_uchar;
pub type WORD = ::std::os::raw::c_ushort;
pub type FLOAT = f32;
pub type PBYTE = *mut BYTE;
pub type LPBYTE = *mut BYTE;
pub type PDWORD = *mut DWORD;
pub type LPDWORD = *mut DWORD;
pub type LPVOID = *mut ::std::os::raw::c_void;
pub type LPCVOID = *const ::std::os::raw::c_void;
pub type INT = ::std::os::raw::c_int;
pub type UINT = ::std::os::raw::c_uint;
pub type INT_PTR = ::std::os::raw::c_longlong;
pub type UINT_PTR = ::std::os::raw::c_ulonglong;
pub type LONG_PTR = ::std::os::raw::c_longlong;
pub type ULONG_PTR = ::std::os::raw::c_ulonglong;
pub type SHANDLE_PTR = ::std::os::raw::c_longlong;
pub type SIZE_T = ULONG_PTR;
pub type SSIZE_T = LONG_PTR;
pub type DWORD_PTR = ULONG_PTR;
pub type DWORD64 = ::std::os::raw::c_ulonglong;
pub type KAFFINITY = ULONG_PTR;
pub type PVOID = *mut ::std::os::raw::c_void;
pub type CHAR = ::std::os::raw::c_char;
pub type SHORT = ::std::os::raw::c_short;
pub type LONG = ::std::os::raw::c_long;
pub type WCHAR = u16;
pub type LPWSTR = *mut WCHAR;
pub type PWSTR = *mut WCHAR;
pub type LPCWSTR = *const WCHAR;
pub type PCWSTR = *const WCHAR;
pub type PCZZWSTR = *const WCHAR;
pub type LPSTR = *mut CHAR;
pub type LPCSTR = *const CHAR;
pub type PCSTR = *const CHAR;
pub type PCZZSTR = *const CHAR;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _GROUP_AFFINITY {
  pub Mask: KAFFINITY,
  pub Group: WORD,
  pub Reserved: [WORD; 3usize],
}
#[test]
fn bindgen_test_layout__GROUP_AFFINITY() {
  assert_eq!(
    ::std::mem::size_of::<_GROUP_AFFINITY>(),
    16usize,
    concat!("Size of: ", stringify!(_GROUP_AFFINITY))
  );
  assert_eq!(
    ::std::mem::align_of::<_GROUP_AFFINITY>(),
    8usize,
    concat!("Alignment of ", stringify!(_GROUP_AFFINITY))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_GROUP_AFFINITY>())).Mask as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_GROUP_AFFINITY),
      "::",
      stringify!(Mask)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_GROUP_AFFINITY>())).Group as *const _ as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_GROUP_AFFINITY),
      "::",
      stringify!(Group)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_GROUP_AFFINITY>())).Reserved as *const _ as usize },
    10usize,
    concat!(
      "Offset of field: ",
      stringify!(_GROUP_AFFINITY),
      "::",
      stringify!(Reserved)
    )
  );
}
pub type GROUP_AFFINITY = _GROUP_AFFINITY;
pub type HANDLE = *mut ::std::os::raw::c_void;
pub type HRESULT = ::std::os::raw::c_long;
pub type LCID = DWORD;
pub type LONGLONG = ::std::os::raw::c_longlong;
pub type ULONGLONG = ::std::os::raw::c_ulonglong;
#[repr(C)]
#[derive(Copy, Clone)]
pub union _LARGE_INTEGER {
  pub __bindgen_anon_1: _LARGE_INTEGER__bindgen_ty_1,
  pub u: _LARGE_INTEGER__bindgen_ty_2,
  pub QuadPart: LONGLONG,
  _bindgen_union_align: u64,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _LARGE_INTEGER__bindgen_ty_1 {
  pub LowPart: DWORD,
  pub HighPart: LONG,
}
#[test]
fn bindgen_test_layout__LARGE_INTEGER__bindgen_ty_1() {
  assert_eq!(
    ::std::mem::size_of::<_LARGE_INTEGER__bindgen_ty_1>(),
    8usize,
    concat!("Size of: ", stringify!(_LARGE_INTEGER__bindgen_ty_1))
  );
  assert_eq!(
    ::std::mem::align_of::<_LARGE_INTEGER__bindgen_ty_1>(),
    4usize,
    concat!("Alignment of ", stringify!(_LARGE_INTEGER__bindgen_ty_1))
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_LARGE_INTEGER__bindgen_ty_1>())).LowPart as *const _ as usize
    },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_LARGE_INTEGER__bindgen_ty_1),
      "::",
      stringify!(LowPart)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_LARGE_INTEGER__bindgen_ty_1>())).HighPart as *const _ as usize
    },
    4usize,
    concat!(
      "Offset of field: ",
      stringify!(_LARGE_INTEGER__bindgen_ty_1),
      "::",
      stringify!(HighPart)
    )
  );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _LARGE_INTEGER__bindgen_ty_2 {
  pub LowPart: DWORD,
  pub HighPart: LONG,
}
#[test]
fn bindgen_test_layout__LARGE_INTEGER__bindgen_ty_2() {
  assert_eq!(
    ::std::mem::size_of::<_LARGE_INTEGER__bindgen_ty_2>(),
    8usize,
    concat!("Size of: ", stringify!(_LARGE_INTEGER__bindgen_ty_2))
  );
  assert_eq!(
    ::std::mem::align_of::<_LARGE_INTEGER__bindgen_ty_2>(),
    4usize,
    concat!("Alignment of ", stringify!(_LARGE_INTEGER__bindgen_ty_2))
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_LARGE_INTEGER__bindgen_ty_2>())).LowPart as *const _ as usize
    },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_LARGE_INTEGER__bindgen_ty_2),
      "::",
      stringify!(LowPart)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_LARGE_INTEGER__bindgen_ty_2>())).HighPart as *const _ as usize
    },
    4usize,
    concat!(
      "Offset of field: ",
      stringify!(_LARGE_INTEGER__bindgen_ty_2),
      "::",
      stringify!(HighPart)
    )
  );
}
#[test]
fn bindgen_test_layout__LARGE_INTEGER() {
  assert_eq!(
    ::std::mem::size_of::<_LARGE_INTEGER>(),
    8usize,
    concat!("Size of: ", stringify!(_LARGE_INTEGER))
  );
  assert_eq!(
    ::std::mem::align_of::<_LARGE_INTEGER>(),
    8usize,
    concat!("Alignment of ", stringify!(_LARGE_INTEGER))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_LARGE_INTEGER>())).u as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_LARGE_INTEGER),
      "::",
      stringify!(u)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_LARGE_INTEGER>())).QuadPart as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_LARGE_INTEGER),
      "::",
      stringify!(QuadPart)
    )
  );
}
pub type LARGE_INTEGER = _LARGE_INTEGER;
#[repr(C)]
#[derive(Copy, Clone)]
pub union _ULARGE_INTEGER {
  pub __bindgen_anon_1: _ULARGE_INTEGER__bindgen_ty_1,
  pub u: _ULARGE_INTEGER__bindgen_ty_2,
  pub QuadPart: ULONGLONG,
  _bindgen_union_align: u64,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ULARGE_INTEGER__bindgen_ty_1 {
  pub LowPart: DWORD,
  pub HighPart: DWORD,
}
#[test]
fn bindgen_test_layout__ULARGE_INTEGER__bindgen_ty_1() {
  assert_eq!(
    ::std::mem::size_of::<_ULARGE_INTEGER__bindgen_ty_1>(),
    8usize,
    concat!("Size of: ", stringify!(_ULARGE_INTEGER__bindgen_ty_1))
  );
  assert_eq!(
    ::std::mem::align_of::<_ULARGE_INTEGER__bindgen_ty_1>(),
    4usize,
    concat!("Alignment of ", stringify!(_ULARGE_INTEGER__bindgen_ty_1))
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_ULARGE_INTEGER__bindgen_ty_1>())).LowPart as *const _ as usize
    },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_ULARGE_INTEGER__bindgen_ty_1),
      "::",
      stringify!(LowPart)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_ULARGE_INTEGER__bindgen_ty_1>())).HighPart as *const _ as usize
    },
    4usize,
    concat!(
      "Offset of field: ",
      stringify!(_ULARGE_INTEGER__bindgen_ty_1),
      "::",
      stringify!(HighPart)
    )
  );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ULARGE_INTEGER__bindgen_ty_2 {
  pub LowPart: DWORD,
  pub HighPart: DWORD,
}
#[test]
fn bindgen_test_layout__ULARGE_INTEGER__bindgen_ty_2() {
  assert_eq!(
    ::std::mem::size_of::<_ULARGE_INTEGER__bindgen_ty_2>(),
    8usize,
    concat!("Size of: ", stringify!(_ULARGE_INTEGER__bindgen_ty_2))
  );
  assert_eq!(
    ::std::mem::align_of::<_ULARGE_INTEGER__bindgen_ty_2>(),
    4usize,
    concat!("Alignment of ", stringify!(_ULARGE_INTEGER__bindgen_ty_2))
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_ULARGE_INTEGER__bindgen_ty_2>())).LowPart as *const _ as usize
    },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_ULARGE_INTEGER__bindgen_ty_2),
      "::",
      stringify!(LowPart)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_ULARGE_INTEGER__bindgen_ty_2>())).HighPart as *const _ as usize
    },
    4usize,
    concat!(
      "Offset of field: ",
      stringify!(_ULARGE_INTEGER__bindgen_ty_2),
      "::",
      stringify!(HighPart)
    )
  );
}
#[test]
fn bindgen_test_layout__ULARGE_INTEGER() {
  assert_eq!(
    ::std::mem::size_of::<_ULARGE_INTEGER>(),
    8usize,
    concat!("Size of: ", stringify!(_ULARGE_INTEGER))
  );
  assert_eq!(
    ::std::mem::align_of::<_ULARGE_INTEGER>(),
    8usize,
    concat!("Alignment of ", stringify!(_ULARGE_INTEGER))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_ULARGE_INTEGER>())).u as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_ULARGE_INTEGER),
      "::",
      stringify!(u)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_ULARGE_INTEGER>())).QuadPart as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_ULARGE_INTEGER),
      "::",
      stringify!(QuadPart)
    )
  );
}
pub type ULARGE_INTEGER = _ULARGE_INTEGER;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _LUID {
  pub LowPart: DWORD,
  pub HighPart: LONG,
}
#[test]
fn bindgen_test_layout__LUID() {
  assert_eq!(
    ::std::mem::size_of::<_LUID>(),
    8usize,
    concat!("Size of: ", stringify!(_LUID))
  );
  assert_eq!(
    ::std::mem::align_of::<_LUID>(),
    4usize,
    concat!("Alignment of ", stringify!(_LUID))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_LUID>())).LowPart as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_LUID),
      "::",
      stringify!(LowPart)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_LUID>())).HighPart as *const _ as usize },
    4usize,
    concat!(
      "Offset of field: ",
      stringify!(_LUID),
      "::",
      stringify!(HighPart)
    )
  );
}
pub type LUID = _LUID;
pub type DWORDLONG = ULONGLONG;
pub type BOOLEAN = BYTE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SINGLE_LIST_ENTRY {
  pub Next: *mut _SINGLE_LIST_ENTRY,
}
#[test]
fn bindgen_test_layout__SINGLE_LIST_ENTRY() {
  assert_eq!(
    ::std::mem::size_of::<_SINGLE_LIST_ENTRY>(),
    8usize,
    concat!("Size of: ", stringify!(_SINGLE_LIST_ENTRY))
  );
  assert_eq!(
    ::std::mem::align_of::<_SINGLE_LIST_ENTRY>(),
    8usize,
    concat!("Alignment of ", stringify!(_SINGLE_LIST_ENTRY))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SINGLE_LIST_ENTRY>())).Next as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_SINGLE_LIST_ENTRY),
      "::",
      stringify!(Next)
    )
  );
}
pub type SINGLE_LIST_ENTRY = _SINGLE_LIST_ENTRY;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _GUID {
  pub Data1: ::std::os::raw::c_ulong,
  pub Data2: ::std::os::raw::c_ushort,
  pub Data3: ::std::os::raw::c_ushort,
  pub Data4: [::std::os::raw::c_uchar; 8usize],
}
#[test]
fn bindgen_test_layout__GUID() {
  assert_eq!(
    ::std::mem::size_of::<_GUID>(),
    16usize,
    concat!("Size of: ", stringify!(_GUID))
  );
  assert_eq!(
    ::std::mem::align_of::<_GUID>(),
    4usize,
    concat!("Alignment of ", stringify!(_GUID))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_GUID>())).Data1 as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_GUID),
      "::",
      stringify!(Data1)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_GUID>())).Data2 as *const _ as usize },
    4usize,
    concat!(
      "Offset of field: ",
      stringify!(_GUID),
      "::",
      stringify!(Data2)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_GUID>())).Data3 as *const _ as usize },
    6usize,
    concat!(
      "Offset of field: ",
      stringify!(_GUID),
      "::",
      stringify!(Data3)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_GUID>())).Data4 as *const _ as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_GUID),
      "::",
      stringify!(Data4)
    )
  );
}
pub type GUID = _GUID;
pub type LPGUID = *mut GUID;
pub type LPCGUID = *const GUID;
pub type IID = GUID;
pub type CLSID = GUID;
pub type FMTID = GUID;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SCOPE_TABLE_AMD64 {
  pub Count: DWORD,
  pub ScopeRecord: [_SCOPE_TABLE_AMD64__bindgen_ty_1; 1usize],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SCOPE_TABLE_AMD64__bindgen_ty_1 {
  pub BeginAddress: DWORD,
  pub EndAddress: DWORD,
  pub HandlerAddress: DWORD,
  pub JumpTarget: DWORD,
}
#[test]
fn bindgen_test_layout__SCOPE_TABLE_AMD64__bindgen_ty_1() {
  assert_eq!(
    ::std::mem::size_of::<_SCOPE_TABLE_AMD64__bindgen_ty_1>(),
    16usize,
    concat!("Size of: ", stringify!(_SCOPE_TABLE_AMD64__bindgen_ty_1))
  );
  assert_eq!(
    ::std::mem::align_of::<_SCOPE_TABLE_AMD64__bindgen_ty_1>(),
    4usize,
    concat!(
      "Alignment of ",
      stringify!(_SCOPE_TABLE_AMD64__bindgen_ty_1)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_SCOPE_TABLE_AMD64__bindgen_ty_1>())).BeginAddress as *const _ as usize
    },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_SCOPE_TABLE_AMD64__bindgen_ty_1),
      "::",
      stringify!(BeginAddress)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_SCOPE_TABLE_AMD64__bindgen_ty_1>())).EndAddress as *const _ as usize
    },
    4usize,
    concat!(
      "Offset of field: ",
      stringify!(_SCOPE_TABLE_AMD64__bindgen_ty_1),
      "::",
      stringify!(EndAddress)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_SCOPE_TABLE_AMD64__bindgen_ty_1>())).HandlerAddress as *const _
        as usize
    },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_SCOPE_TABLE_AMD64__bindgen_ty_1),
      "::",
      stringify!(HandlerAddress)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_SCOPE_TABLE_AMD64__bindgen_ty_1>())).JumpTarget as *const _ as usize
    },
    12usize,
    concat!(
      "Offset of field: ",
      stringify!(_SCOPE_TABLE_AMD64__bindgen_ty_1),
      "::",
      stringify!(JumpTarget)
    )
  );
}
#[test]
fn bindgen_test_layout__SCOPE_TABLE_AMD64() {
  assert_eq!(
    ::std::mem::size_of::<_SCOPE_TABLE_AMD64>(),
    20usize,
    concat!("Size of: ", stringify!(_SCOPE_TABLE_AMD64))
  );
  assert_eq!(
    ::std::mem::align_of::<_SCOPE_TABLE_AMD64>(),
    4usize,
    concat!("Alignment of ", stringify!(_SCOPE_TABLE_AMD64))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SCOPE_TABLE_AMD64>())).Count as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_SCOPE_TABLE_AMD64),
      "::",
      stringify!(Count)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SCOPE_TABLE_AMD64>())).ScopeRecord as *const _ as usize },
    4usize,
    concat!(
      "Offset of field: ",
      stringify!(_SCOPE_TABLE_AMD64),
      "::",
      stringify!(ScopeRecord)
    )
  );
}
pub type SCOPE_TABLE_AMD64 = _SCOPE_TABLE_AMD64;
pub type SCOPE_TABLE = SCOPE_TABLE_AMD64;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SCOPE_TABLE_ARM {
  pub Count: DWORD,
  pub ScopeRecord: [_SCOPE_TABLE_ARM__bindgen_ty_1; 1usize],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SCOPE_TABLE_ARM__bindgen_ty_1 {
  pub BeginAddress: DWORD,
  pub EndAddress: DWORD,
  pub HandlerAddress: DWORD,
  pub JumpTarget: DWORD,
}
#[test]
fn bindgen_test_layout__SCOPE_TABLE_ARM__bindgen_ty_1() {
  assert_eq!(
    ::std::mem::size_of::<_SCOPE_TABLE_ARM__bindgen_ty_1>(),
    16usize,
    concat!("Size of: ", stringify!(_SCOPE_TABLE_ARM__bindgen_ty_1))
  );
  assert_eq!(
    ::std::mem::align_of::<_SCOPE_TABLE_ARM__bindgen_ty_1>(),
    4usize,
    concat!("Alignment of ", stringify!(_SCOPE_TABLE_ARM__bindgen_ty_1))
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_SCOPE_TABLE_ARM__bindgen_ty_1>())).BeginAddress as *const _ as usize
    },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_SCOPE_TABLE_ARM__bindgen_ty_1),
      "::",
      stringify!(BeginAddress)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_SCOPE_TABLE_ARM__bindgen_ty_1>())).EndAddress as *const _ as usize
    },
    4usize,
    concat!(
      "Offset of field: ",
      stringify!(_SCOPE_TABLE_ARM__bindgen_ty_1),
      "::",
      stringify!(EndAddress)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_SCOPE_TABLE_ARM__bindgen_ty_1>())).HandlerAddress as *const _ as usize
    },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_SCOPE_TABLE_ARM__bindgen_ty_1),
      "::",
      stringify!(HandlerAddress)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_SCOPE_TABLE_ARM__bindgen_ty_1>())).JumpTarget as *const _ as usize
    },
    12usize,
    concat!(
      "Offset of field: ",
      stringify!(_SCOPE_TABLE_ARM__bindgen_ty_1),
      "::",
      stringify!(JumpTarget)
    )
  );
}
#[test]
fn bindgen_test_layout__SCOPE_TABLE_ARM() {
  assert_eq!(
    ::std::mem::size_of::<_SCOPE_TABLE_ARM>(),
    20usize,
    concat!("Size of: ", stringify!(_SCOPE_TABLE_ARM))
  );
  assert_eq!(
    ::std::mem::align_of::<_SCOPE_TABLE_ARM>(),
    4usize,
    concat!("Alignment of ", stringify!(_SCOPE_TABLE_ARM))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SCOPE_TABLE_ARM>())).Count as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_SCOPE_TABLE_ARM),
      "::",
      stringify!(Count)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SCOPE_TABLE_ARM>())).ScopeRecord as *const _ as usize },
    4usize,
    concat!(
      "Offset of field: ",
      stringify!(_SCOPE_TABLE_ARM),
      "::",
      stringify!(ScopeRecord)
    )
  );
}
pub type SCOPE_TABLE_ARM = _SCOPE_TABLE_ARM;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SCOPE_TABLE_ARM64 {
  pub Count: DWORD,
  pub ScopeRecord: [_SCOPE_TABLE_ARM64__bindgen_ty_1; 1usize],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SCOPE_TABLE_ARM64__bindgen_ty_1 {
  pub BeginAddress: DWORD,
  pub EndAddress: DWORD,
  pub HandlerAddress: DWORD,
  pub JumpTarget: DWORD,
}
#[test]
fn bindgen_test_layout__SCOPE_TABLE_ARM64__bindgen_ty_1() {
  assert_eq!(
    ::std::mem::size_of::<_SCOPE_TABLE_ARM64__bindgen_ty_1>(),
    16usize,
    concat!("Size of: ", stringify!(_SCOPE_TABLE_ARM64__bindgen_ty_1))
  );
  assert_eq!(
    ::std::mem::align_of::<_SCOPE_TABLE_ARM64__bindgen_ty_1>(),
    4usize,
    concat!(
      "Alignment of ",
      stringify!(_SCOPE_TABLE_ARM64__bindgen_ty_1)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_SCOPE_TABLE_ARM64__bindgen_ty_1>())).BeginAddress as *const _ as usize
    },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_SCOPE_TABLE_ARM64__bindgen_ty_1),
      "::",
      stringify!(BeginAddress)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_SCOPE_TABLE_ARM64__bindgen_ty_1>())).EndAddress as *const _ as usize
    },
    4usize,
    concat!(
      "Offset of field: ",
      stringify!(_SCOPE_TABLE_ARM64__bindgen_ty_1),
      "::",
      stringify!(EndAddress)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_SCOPE_TABLE_ARM64__bindgen_ty_1>())).HandlerAddress as *const _
        as usize
    },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_SCOPE_TABLE_ARM64__bindgen_ty_1),
      "::",
      stringify!(HandlerAddress)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_SCOPE_TABLE_ARM64__bindgen_ty_1>())).JumpTarget as *const _ as usize
    },
    12usize,
    concat!(
      "Offset of field: ",
      stringify!(_SCOPE_TABLE_ARM64__bindgen_ty_1),
      "::",
      stringify!(JumpTarget)
    )
  );
}
#[test]
fn bindgen_test_layout__SCOPE_TABLE_ARM64() {
  assert_eq!(
    ::std::mem::size_of::<_SCOPE_TABLE_ARM64>(),
    20usize,
    concat!("Size of: ", stringify!(_SCOPE_TABLE_ARM64))
  );
  assert_eq!(
    ::std::mem::align_of::<_SCOPE_TABLE_ARM64>(),
    4usize,
    concat!("Alignment of ", stringify!(_SCOPE_TABLE_ARM64))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SCOPE_TABLE_ARM64>())).Count as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_SCOPE_TABLE_ARM64),
      "::",
      stringify!(Count)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SCOPE_TABLE_ARM64>())).ScopeRecord as *const _ as usize },
    4usize,
    concat!(
      "Offset of field: ",
      stringify!(_SCOPE_TABLE_ARM64),
      "::",
      stringify!(ScopeRecord)
    )
  );
}
pub type SCOPE_TABLE_ARM64 = _SCOPE_TABLE_ARM64;
pub type PACCESS_TOKEN = PVOID;
pub type PSECURITY_DESCRIPTOR = PVOID;
pub type PSID = PVOID;
pub type ACCESS_MASK = DWORD;
pub type PACCESS_MASK = *mut ACCESS_MASK;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _GENERIC_MAPPING {
  pub GenericRead: ACCESS_MASK,
  pub GenericWrite: ACCESS_MASK,
  pub GenericExecute: ACCESS_MASK,
  pub GenericAll: ACCESS_MASK,
}
#[test]
fn bindgen_test_layout__GENERIC_MAPPING() {
  assert_eq!(
    ::std::mem::size_of::<_GENERIC_MAPPING>(),
    16usize,
    concat!("Size of: ", stringify!(_GENERIC_MAPPING))
  );
  assert_eq!(
    ::std::mem::align_of::<_GENERIC_MAPPING>(),
    4usize,
    concat!("Alignment of ", stringify!(_GENERIC_MAPPING))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_GENERIC_MAPPING>())).GenericRead as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_GENERIC_MAPPING),
      "::",
      stringify!(GenericRead)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_GENERIC_MAPPING>())).GenericWrite as *const _ as usize },
    4usize,
    concat!(
      "Offset of field: ",
      stringify!(_GENERIC_MAPPING),
      "::",
      stringify!(GenericWrite)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_GENERIC_MAPPING>())).GenericExecute as *const _ as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_GENERIC_MAPPING),
      "::",
      stringify!(GenericExecute)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_GENERIC_MAPPING>())).GenericAll as *const _ as usize },
    12usize,
    concat!(
      "Offset of field: ",
      stringify!(_GENERIC_MAPPING),
      "::",
      stringify!(GenericAll)
    )
  );
}
pub type GENERIC_MAPPING = _GENERIC_MAPPING;
pub type PGENERIC_MAPPING = *mut GENERIC_MAPPING;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _LUID_AND_ATTRIBUTES {
  pub Luid: LUID,
  pub Attributes: DWORD,
}
#[test]
fn bindgen_test_layout__LUID_AND_ATTRIBUTES() {
  assert_eq!(
    ::std::mem::size_of::<_LUID_AND_ATTRIBUTES>(),
    12usize,
    concat!("Size of: ", stringify!(_LUID_AND_ATTRIBUTES))
  );
  assert_eq!(
    ::std::mem::align_of::<_LUID_AND_ATTRIBUTES>(),
    4usize,
    concat!("Alignment of ", stringify!(_LUID_AND_ATTRIBUTES))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_LUID_AND_ATTRIBUTES>())).Luid as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_LUID_AND_ATTRIBUTES),
      "::",
      stringify!(Luid)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_LUID_AND_ATTRIBUTES>())).Attributes as *const _ as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_LUID_AND_ATTRIBUTES),
      "::",
      stringify!(Attributes)
    )
  );
}
pub type LUID_AND_ATTRIBUTES = _LUID_AND_ATTRIBUTES;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SID_IDENTIFIER_AUTHORITY {
  pub Value: [BYTE; 6usize],
}
#[test]
fn bindgen_test_layout__SID_IDENTIFIER_AUTHORITY() {
  assert_eq!(
    ::std::mem::size_of::<_SID_IDENTIFIER_AUTHORITY>(),
    6usize,
    concat!("Size of: ", stringify!(_SID_IDENTIFIER_AUTHORITY))
  );
  assert_eq!(
    ::std::mem::align_of::<_SID_IDENTIFIER_AUTHORITY>(),
    1usize,
    concat!("Alignment of ", stringify!(_SID_IDENTIFIER_AUTHORITY))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SID_IDENTIFIER_AUTHORITY>())).Value as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_SID_IDENTIFIER_AUTHORITY),
      "::",
      stringify!(Value)
    )
  );
}
pub type SID_IDENTIFIER_AUTHORITY = _SID_IDENTIFIER_AUTHORITY;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SID {
  pub Revision: BYTE,
  pub SubAuthorityCount: BYTE,
  pub IdentifierAuthority: SID_IDENTIFIER_AUTHORITY,
  pub SubAuthority: [DWORD; 1usize],
}
#[test]
fn bindgen_test_layout__SID() {
  assert_eq!(
    ::std::mem::size_of::<_SID>(),
    12usize,
    concat!("Size of: ", stringify!(_SID))
  );
  assert_eq!(
    ::std::mem::align_of::<_SID>(),
    4usize,
    concat!("Alignment of ", stringify!(_SID))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SID>())).Revision as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_SID),
      "::",
      stringify!(Revision)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SID>())).SubAuthorityCount as *const _ as usize },
    1usize,
    concat!(
      "Offset of field: ",
      stringify!(_SID),
      "::",
      stringify!(SubAuthorityCount)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SID>())).IdentifierAuthority as *const _ as usize },
    2usize,
    concat!(
      "Offset of field: ",
      stringify!(_SID),
      "::",
      stringify!(IdentifierAuthority)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SID>())).SubAuthority as *const _ as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_SID),
      "::",
      stringify!(SubAuthority)
    )
  );
}
pub type SID = _SID;
#[repr(C)]
#[derive(Copy, Clone)]
pub union _SE_SID {
  pub Sid: SID,
  pub Buffer: [BYTE; 68usize],
  _bindgen_union_align: [u32; 17usize],
}
#[test]
fn bindgen_test_layout__SE_SID() {
  assert_eq!(
    ::std::mem::size_of::<_SE_SID>(),
    68usize,
    concat!("Size of: ", stringify!(_SE_SID))
  );
  assert_eq!(
    ::std::mem::align_of::<_SE_SID>(),
    4usize,
    concat!("Alignment of ", stringify!(_SE_SID))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SE_SID>())).Sid as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_SE_SID),
      "::",
      stringify!(Sid)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SE_SID>())).Buffer as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_SE_SID),
      "::",
      stringify!(Buffer)
    )
  );
}
pub type SE_SID = _SE_SID;
pub const _SID_NAME_USE_SidTypeUser: _SID_NAME_USE = 1;
pub const _SID_NAME_USE_SidTypeGroup: _SID_NAME_USE = 2;
pub const _SID_NAME_USE_SidTypeDomain: _SID_NAME_USE = 3;
pub const _SID_NAME_USE_SidTypeAlias: _SID_NAME_USE = 4;
pub const _SID_NAME_USE_SidTypeWellKnownGroup: _SID_NAME_USE = 5;
pub const _SID_NAME_USE_SidTypeDeletedAccount: _SID_NAME_USE = 6;
pub const _SID_NAME_USE_SidTypeInvalid: _SID_NAME_USE = 7;
pub const _SID_NAME_USE_SidTypeUnknown: _SID_NAME_USE = 8;
pub const _SID_NAME_USE_SidTypeComputer: _SID_NAME_USE = 9;
pub const _SID_NAME_USE_SidTypeLabel: _SID_NAME_USE = 10;
pub const _SID_NAME_USE_SidTypeLogonSession: _SID_NAME_USE = 11;
pub type _SID_NAME_USE = ::std::os::raw::c_int;
pub use self::_SID_NAME_USE as SID_NAME_USE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SID_AND_ATTRIBUTES {
  pub Sid: PSID,
  pub Attributes: DWORD,
}
#[test]
fn bindgen_test_layout__SID_AND_ATTRIBUTES() {
  assert_eq!(
    ::std::mem::size_of::<_SID_AND_ATTRIBUTES>(),
    16usize,
    concat!("Size of: ", stringify!(_SID_AND_ATTRIBUTES))
  );
  assert_eq!(
    ::std::mem::align_of::<_SID_AND_ATTRIBUTES>(),
    8usize,
    concat!("Alignment of ", stringify!(_SID_AND_ATTRIBUTES))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SID_AND_ATTRIBUTES>())).Sid as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_SID_AND_ATTRIBUTES),
      "::",
      stringify!(Sid)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SID_AND_ATTRIBUTES>())).Attributes as *const _ as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_SID_AND_ATTRIBUTES),
      "::",
      stringify!(Attributes)
    )
  );
}
pub type SID_AND_ATTRIBUTES = _SID_AND_ATTRIBUTES;
pub type PSID_AND_ATTRIBUTES = *mut _SID_AND_ATTRIBUTES;
pub type SID_AND_ATTRIBUTES_ARRAY = [SID_AND_ATTRIBUTES; 1usize];
pub type SID_HASH_ENTRY = ULONG_PTR;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SID_AND_ATTRIBUTES_HASH {
  pub SidCount: DWORD,
  pub SidAttr: PSID_AND_ATTRIBUTES,
  pub Hash: [SID_HASH_ENTRY; 32usize],
}
#[test]
fn bindgen_test_layout__SID_AND_ATTRIBUTES_HASH() {
  assert_eq!(
    ::std::mem::size_of::<_SID_AND_ATTRIBUTES_HASH>(),
    272usize,
    concat!("Size of: ", stringify!(_SID_AND_ATTRIBUTES_HASH))
  );
  assert_eq!(
    ::std::mem::align_of::<_SID_AND_ATTRIBUTES_HASH>(),
    8usize,
    concat!("Alignment of ", stringify!(_SID_AND_ATTRIBUTES_HASH))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SID_AND_ATTRIBUTES_HASH>())).SidCount as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_SID_AND_ATTRIBUTES_HASH),
      "::",
      stringify!(SidCount)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SID_AND_ATTRIBUTES_HASH>())).SidAttr as *const _ as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_SID_AND_ATTRIBUTES_HASH),
      "::",
      stringify!(SidAttr)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SID_AND_ATTRIBUTES_HASH>())).Hash as *const _ as usize },
    16usize,
    concat!(
      "Offset of field: ",
      stringify!(_SID_AND_ATTRIBUTES_HASH),
      "::",
      stringify!(Hash)
    )
  );
}
pub type SID_AND_ATTRIBUTES_HASH = _SID_AND_ATTRIBUTES_HASH;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ACL {
  pub AclRevision: BYTE,
  pub Sbz1: BYTE,
  pub AclSize: WORD,
  pub AceCount: WORD,
  pub Sbz2: WORD,
}
#[test]
fn bindgen_test_layout__ACL() {
  assert_eq!(
    ::std::mem::size_of::<_ACL>(),
    8usize,
    concat!("Size of: ", stringify!(_ACL))
  );
  assert_eq!(
    ::std::mem::align_of::<_ACL>(),
    2usize,
    concat!("Alignment of ", stringify!(_ACL))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_ACL>())).AclRevision as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_ACL),
      "::",
      stringify!(AclRevision)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_ACL>())).Sbz1 as *const _ as usize },
    1usize,
    concat!(
      "Offset of field: ",
      stringify!(_ACL),
      "::",
      stringify!(Sbz1)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_ACL>())).AclSize as *const _ as usize },
    2usize,
    concat!(
      "Offset of field: ",
      stringify!(_ACL),
      "::",
      stringify!(AclSize)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_ACL>())).AceCount as *const _ as usize },
    4usize,
    concat!(
      "Offset of field: ",
      stringify!(_ACL),
      "::",
      stringify!(AceCount)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_ACL>())).Sbz2 as *const _ as usize },
    6usize,
    concat!(
      "Offset of field: ",
      stringify!(_ACL),
      "::",
      stringify!(Sbz2)
    )
  );
}
pub type ACL = _ACL;
pub type PACL = *mut ACL;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ACE_HEADER {
  pub AceType: BYTE,
  pub AceFlags: BYTE,
  pub AceSize: WORD,
}
#[test]
fn bindgen_test_layout__ACE_HEADER() {
  assert_eq!(
    ::std::mem::size_of::<_ACE_HEADER>(),
    4usize,
    concat!("Size of: ", stringify!(_ACE_HEADER))
  );
  assert_eq!(
    ::std::mem::align_of::<_ACE_HEADER>(),
    2usize,
    concat!("Alignment of ", stringify!(_ACE_HEADER))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_ACE_HEADER>())).AceType as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_ACE_HEADER),
      "::",
      stringify!(AceType)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_ACE_HEADER>())).AceFlags as *const _ as usize },
    1usize,
    concat!(
      "Offset of field: ",
      stringify!(_ACE_HEADER),
      "::",
      stringify!(AceFlags)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_ACE_HEADER>())).AceSize as *const _ as usize },
    2usize,
    concat!(
      "Offset of field: ",
      stringify!(_ACE_HEADER),
      "::",
      stringify!(AceSize)
    )
  );
}
pub type ACE_HEADER = _ACE_HEADER;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SYSTEM_AUDIT_ACE {
  pub Header: ACE_HEADER,
  pub Mask: ACCESS_MASK,
  pub SidStart: DWORD,
}
#[test]
fn bindgen_test_layout__SYSTEM_AUDIT_ACE() {
  assert_eq!(
    ::std::mem::size_of::<_SYSTEM_AUDIT_ACE>(),
    12usize,
    concat!("Size of: ", stringify!(_SYSTEM_AUDIT_ACE))
  );
  assert_eq!(
    ::std::mem::align_of::<_SYSTEM_AUDIT_ACE>(),
    4usize,
    concat!("Alignment of ", stringify!(_SYSTEM_AUDIT_ACE))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SYSTEM_AUDIT_ACE>())).Header as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_AUDIT_ACE),
      "::",
      stringify!(Header)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SYSTEM_AUDIT_ACE>())).Mask as *const _ as usize },
    4usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_AUDIT_ACE),
      "::",
      stringify!(Mask)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SYSTEM_AUDIT_ACE>())).SidStart as *const _ as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_AUDIT_ACE),
      "::",
      stringify!(SidStart)
    )
  );
}
pub type SYSTEM_AUDIT_ACE = _SYSTEM_AUDIT_ACE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SYSTEM_ALARM_ACE {
  pub Header: ACE_HEADER,
  pub Mask: ACCESS_MASK,
  pub SidStart: DWORD,
}
#[test]
fn bindgen_test_layout__SYSTEM_ALARM_ACE() {
  assert_eq!(
    ::std::mem::size_of::<_SYSTEM_ALARM_ACE>(),
    12usize,
    concat!("Size of: ", stringify!(_SYSTEM_ALARM_ACE))
  );
  assert_eq!(
    ::std::mem::align_of::<_SYSTEM_ALARM_ACE>(),
    4usize,
    concat!("Alignment of ", stringify!(_SYSTEM_ALARM_ACE))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SYSTEM_ALARM_ACE>())).Header as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_ALARM_ACE),
      "::",
      stringify!(Header)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SYSTEM_ALARM_ACE>())).Mask as *const _ as usize },
    4usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_ALARM_ACE),
      "::",
      stringify!(Mask)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SYSTEM_ALARM_ACE>())).SidStart as *const _ as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_ALARM_ACE),
      "::",
      stringify!(SidStart)
    )
  );
}
pub type SYSTEM_ALARM_ACE = _SYSTEM_ALARM_ACE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SYSTEM_RESOURCE_ATTRIBUTE_ACE {
  pub Header: ACE_HEADER,
  pub Mask: ACCESS_MASK,
  pub SidStart: DWORD,
}
#[test]
fn bindgen_test_layout__SYSTEM_RESOURCE_ATTRIBUTE_ACE() {
  assert_eq!(
    ::std::mem::size_of::<_SYSTEM_RESOURCE_ATTRIBUTE_ACE>(),
    12usize,
    concat!("Size of: ", stringify!(_SYSTEM_RESOURCE_ATTRIBUTE_ACE))
  );
  assert_eq!(
    ::std::mem::align_of::<_SYSTEM_RESOURCE_ATTRIBUTE_ACE>(),
    4usize,
    concat!("Alignment of ", stringify!(_SYSTEM_RESOURCE_ATTRIBUTE_ACE))
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_SYSTEM_RESOURCE_ATTRIBUTE_ACE>())).Header as *const _ as usize
    },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_RESOURCE_ATTRIBUTE_ACE),
      "::",
      stringify!(Header)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SYSTEM_RESOURCE_ATTRIBUTE_ACE>())).Mask as *const _ as usize },
    4usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_RESOURCE_ATTRIBUTE_ACE),
      "::",
      stringify!(Mask)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_SYSTEM_RESOURCE_ATTRIBUTE_ACE>())).SidStart as *const _ as usize
    },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_RESOURCE_ATTRIBUTE_ACE),
      "::",
      stringify!(SidStart)
    )
  );
}
pub type SYSTEM_RESOURCE_ATTRIBUTE_ACE = _SYSTEM_RESOURCE_ATTRIBUTE_ACE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SYSTEM_SCOPED_POLICY_ID_ACE {
  pub Header: ACE_HEADER,
  pub Mask: ACCESS_MASK,
  pub SidStart: DWORD,
}
#[test]
fn bindgen_test_layout__SYSTEM_SCOPED_POLICY_ID_ACE() {
  assert_eq!(
    ::std::mem::size_of::<_SYSTEM_SCOPED_POLICY_ID_ACE>(),
    12usize,
    concat!("Size of: ", stringify!(_SYSTEM_SCOPED_POLICY_ID_ACE))
  );
  assert_eq!(
    ::std::mem::align_of::<_SYSTEM_SCOPED_POLICY_ID_ACE>(),
    4usize,
    concat!("Alignment of ", stringify!(_SYSTEM_SCOPED_POLICY_ID_ACE))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SYSTEM_SCOPED_POLICY_ID_ACE>())).Header as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_SCOPED_POLICY_ID_ACE),
      "::",
      stringify!(Header)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SYSTEM_SCOPED_POLICY_ID_ACE>())).Mask as *const _ as usize },
    4usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_SCOPED_POLICY_ID_ACE),
      "::",
      stringify!(Mask)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_SYSTEM_SCOPED_POLICY_ID_ACE>())).SidStart as *const _ as usize
    },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_SCOPED_POLICY_ID_ACE),
      "::",
      stringify!(SidStart)
    )
  );
}
pub type SYSTEM_SCOPED_POLICY_ID_ACE = _SYSTEM_SCOPED_POLICY_ID_ACE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SYSTEM_MANDATORY_LABEL_ACE {
  pub Header: ACE_HEADER,
  pub Mask: ACCESS_MASK,
  pub SidStart: DWORD,
}
#[test]
fn bindgen_test_layout__SYSTEM_MANDATORY_LABEL_ACE() {
  assert_eq!(
    ::std::mem::size_of::<_SYSTEM_MANDATORY_LABEL_ACE>(),
    12usize,
    concat!("Size of: ", stringify!(_SYSTEM_MANDATORY_LABEL_ACE))
  );
  assert_eq!(
    ::std::mem::align_of::<_SYSTEM_MANDATORY_LABEL_ACE>(),
    4usize,
    concat!("Alignment of ", stringify!(_SYSTEM_MANDATORY_LABEL_ACE))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SYSTEM_MANDATORY_LABEL_ACE>())).Header as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_MANDATORY_LABEL_ACE),
      "::",
      stringify!(Header)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SYSTEM_MANDATORY_LABEL_ACE>())).Mask as *const _ as usize },
    4usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_MANDATORY_LABEL_ACE),
      "::",
      stringify!(Mask)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_SYSTEM_MANDATORY_LABEL_ACE>())).SidStart as *const _ as usize
    },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_MANDATORY_LABEL_ACE),
      "::",
      stringify!(SidStart)
    )
  );
}
pub type SYSTEM_MANDATORY_LABEL_ACE = _SYSTEM_MANDATORY_LABEL_ACE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SYSTEM_PROCESS_TRUST_LABEL_ACE {
  pub Header: ACE_HEADER,
  pub Mask: ACCESS_MASK,
  pub SidStart: DWORD,
}
#[test]
fn bindgen_test_layout__SYSTEM_PROCESS_TRUST_LABEL_ACE() {
  assert_eq!(
    ::std::mem::size_of::<_SYSTEM_PROCESS_TRUST_LABEL_ACE>(),
    12usize,
    concat!("Size of: ", stringify!(_SYSTEM_PROCESS_TRUST_LABEL_ACE))
  );
  assert_eq!(
    ::std::mem::align_of::<_SYSTEM_PROCESS_TRUST_LABEL_ACE>(),
    4usize,
    concat!("Alignment of ", stringify!(_SYSTEM_PROCESS_TRUST_LABEL_ACE))
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_SYSTEM_PROCESS_TRUST_LABEL_ACE>())).Header as *const _ as usize
    },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_PROCESS_TRUST_LABEL_ACE),
      "::",
      stringify!(Header)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_SYSTEM_PROCESS_TRUST_LABEL_ACE>())).Mask as *const _ as usize
    },
    4usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_PROCESS_TRUST_LABEL_ACE),
      "::",
      stringify!(Mask)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_SYSTEM_PROCESS_TRUST_LABEL_ACE>())).SidStart as *const _ as usize
    },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_PROCESS_TRUST_LABEL_ACE),
      "::",
      stringify!(SidStart)
    )
  );
}
pub type SYSTEM_PROCESS_TRUST_LABEL_ACE = _SYSTEM_PROCESS_TRUST_LABEL_ACE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SYSTEM_ACCESS_FILTER_ACE {
  pub Header: ACE_HEADER,
  pub Mask: ACCESS_MASK,
  pub SidStart: DWORD,
}
#[test]
fn bindgen_test_layout__SYSTEM_ACCESS_FILTER_ACE() {
  assert_eq!(
    ::std::mem::size_of::<_SYSTEM_ACCESS_FILTER_ACE>(),
    12usize,
    concat!("Size of: ", stringify!(_SYSTEM_ACCESS_FILTER_ACE))
  );
  assert_eq!(
    ::std::mem::align_of::<_SYSTEM_ACCESS_FILTER_ACE>(),
    4usize,
    concat!("Alignment of ", stringify!(_SYSTEM_ACCESS_FILTER_ACE))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SYSTEM_ACCESS_FILTER_ACE>())).Header as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_ACCESS_FILTER_ACE),
      "::",
      stringify!(Header)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SYSTEM_ACCESS_FILTER_ACE>())).Mask as *const _ as usize },
    4usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_ACCESS_FILTER_ACE),
      "::",
      stringify!(Mask)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SYSTEM_ACCESS_FILTER_ACE>())).SidStart as *const _ as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_ACCESS_FILTER_ACE),
      "::",
      stringify!(SidStart)
    )
  );
}
pub type SYSTEM_ACCESS_FILTER_ACE = _SYSTEM_ACCESS_FILTER_ACE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SYSTEM_AUDIT_OBJECT_ACE {
  pub Header: ACE_HEADER,
  pub Mask: ACCESS_MASK,
  pub Flags: DWORD,
  pub ObjectType: GUID,
  pub InheritedObjectType: GUID,
  pub SidStart: DWORD,
}
#[test]
fn bindgen_test_layout__SYSTEM_AUDIT_OBJECT_ACE() {
  assert_eq!(
    ::std::mem::size_of::<_SYSTEM_AUDIT_OBJECT_ACE>(),
    48usize,
    concat!("Size of: ", stringify!(_SYSTEM_AUDIT_OBJECT_ACE))
  );
  assert_eq!(
    ::std::mem::align_of::<_SYSTEM_AUDIT_OBJECT_ACE>(),
    4usize,
    concat!("Alignment of ", stringify!(_SYSTEM_AUDIT_OBJECT_ACE))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SYSTEM_AUDIT_OBJECT_ACE>())).Header as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_AUDIT_OBJECT_ACE),
      "::",
      stringify!(Header)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SYSTEM_AUDIT_OBJECT_ACE>())).Mask as *const _ as usize },
    4usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_AUDIT_OBJECT_ACE),
      "::",
      stringify!(Mask)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SYSTEM_AUDIT_OBJECT_ACE>())).Flags as *const _ as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_AUDIT_OBJECT_ACE),
      "::",
      stringify!(Flags)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SYSTEM_AUDIT_OBJECT_ACE>())).ObjectType as *const _ as usize },
    12usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_AUDIT_OBJECT_ACE),
      "::",
      stringify!(ObjectType)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_SYSTEM_AUDIT_OBJECT_ACE>())).InheritedObjectType as *const _ as usize
    },
    28usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_AUDIT_OBJECT_ACE),
      "::",
      stringify!(InheritedObjectType)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SYSTEM_AUDIT_OBJECT_ACE>())).SidStart as *const _ as usize },
    44usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_AUDIT_OBJECT_ACE),
      "::",
      stringify!(SidStart)
    )
  );
}
pub type SYSTEM_AUDIT_OBJECT_ACE = _SYSTEM_AUDIT_OBJECT_ACE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SYSTEM_ALARM_OBJECT_ACE {
  pub Header: ACE_HEADER,
  pub Mask: ACCESS_MASK,
  pub Flags: DWORD,
  pub ObjectType: GUID,
  pub InheritedObjectType: GUID,
  pub SidStart: DWORD,
}
#[test]
fn bindgen_test_layout__SYSTEM_ALARM_OBJECT_ACE() {
  assert_eq!(
    ::std::mem::size_of::<_SYSTEM_ALARM_OBJECT_ACE>(),
    48usize,
    concat!("Size of: ", stringify!(_SYSTEM_ALARM_OBJECT_ACE))
  );
  assert_eq!(
    ::std::mem::align_of::<_SYSTEM_ALARM_OBJECT_ACE>(),
    4usize,
    concat!("Alignment of ", stringify!(_SYSTEM_ALARM_OBJECT_ACE))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SYSTEM_ALARM_OBJECT_ACE>())).Header as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_ALARM_OBJECT_ACE),
      "::",
      stringify!(Header)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SYSTEM_ALARM_OBJECT_ACE>())).Mask as *const _ as usize },
    4usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_ALARM_OBJECT_ACE),
      "::",
      stringify!(Mask)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SYSTEM_ALARM_OBJECT_ACE>())).Flags as *const _ as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_ALARM_OBJECT_ACE),
      "::",
      stringify!(Flags)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SYSTEM_ALARM_OBJECT_ACE>())).ObjectType as *const _ as usize },
    12usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_ALARM_OBJECT_ACE),
      "::",
      stringify!(ObjectType)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_SYSTEM_ALARM_OBJECT_ACE>())).InheritedObjectType as *const _ as usize
    },
    28usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_ALARM_OBJECT_ACE),
      "::",
      stringify!(InheritedObjectType)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SYSTEM_ALARM_OBJECT_ACE>())).SidStart as *const _ as usize },
    44usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_ALARM_OBJECT_ACE),
      "::",
      stringify!(SidStart)
    )
  );
}
pub type SYSTEM_ALARM_OBJECT_ACE = _SYSTEM_ALARM_OBJECT_ACE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SYSTEM_AUDIT_CALLBACK_ACE {
  pub Header: ACE_HEADER,
  pub Mask: ACCESS_MASK,
  pub SidStart: DWORD,
}
#[test]
fn bindgen_test_layout__SYSTEM_AUDIT_CALLBACK_ACE() {
  assert_eq!(
    ::std::mem::size_of::<_SYSTEM_AUDIT_CALLBACK_ACE>(),
    12usize,
    concat!("Size of: ", stringify!(_SYSTEM_AUDIT_CALLBACK_ACE))
  );
  assert_eq!(
    ::std::mem::align_of::<_SYSTEM_AUDIT_CALLBACK_ACE>(),
    4usize,
    concat!("Alignment of ", stringify!(_SYSTEM_AUDIT_CALLBACK_ACE))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SYSTEM_AUDIT_CALLBACK_ACE>())).Header as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_AUDIT_CALLBACK_ACE),
      "::",
      stringify!(Header)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SYSTEM_AUDIT_CALLBACK_ACE>())).Mask as *const _ as usize },
    4usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_AUDIT_CALLBACK_ACE),
      "::",
      stringify!(Mask)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SYSTEM_AUDIT_CALLBACK_ACE>())).SidStart as *const _ as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_AUDIT_CALLBACK_ACE),
      "::",
      stringify!(SidStart)
    )
  );
}
pub type SYSTEM_AUDIT_CALLBACK_ACE = _SYSTEM_AUDIT_CALLBACK_ACE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SYSTEM_ALARM_CALLBACK_ACE {
  pub Header: ACE_HEADER,
  pub Mask: ACCESS_MASK,
  pub SidStart: DWORD,
}
#[test]
fn bindgen_test_layout__SYSTEM_ALARM_CALLBACK_ACE() {
  assert_eq!(
    ::std::mem::size_of::<_SYSTEM_ALARM_CALLBACK_ACE>(),
    12usize,
    concat!("Size of: ", stringify!(_SYSTEM_ALARM_CALLBACK_ACE))
  );
  assert_eq!(
    ::std::mem::align_of::<_SYSTEM_ALARM_CALLBACK_ACE>(),
    4usize,
    concat!("Alignment of ", stringify!(_SYSTEM_ALARM_CALLBACK_ACE))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SYSTEM_ALARM_CALLBACK_ACE>())).Header as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_ALARM_CALLBACK_ACE),
      "::",
      stringify!(Header)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SYSTEM_ALARM_CALLBACK_ACE>())).Mask as *const _ as usize },
    4usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_ALARM_CALLBACK_ACE),
      "::",
      stringify!(Mask)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SYSTEM_ALARM_CALLBACK_ACE>())).SidStart as *const _ as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_ALARM_CALLBACK_ACE),
      "::",
      stringify!(SidStart)
    )
  );
}
pub type SYSTEM_ALARM_CALLBACK_ACE = _SYSTEM_ALARM_CALLBACK_ACE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SYSTEM_AUDIT_CALLBACK_OBJECT_ACE {
  pub Header: ACE_HEADER,
  pub Mask: ACCESS_MASK,
  pub Flags: DWORD,
  pub ObjectType: GUID,
  pub InheritedObjectType: GUID,
  pub SidStart: DWORD,
}
#[test]
fn bindgen_test_layout__SYSTEM_AUDIT_CALLBACK_OBJECT_ACE() {
  assert_eq!(
    ::std::mem::size_of::<_SYSTEM_AUDIT_CALLBACK_OBJECT_ACE>(),
    48usize,
    concat!("Size of: ", stringify!(_SYSTEM_AUDIT_CALLBACK_OBJECT_ACE))
  );
  assert_eq!(
    ::std::mem::align_of::<_SYSTEM_AUDIT_CALLBACK_OBJECT_ACE>(),
    4usize,
    concat!(
      "Alignment of ",
      stringify!(_SYSTEM_AUDIT_CALLBACK_OBJECT_ACE)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_SYSTEM_AUDIT_CALLBACK_OBJECT_ACE>())).Header as *const _ as usize
    },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_AUDIT_CALLBACK_OBJECT_ACE),
      "::",
      stringify!(Header)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_SYSTEM_AUDIT_CALLBACK_OBJECT_ACE>())).Mask as *const _ as usize
    },
    4usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_AUDIT_CALLBACK_OBJECT_ACE),
      "::",
      stringify!(Mask)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_SYSTEM_AUDIT_CALLBACK_OBJECT_ACE>())).Flags as *const _ as usize
    },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_AUDIT_CALLBACK_OBJECT_ACE),
      "::",
      stringify!(Flags)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_SYSTEM_AUDIT_CALLBACK_OBJECT_ACE>())).ObjectType as *const _ as usize
    },
    12usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_AUDIT_CALLBACK_OBJECT_ACE),
      "::",
      stringify!(ObjectType)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_SYSTEM_AUDIT_CALLBACK_OBJECT_ACE>())).InheritedObjectType as *const _
        as usize
    },
    28usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_AUDIT_CALLBACK_OBJECT_ACE),
      "::",
      stringify!(InheritedObjectType)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_SYSTEM_AUDIT_CALLBACK_OBJECT_ACE>())).SidStart as *const _ as usize
    },
    44usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_AUDIT_CALLBACK_OBJECT_ACE),
      "::",
      stringify!(SidStart)
    )
  );
}
pub type SYSTEM_AUDIT_CALLBACK_OBJECT_ACE = _SYSTEM_AUDIT_CALLBACK_OBJECT_ACE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SYSTEM_ALARM_CALLBACK_OBJECT_ACE {
  pub Header: ACE_HEADER,
  pub Mask: ACCESS_MASK,
  pub Flags: DWORD,
  pub ObjectType: GUID,
  pub InheritedObjectType: GUID,
  pub SidStart: DWORD,
}
#[test]
fn bindgen_test_layout__SYSTEM_ALARM_CALLBACK_OBJECT_ACE() {
  assert_eq!(
    ::std::mem::size_of::<_SYSTEM_ALARM_CALLBACK_OBJECT_ACE>(),
    48usize,
    concat!("Size of: ", stringify!(_SYSTEM_ALARM_CALLBACK_OBJECT_ACE))
  );
  assert_eq!(
    ::std::mem::align_of::<_SYSTEM_ALARM_CALLBACK_OBJECT_ACE>(),
    4usize,
    concat!(
      "Alignment of ",
      stringify!(_SYSTEM_ALARM_CALLBACK_OBJECT_ACE)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_SYSTEM_ALARM_CALLBACK_OBJECT_ACE>())).Header as *const _ as usize
    },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_ALARM_CALLBACK_OBJECT_ACE),
      "::",
      stringify!(Header)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_SYSTEM_ALARM_CALLBACK_OBJECT_ACE>())).Mask as *const _ as usize
    },
    4usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_ALARM_CALLBACK_OBJECT_ACE),
      "::",
      stringify!(Mask)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_SYSTEM_ALARM_CALLBACK_OBJECT_ACE>())).Flags as *const _ as usize
    },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_ALARM_CALLBACK_OBJECT_ACE),
      "::",
      stringify!(Flags)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_SYSTEM_ALARM_CALLBACK_OBJECT_ACE>())).ObjectType as *const _ as usize
    },
    12usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_ALARM_CALLBACK_OBJECT_ACE),
      "::",
      stringify!(ObjectType)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_SYSTEM_ALARM_CALLBACK_OBJECT_ACE>())).InheritedObjectType as *const _
        as usize
    },
    28usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_ALARM_CALLBACK_OBJECT_ACE),
      "::",
      stringify!(InheritedObjectType)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_SYSTEM_ALARM_CALLBACK_OBJECT_ACE>())).SidStart as *const _ as usize
    },
    44usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_ALARM_CALLBACK_OBJECT_ACE),
      "::",
      stringify!(SidStart)
    )
  );
}
pub type SYSTEM_ALARM_CALLBACK_OBJECT_ACE = _SYSTEM_ALARM_CALLBACK_OBJECT_ACE;
pub type SECURITY_DESCRIPTOR_CONTROL = WORD;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SECURITY_DESCRIPTOR_RELATIVE {
  pub Revision: BYTE,
  pub Sbz1: BYTE,
  pub Control: SECURITY_DESCRIPTOR_CONTROL,
  pub Owner: DWORD,
  pub Group: DWORD,
  pub Sacl: DWORD,
  pub Dacl: DWORD,
}
#[test]
fn bindgen_test_layout__SECURITY_DESCRIPTOR_RELATIVE() {
  assert_eq!(
    ::std::mem::size_of::<_SECURITY_DESCRIPTOR_RELATIVE>(),
    20usize,
    concat!("Size of: ", stringify!(_SECURITY_DESCRIPTOR_RELATIVE))
  );
  assert_eq!(
    ::std::mem::align_of::<_SECURITY_DESCRIPTOR_RELATIVE>(),
    4usize,
    concat!("Alignment of ", stringify!(_SECURITY_DESCRIPTOR_RELATIVE))
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_SECURITY_DESCRIPTOR_RELATIVE>())).Revision as *const _ as usize
    },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_SECURITY_DESCRIPTOR_RELATIVE),
      "::",
      stringify!(Revision)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SECURITY_DESCRIPTOR_RELATIVE>())).Sbz1 as *const _ as usize },
    1usize,
    concat!(
      "Offset of field: ",
      stringify!(_SECURITY_DESCRIPTOR_RELATIVE),
      "::",
      stringify!(Sbz1)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_SECURITY_DESCRIPTOR_RELATIVE>())).Control as *const _ as usize
    },
    2usize,
    concat!(
      "Offset of field: ",
      stringify!(_SECURITY_DESCRIPTOR_RELATIVE),
      "::",
      stringify!(Control)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SECURITY_DESCRIPTOR_RELATIVE>())).Owner as *const _ as usize },
    4usize,
    concat!(
      "Offset of field: ",
      stringify!(_SECURITY_DESCRIPTOR_RELATIVE),
      "::",
      stringify!(Owner)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SECURITY_DESCRIPTOR_RELATIVE>())).Group as *const _ as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_SECURITY_DESCRIPTOR_RELATIVE),
      "::",
      stringify!(Group)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SECURITY_DESCRIPTOR_RELATIVE>())).Sacl as *const _ as usize },
    12usize,
    concat!(
      "Offset of field: ",
      stringify!(_SECURITY_DESCRIPTOR_RELATIVE),
      "::",
      stringify!(Sacl)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SECURITY_DESCRIPTOR_RELATIVE>())).Dacl as *const _ as usize },
    16usize,
    concat!(
      "Offset of field: ",
      stringify!(_SECURITY_DESCRIPTOR_RELATIVE),
      "::",
      stringify!(Dacl)
    )
  );
}
pub type SECURITY_DESCRIPTOR_RELATIVE = _SECURITY_DESCRIPTOR_RELATIVE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SECURITY_DESCRIPTOR {
  pub Revision: BYTE,
  pub Sbz1: BYTE,
  pub Control: SECURITY_DESCRIPTOR_CONTROL,
  pub Owner: PSID,
  pub Group: PSID,
  pub Sacl: PACL,
  pub Dacl: PACL,
}
#[test]
fn bindgen_test_layout__SECURITY_DESCRIPTOR() {
  assert_eq!(
    ::std::mem::size_of::<_SECURITY_DESCRIPTOR>(),
    40usize,
    concat!("Size of: ", stringify!(_SECURITY_DESCRIPTOR))
  );
  assert_eq!(
    ::std::mem::align_of::<_SECURITY_DESCRIPTOR>(),
    8usize,
    concat!("Alignment of ", stringify!(_SECURITY_DESCRIPTOR))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SECURITY_DESCRIPTOR>())).Revision as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_SECURITY_DESCRIPTOR),
      "::",
      stringify!(Revision)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SECURITY_DESCRIPTOR>())).Sbz1 as *const _ as usize },
    1usize,
    concat!(
      "Offset of field: ",
      stringify!(_SECURITY_DESCRIPTOR),
      "::",
      stringify!(Sbz1)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SECURITY_DESCRIPTOR>())).Control as *const _ as usize },
    2usize,
    concat!(
      "Offset of field: ",
      stringify!(_SECURITY_DESCRIPTOR),
      "::",
      stringify!(Control)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SECURITY_DESCRIPTOR>())).Owner as *const _ as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_SECURITY_DESCRIPTOR),
      "::",
      stringify!(Owner)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SECURITY_DESCRIPTOR>())).Group as *const _ as usize },
    16usize,
    concat!(
      "Offset of field: ",
      stringify!(_SECURITY_DESCRIPTOR),
      "::",
      stringify!(Group)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SECURITY_DESCRIPTOR>())).Sacl as *const _ as usize },
    24usize,
    concat!(
      "Offset of field: ",
      stringify!(_SECURITY_DESCRIPTOR),
      "::",
      stringify!(Sacl)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SECURITY_DESCRIPTOR>())).Dacl as *const _ as usize },
    32usize,
    concat!(
      "Offset of field: ",
      stringify!(_SECURITY_DESCRIPTOR),
      "::",
      stringify!(Dacl)
    )
  );
}
pub type SECURITY_DESCRIPTOR = _SECURITY_DESCRIPTOR;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SECURITY_OBJECT_AI_PARAMS {
  pub Size: DWORD,
  pub ConstraintMask: DWORD,
}
#[test]
fn bindgen_test_layout__SECURITY_OBJECT_AI_PARAMS() {
  assert_eq!(
    ::std::mem::size_of::<_SECURITY_OBJECT_AI_PARAMS>(),
    8usize,
    concat!("Size of: ", stringify!(_SECURITY_OBJECT_AI_PARAMS))
  );
  assert_eq!(
    ::std::mem::align_of::<_SECURITY_OBJECT_AI_PARAMS>(),
    4usize,
    concat!("Alignment of ", stringify!(_SECURITY_OBJECT_AI_PARAMS))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SECURITY_OBJECT_AI_PARAMS>())).Size as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_SECURITY_OBJECT_AI_PARAMS),
      "::",
      stringify!(Size)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_SECURITY_OBJECT_AI_PARAMS>())).ConstraintMask as *const _ as usize
    },
    4usize,
    concat!(
      "Offset of field: ",
      stringify!(_SECURITY_OBJECT_AI_PARAMS),
      "::",
      stringify!(ConstraintMask)
    )
  );
}
pub type SECURITY_OBJECT_AI_PARAMS = _SECURITY_OBJECT_AI_PARAMS;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _OBJECT_TYPE_LIST {
  pub Level: WORD,
  pub Sbz: WORD,
  pub ObjectType: *mut GUID,
}
#[test]
fn bindgen_test_layout__OBJECT_TYPE_LIST() {
  assert_eq!(
    ::std::mem::size_of::<_OBJECT_TYPE_LIST>(),
    16usize,
    concat!("Size of: ", stringify!(_OBJECT_TYPE_LIST))
  );
  assert_eq!(
    ::std::mem::align_of::<_OBJECT_TYPE_LIST>(),
    8usize,
    concat!("Alignment of ", stringify!(_OBJECT_TYPE_LIST))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_OBJECT_TYPE_LIST>())).Level as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_OBJECT_TYPE_LIST),
      "::",
      stringify!(Level)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_OBJECT_TYPE_LIST>())).Sbz as *const _ as usize },
    2usize,
    concat!(
      "Offset of field: ",
      stringify!(_OBJECT_TYPE_LIST),
      "::",
      stringify!(Sbz)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_OBJECT_TYPE_LIST>())).ObjectType as *const _ as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_OBJECT_TYPE_LIST),
      "::",
      stringify!(ObjectType)
    )
  );
}
pub type POBJECT_TYPE_LIST = *mut _OBJECT_TYPE_LIST;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _PRIVILEGE_SET {
  pub PrivilegeCount: DWORD,
  pub Control: DWORD,
  pub Privilege: [LUID_AND_ATTRIBUTES; 1usize],
}
#[test]
fn bindgen_test_layout__PRIVILEGE_SET() {
  assert_eq!(
    ::std::mem::size_of::<_PRIVILEGE_SET>(),
    20usize,
    concat!("Size of: ", stringify!(_PRIVILEGE_SET))
  );
  assert_eq!(
    ::std::mem::align_of::<_PRIVILEGE_SET>(),
    4usize,
    concat!("Alignment of ", stringify!(_PRIVILEGE_SET))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_PRIVILEGE_SET>())).PrivilegeCount as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_PRIVILEGE_SET),
      "::",
      stringify!(PrivilegeCount)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_PRIVILEGE_SET>())).Control as *const _ as usize },
    4usize,
    concat!(
      "Offset of field: ",
      stringify!(_PRIVILEGE_SET),
      "::",
      stringify!(Control)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_PRIVILEGE_SET>())).Privilege as *const _ as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_PRIVILEGE_SET),
      "::",
      stringify!(Privilege)
    )
  );
}
pub type PPRIVILEGE_SET = *mut _PRIVILEGE_SET;
pub type ACCESS_REASON = DWORD;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ACCESS_REASONS {
  pub Data: [ACCESS_REASON; 32usize],
}
#[test]
fn bindgen_test_layout__ACCESS_REASONS() {
  assert_eq!(
    ::std::mem::size_of::<_ACCESS_REASONS>(),
    128usize,
    concat!("Size of: ", stringify!(_ACCESS_REASONS))
  );
  assert_eq!(
    ::std::mem::align_of::<_ACCESS_REASONS>(),
    4usize,
    concat!("Alignment of ", stringify!(_ACCESS_REASONS))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_ACCESS_REASONS>())).Data as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_ACCESS_REASONS),
      "::",
      stringify!(Data)
    )
  );
}
pub type PACCESS_REASONS = *mut _ACCESS_REASONS;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SE_SECURITY_DESCRIPTOR {
  pub Size: DWORD,
  pub Flags: DWORD,
  pub SecurityDescriptor: PSECURITY_DESCRIPTOR,
}
#[test]
fn bindgen_test_layout__SE_SECURITY_DESCRIPTOR() {
  assert_eq!(
    ::std::mem::size_of::<_SE_SECURITY_DESCRIPTOR>(),
    16usize,
    concat!("Size of: ", stringify!(_SE_SECURITY_DESCRIPTOR))
  );
  assert_eq!(
    ::std::mem::align_of::<_SE_SECURITY_DESCRIPTOR>(),
    8usize,
    concat!("Alignment of ", stringify!(_SE_SECURITY_DESCRIPTOR))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SE_SECURITY_DESCRIPTOR>())).Size as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_SE_SECURITY_DESCRIPTOR),
      "::",
      stringify!(Size)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SE_SECURITY_DESCRIPTOR>())).Flags as *const _ as usize },
    4usize,
    concat!(
      "Offset of field: ",
      stringify!(_SE_SECURITY_DESCRIPTOR),
      "::",
      stringify!(Flags)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_SE_SECURITY_DESCRIPTOR>())).SecurityDescriptor as *const _ as usize
    },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_SE_SECURITY_DESCRIPTOR),
      "::",
      stringify!(SecurityDescriptor)
    )
  );
}
pub type SE_SECURITY_DESCRIPTOR = _SE_SECURITY_DESCRIPTOR;
pub type PSE_SECURITY_DESCRIPTOR = *mut _SE_SECURITY_DESCRIPTOR;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SE_ACCESS_REQUEST {
  pub Size: DWORD,
  pub SeSecurityDescriptor: PSE_SECURITY_DESCRIPTOR,
  pub DesiredAccess: ACCESS_MASK,
  pub PreviouslyGrantedAccess: ACCESS_MASK,
  pub PrincipalSelfSid: PSID,
  pub GenericMapping: PGENERIC_MAPPING,
  pub ObjectTypeListCount: DWORD,
  pub ObjectTypeList: POBJECT_TYPE_LIST,
}
#[test]
fn bindgen_test_layout__SE_ACCESS_REQUEST() {
  assert_eq!(
    ::std::mem::size_of::<_SE_ACCESS_REQUEST>(),
    56usize,
    concat!("Size of: ", stringify!(_SE_ACCESS_REQUEST))
  );
  assert_eq!(
    ::std::mem::align_of::<_SE_ACCESS_REQUEST>(),
    8usize,
    concat!("Alignment of ", stringify!(_SE_ACCESS_REQUEST))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SE_ACCESS_REQUEST>())).Size as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_SE_ACCESS_REQUEST),
      "::",
      stringify!(Size)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_SE_ACCESS_REQUEST>())).SeSecurityDescriptor as *const _ as usize
    },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_SE_ACCESS_REQUEST),
      "::",
      stringify!(SeSecurityDescriptor)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SE_ACCESS_REQUEST>())).DesiredAccess as *const _ as usize },
    16usize,
    concat!(
      "Offset of field: ",
      stringify!(_SE_ACCESS_REQUEST),
      "::",
      stringify!(DesiredAccess)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_SE_ACCESS_REQUEST>())).PreviouslyGrantedAccess as *const _ as usize
    },
    20usize,
    concat!(
      "Offset of field: ",
      stringify!(_SE_ACCESS_REQUEST),
      "::",
      stringify!(PreviouslyGrantedAccess)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SE_ACCESS_REQUEST>())).PrincipalSelfSid as *const _ as usize },
    24usize,
    concat!(
      "Offset of field: ",
      stringify!(_SE_ACCESS_REQUEST),
      "::",
      stringify!(PrincipalSelfSid)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SE_ACCESS_REQUEST>())).GenericMapping as *const _ as usize },
    32usize,
    concat!(
      "Offset of field: ",
      stringify!(_SE_ACCESS_REQUEST),
      "::",
      stringify!(GenericMapping)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_SE_ACCESS_REQUEST>())).ObjectTypeListCount as *const _ as usize
    },
    40usize,
    concat!(
      "Offset of field: ",
      stringify!(_SE_ACCESS_REQUEST),
      "::",
      stringify!(ObjectTypeListCount)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SE_ACCESS_REQUEST>())).ObjectTypeList as *const _ as usize },
    48usize,
    concat!(
      "Offset of field: ",
      stringify!(_SE_ACCESS_REQUEST),
      "::",
      stringify!(ObjectTypeList)
    )
  );
}
pub type SE_ACCESS_REQUEST = _SE_ACCESS_REQUEST;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SE_ACCESS_REPLY {
  pub Size: DWORD,
  pub ResultListCount: DWORD,
  pub GrantedAccess: PACCESS_MASK,
  pub AccessStatus: PDWORD,
  pub AccessReason: PACCESS_REASONS,
  pub Privileges: *mut PPRIVILEGE_SET,
}
#[test]
fn bindgen_test_layout__SE_ACCESS_REPLY() {
  assert_eq!(
    ::std::mem::size_of::<_SE_ACCESS_REPLY>(),
    40usize,
    concat!("Size of: ", stringify!(_SE_ACCESS_REPLY))
  );
  assert_eq!(
    ::std::mem::align_of::<_SE_ACCESS_REPLY>(),
    8usize,
    concat!("Alignment of ", stringify!(_SE_ACCESS_REPLY))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SE_ACCESS_REPLY>())).Size as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_SE_ACCESS_REPLY),
      "::",
      stringify!(Size)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SE_ACCESS_REPLY>())).ResultListCount as *const _ as usize },
    4usize,
    concat!(
      "Offset of field: ",
      stringify!(_SE_ACCESS_REPLY),
      "::",
      stringify!(ResultListCount)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SE_ACCESS_REPLY>())).GrantedAccess as *const _ as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_SE_ACCESS_REPLY),
      "::",
      stringify!(GrantedAccess)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SE_ACCESS_REPLY>())).AccessStatus as *const _ as usize },
    16usize,
    concat!(
      "Offset of field: ",
      stringify!(_SE_ACCESS_REPLY),
      "::",
      stringify!(AccessStatus)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SE_ACCESS_REPLY>())).AccessReason as *const _ as usize },
    24usize,
    concat!(
      "Offset of field: ",
      stringify!(_SE_ACCESS_REPLY),
      "::",
      stringify!(AccessReason)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SE_ACCESS_REPLY>())).Privileges as *const _ as usize },
    32usize,
    concat!(
      "Offset of field: ",
      stringify!(_SE_ACCESS_REPLY),
      "::",
      stringify!(Privileges)
    )
  );
}
pub type SE_ACCESS_REPLY = _SE_ACCESS_REPLY;
pub const _SECURITY_IMPERSONATION_LEVEL_SecurityAnonymous: _SECURITY_IMPERSONATION_LEVEL = 0;
pub const _SECURITY_IMPERSONATION_LEVEL_SecurityIdentification: _SECURITY_IMPERSONATION_LEVEL = 1;
pub const _SECURITY_IMPERSONATION_LEVEL_SecurityImpersonation: _SECURITY_IMPERSONATION_LEVEL = 2;
pub const _SECURITY_IMPERSONATION_LEVEL_SecurityDelegation: _SECURITY_IMPERSONATION_LEVEL = 3;
pub type _SECURITY_IMPERSONATION_LEVEL = ::std::os::raw::c_int;
pub use self::_SECURITY_IMPERSONATION_LEVEL as SECURITY_IMPERSONATION_LEVEL;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _TOKEN_USER {
  pub User: SID_AND_ATTRIBUTES,
}
#[test]
fn bindgen_test_layout__TOKEN_USER() {
  assert_eq!(
    ::std::mem::size_of::<_TOKEN_USER>(),
    16usize,
    concat!("Size of: ", stringify!(_TOKEN_USER))
  );
  assert_eq!(
    ::std::mem::align_of::<_TOKEN_USER>(),
    8usize,
    concat!("Alignment of ", stringify!(_TOKEN_USER))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_TOKEN_USER>())).User as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_TOKEN_USER),
      "::",
      stringify!(User)
    )
  );
}
pub type TOKEN_USER = _TOKEN_USER;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _SE_TOKEN_USER {
  pub __bindgen_anon_1: _SE_TOKEN_USER__bindgen_ty_1,
  pub __bindgen_anon_2: _SE_TOKEN_USER__bindgen_ty_2,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _SE_TOKEN_USER__bindgen_ty_1 {
  pub TokenUser: TOKEN_USER,
  pub User: SID_AND_ATTRIBUTES,
  _bindgen_union_align: [u64; 2usize],
}
#[test]
fn bindgen_test_layout__SE_TOKEN_USER__bindgen_ty_1() {
  assert_eq!(
    ::std::mem::size_of::<_SE_TOKEN_USER__bindgen_ty_1>(),
    16usize,
    concat!("Size of: ", stringify!(_SE_TOKEN_USER__bindgen_ty_1))
  );
  assert_eq!(
    ::std::mem::align_of::<_SE_TOKEN_USER__bindgen_ty_1>(),
    8usize,
    concat!("Alignment of ", stringify!(_SE_TOKEN_USER__bindgen_ty_1))
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_SE_TOKEN_USER__bindgen_ty_1>())).TokenUser as *const _ as usize
    },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_SE_TOKEN_USER__bindgen_ty_1),
      "::",
      stringify!(TokenUser)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SE_TOKEN_USER__bindgen_ty_1>())).User as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_SE_TOKEN_USER__bindgen_ty_1),
      "::",
      stringify!(User)
    )
  );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _SE_TOKEN_USER__bindgen_ty_2 {
  pub Sid: SID,
  pub Buffer: [BYTE; 68usize],
  _bindgen_union_align: [u32; 17usize],
}
#[test]
fn bindgen_test_layout__SE_TOKEN_USER__bindgen_ty_2() {
  assert_eq!(
    ::std::mem::size_of::<_SE_TOKEN_USER__bindgen_ty_2>(),
    68usize,
    concat!("Size of: ", stringify!(_SE_TOKEN_USER__bindgen_ty_2))
  );
  assert_eq!(
    ::std::mem::align_of::<_SE_TOKEN_USER__bindgen_ty_2>(),
    4usize,
    concat!("Alignment of ", stringify!(_SE_TOKEN_USER__bindgen_ty_2))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SE_TOKEN_USER__bindgen_ty_2>())).Sid as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_SE_TOKEN_USER__bindgen_ty_2),
      "::",
      stringify!(Sid)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SE_TOKEN_USER__bindgen_ty_2>())).Buffer as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_SE_TOKEN_USER__bindgen_ty_2),
      "::",
      stringify!(Buffer)
    )
  );
}
#[test]
fn bindgen_test_layout__SE_TOKEN_USER() {
  assert_eq!(
    ::std::mem::size_of::<_SE_TOKEN_USER>(),
    88usize,
    concat!("Size of: ", stringify!(_SE_TOKEN_USER))
  );
  assert_eq!(
    ::std::mem::align_of::<_SE_TOKEN_USER>(),
    8usize,
    concat!("Alignment of ", stringify!(_SE_TOKEN_USER))
  );
}
pub type SE_TOKEN_USER = _SE_TOKEN_USER;
pub type SECURITY_CONTEXT_TRACKING_MODE = BOOLEAN;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SECURITY_QUALITY_OF_SERVICE {
  pub Length: DWORD,
  pub ImpersonationLevel: SECURITY_IMPERSONATION_LEVEL,
  pub ContextTrackingMode: SECURITY_CONTEXT_TRACKING_MODE,
  pub EffectiveOnly: BOOLEAN,
}
#[test]
fn bindgen_test_layout__SECURITY_QUALITY_OF_SERVICE() {
  assert_eq!(
    ::std::mem::size_of::<_SECURITY_QUALITY_OF_SERVICE>(),
    12usize,
    concat!("Size of: ", stringify!(_SECURITY_QUALITY_OF_SERVICE))
  );
  assert_eq!(
    ::std::mem::align_of::<_SECURITY_QUALITY_OF_SERVICE>(),
    4usize,
    concat!("Alignment of ", stringify!(_SECURITY_QUALITY_OF_SERVICE))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SECURITY_QUALITY_OF_SERVICE>())).Length as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_SECURITY_QUALITY_OF_SERVICE),
      "::",
      stringify!(Length)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_SECURITY_QUALITY_OF_SERVICE>())).ImpersonationLevel as *const _
        as usize
    },
    4usize,
    concat!(
      "Offset of field: ",
      stringify!(_SECURITY_QUALITY_OF_SERVICE),
      "::",
      stringify!(ImpersonationLevel)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_SECURITY_QUALITY_OF_SERVICE>())).ContextTrackingMode as *const _
        as usize
    },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_SECURITY_QUALITY_OF_SERVICE),
      "::",
      stringify!(ContextTrackingMode)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_SECURITY_QUALITY_OF_SERVICE>())).EffectiveOnly as *const _ as usize
    },
    9usize,
    concat!(
      "Offset of field: ",
      stringify!(_SECURITY_QUALITY_OF_SERVICE),
      "::",
      stringify!(EffectiveOnly)
    )
  );
}
pub type SECURITY_QUALITY_OF_SERVICE = _SECURITY_QUALITY_OF_SERVICE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SE_IMPERSONATION_STATE {
  pub Token: PACCESS_TOKEN,
  pub CopyOnOpen: BOOLEAN,
  pub EffectiveOnly: BOOLEAN,
  pub Level: SECURITY_IMPERSONATION_LEVEL,
}
#[test]
fn bindgen_test_layout__SE_IMPERSONATION_STATE() {
  assert_eq!(
    ::std::mem::size_of::<_SE_IMPERSONATION_STATE>(),
    16usize,
    concat!("Size of: ", stringify!(_SE_IMPERSONATION_STATE))
  );
  assert_eq!(
    ::std::mem::align_of::<_SE_IMPERSONATION_STATE>(),
    8usize,
    concat!("Alignment of ", stringify!(_SE_IMPERSONATION_STATE))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SE_IMPERSONATION_STATE>())).Token as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_SE_IMPERSONATION_STATE),
      "::",
      stringify!(Token)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SE_IMPERSONATION_STATE>())).CopyOnOpen as *const _ as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_SE_IMPERSONATION_STATE),
      "::",
      stringify!(CopyOnOpen)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_SE_IMPERSONATION_STATE>())).EffectiveOnly as *const _ as usize
    },
    9usize,
    concat!(
      "Offset of field: ",
      stringify!(_SE_IMPERSONATION_STATE),
      "::",
      stringify!(EffectiveOnly)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SE_IMPERSONATION_STATE>())).Level as *const _ as usize },
    12usize,
    concat!(
      "Offset of field: ",
      stringify!(_SE_IMPERSONATION_STATE),
      "::",
      stringify!(Level)
    )
  );
}
pub type SE_IMPERSONATION_STATE = _SE_IMPERSONATION_STATE;
pub type SECURITY_INFORMATION = DWORD;
pub type SE_SIGNING_LEVEL = BYTE;
pub const _SE_IMAGE_SIGNATURE_TYPE_SeImageSignatureNone: _SE_IMAGE_SIGNATURE_TYPE = 0;
pub const _SE_IMAGE_SIGNATURE_TYPE_SeImageSignatureEmbedded: _SE_IMAGE_SIGNATURE_TYPE = 1;
pub const _SE_IMAGE_SIGNATURE_TYPE_SeImageSignatureCache: _SE_IMAGE_SIGNATURE_TYPE = 2;
pub const _SE_IMAGE_SIGNATURE_TYPE_SeImageSignatureCatalogCached: _SE_IMAGE_SIGNATURE_TYPE = 3;
pub const _SE_IMAGE_SIGNATURE_TYPE_SeImageSignatureCatalogNotCached: _SE_IMAGE_SIGNATURE_TYPE = 4;
pub const _SE_IMAGE_SIGNATURE_TYPE_SeImageSignatureCatalogHint: _SE_IMAGE_SIGNATURE_TYPE = 5;
pub const _SE_IMAGE_SIGNATURE_TYPE_SeImageSignaturePackageCatalog: _SE_IMAGE_SIGNATURE_TYPE = 6;
pub type _SE_IMAGE_SIGNATURE_TYPE = ::std::os::raw::c_int;
pub use self::_SE_IMAGE_SIGNATURE_TYPE as SE_IMAGE_SIGNATURE_TYPE;
pub const _SE_LEARNING_MODE_DATA_TYPE_SeLearningModeInvalidType: _SE_LEARNING_MODE_DATA_TYPE = 0;
pub const _SE_LEARNING_MODE_DATA_TYPE_SeLearningModeSettings: _SE_LEARNING_MODE_DATA_TYPE = 1;
pub const _SE_LEARNING_MODE_DATA_TYPE_SeLearningModeMax: _SE_LEARNING_MODE_DATA_TYPE = 2;
pub type _SE_LEARNING_MODE_DATA_TYPE = ::std::os::raw::c_int;
pub use self::_SE_LEARNING_MODE_DATA_TYPE as SE_LEARNING_MODE_DATA_TYPE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SECURITY_CAPABILITIES {
  pub AppContainerSid: PSID,
  pub Capabilities: PSID_AND_ATTRIBUTES,
  pub CapabilityCount: DWORD,
  pub Reserved: DWORD,
}
#[test]
fn bindgen_test_layout__SECURITY_CAPABILITIES() {
  assert_eq!(
    ::std::mem::size_of::<_SECURITY_CAPABILITIES>(),
    24usize,
    concat!("Size of: ", stringify!(_SECURITY_CAPABILITIES))
  );
  assert_eq!(
    ::std::mem::align_of::<_SECURITY_CAPABILITIES>(),
    8usize,
    concat!("Alignment of ", stringify!(_SECURITY_CAPABILITIES))
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_SECURITY_CAPABILITIES>())).AppContainerSid as *const _ as usize
    },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_SECURITY_CAPABILITIES),
      "::",
      stringify!(AppContainerSid)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SECURITY_CAPABILITIES>())).Capabilities as *const _ as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_SECURITY_CAPABILITIES),
      "::",
      stringify!(Capabilities)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_SECURITY_CAPABILITIES>())).CapabilityCount as *const _ as usize
    },
    16usize,
    concat!(
      "Offset of field: ",
      stringify!(_SECURITY_CAPABILITIES),
      "::",
      stringify!(CapabilityCount)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SECURITY_CAPABILITIES>())).Reserved as *const _ as usize },
    20usize,
    concat!(
      "Offset of field: ",
      stringify!(_SECURITY_CAPABILITIES),
      "::",
      stringify!(Reserved)
    )
  );
}
pub type SECURITY_CAPABILITIES = _SECURITY_CAPABILITIES;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SILOOBJECT_BASIC_INFORMATION {
  pub SiloId: DWORD,
  pub SiloParentId: DWORD,
  pub NumberOfProcesses: DWORD,
  pub IsInServerSilo: BOOLEAN,
  pub Reserved: [BYTE; 3usize],
}
#[test]
fn bindgen_test_layout__SILOOBJECT_BASIC_INFORMATION() {
  assert_eq!(
    ::std::mem::size_of::<_SILOOBJECT_BASIC_INFORMATION>(),
    16usize,
    concat!("Size of: ", stringify!(_SILOOBJECT_BASIC_INFORMATION))
  );
  assert_eq!(
    ::std::mem::align_of::<_SILOOBJECT_BASIC_INFORMATION>(),
    4usize,
    concat!("Alignment of ", stringify!(_SILOOBJECT_BASIC_INFORMATION))
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_SILOOBJECT_BASIC_INFORMATION>())).SiloId as *const _ as usize
    },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_SILOOBJECT_BASIC_INFORMATION),
      "::",
      stringify!(SiloId)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_SILOOBJECT_BASIC_INFORMATION>())).SiloParentId as *const _ as usize
    },
    4usize,
    concat!(
      "Offset of field: ",
      stringify!(_SILOOBJECT_BASIC_INFORMATION),
      "::",
      stringify!(SiloParentId)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_SILOOBJECT_BASIC_INFORMATION>())).NumberOfProcesses as *const _
        as usize
    },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_SILOOBJECT_BASIC_INFORMATION),
      "::",
      stringify!(NumberOfProcesses)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_SILOOBJECT_BASIC_INFORMATION>())).IsInServerSilo as *const _ as usize
    },
    12usize,
    concat!(
      "Offset of field: ",
      stringify!(_SILOOBJECT_BASIC_INFORMATION),
      "::",
      stringify!(IsInServerSilo)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_SILOOBJECT_BASIC_INFORMATION>())).Reserved as *const _ as usize
    },
    13usize,
    concat!(
      "Offset of field: ",
      stringify!(_SILOOBJECT_BASIC_INFORMATION),
      "::",
      stringify!(Reserved)
    )
  );
}
pub type SILOOBJECT_BASIC_INFORMATION = _SILOOBJECT_BASIC_INFORMATION;
pub const _SERVERSILO_STATE_SERVERSILO_INITING: _SERVERSILO_STATE = 0;
pub const _SERVERSILO_STATE_SERVERSILO_STARTED: _SERVERSILO_STATE = 1;
pub const _SERVERSILO_STATE_SERVERSILO_SHUTTING_DOWN: _SERVERSILO_STATE = 2;
pub const _SERVERSILO_STATE_SERVERSILO_TERMINATING: _SERVERSILO_STATE = 3;
pub const _SERVERSILO_STATE_SERVERSILO_TERMINATED: _SERVERSILO_STATE = 4;
pub type _SERVERSILO_STATE = ::std::os::raw::c_int;
pub use self::_SERVERSILO_STATE as SERVERSILO_STATE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SERVERSILO_BASIC_INFORMATION {
  pub ServiceSessionId: DWORD,
  pub State: SERVERSILO_STATE,
  pub ExitStatus: DWORD,
}
#[test]
fn bindgen_test_layout__SERVERSILO_BASIC_INFORMATION() {
  assert_eq!(
    ::std::mem::size_of::<_SERVERSILO_BASIC_INFORMATION>(),
    12usize,
    concat!("Size of: ", stringify!(_SERVERSILO_BASIC_INFORMATION))
  );
  assert_eq!(
    ::std::mem::align_of::<_SERVERSILO_BASIC_INFORMATION>(),
    4usize,
    concat!("Alignment of ", stringify!(_SERVERSILO_BASIC_INFORMATION))
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_SERVERSILO_BASIC_INFORMATION>())).ServiceSessionId as *const _
        as usize
    },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_SERVERSILO_BASIC_INFORMATION),
      "::",
      stringify!(ServiceSessionId)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SERVERSILO_BASIC_INFORMATION>())).State as *const _ as usize },
    4usize,
    concat!(
      "Offset of field: ",
      stringify!(_SERVERSILO_BASIC_INFORMATION),
      "::",
      stringify!(State)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_SERVERSILO_BASIC_INFORMATION>())).ExitStatus as *const _ as usize
    },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_SERVERSILO_BASIC_INFORMATION),
      "::",
      stringify!(ExitStatus)
    )
  );
}
pub type SERVERSILO_BASIC_INFORMATION = _SERVERSILO_BASIC_INFORMATION;
pub const _LOGICAL_PROCESSOR_RELATIONSHIP_RelationProcessorCore: _LOGICAL_PROCESSOR_RELATIONSHIP =
  0;
pub const _LOGICAL_PROCESSOR_RELATIONSHIP_RelationNumaNode: _LOGICAL_PROCESSOR_RELATIONSHIP = 1;
pub const _LOGICAL_PROCESSOR_RELATIONSHIP_RelationCache: _LOGICAL_PROCESSOR_RELATIONSHIP = 2;
pub const _LOGICAL_PROCESSOR_RELATIONSHIP_RelationProcessorPackage:
  _LOGICAL_PROCESSOR_RELATIONSHIP = 3;
pub const _LOGICAL_PROCESSOR_RELATIONSHIP_RelationGroup: _LOGICAL_PROCESSOR_RELATIONSHIP = 4;
pub const _LOGICAL_PROCESSOR_RELATIONSHIP_RelationAll: _LOGICAL_PROCESSOR_RELATIONSHIP = 65535;
pub type _LOGICAL_PROCESSOR_RELATIONSHIP = ::std::os::raw::c_int;
pub use self::_LOGICAL_PROCESSOR_RELATIONSHIP as LOGICAL_PROCESSOR_RELATIONSHIP;
pub const _PROCESSOR_CACHE_TYPE_CacheUnified: _PROCESSOR_CACHE_TYPE = 0;
pub const _PROCESSOR_CACHE_TYPE_CacheInstruction: _PROCESSOR_CACHE_TYPE = 1;
pub const _PROCESSOR_CACHE_TYPE_CacheData: _PROCESSOR_CACHE_TYPE = 2;
pub const _PROCESSOR_CACHE_TYPE_CacheTrace: _PROCESSOR_CACHE_TYPE = 3;
pub type _PROCESSOR_CACHE_TYPE = ::std::os::raw::c_int;
pub use self::_PROCESSOR_CACHE_TYPE as PROCESSOR_CACHE_TYPE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _CACHE_DESCRIPTOR {
  pub Level: BYTE,
  pub Associativity: BYTE,
  pub LineSize: WORD,
  pub Size: DWORD,
  pub Type: PROCESSOR_CACHE_TYPE,
}
#[test]
fn bindgen_test_layout__CACHE_DESCRIPTOR() {
  assert_eq!(
    ::std::mem::size_of::<_CACHE_DESCRIPTOR>(),
    12usize,
    concat!("Size of: ", stringify!(_CACHE_DESCRIPTOR))
  );
  assert_eq!(
    ::std::mem::align_of::<_CACHE_DESCRIPTOR>(),
    4usize,
    concat!("Alignment of ", stringify!(_CACHE_DESCRIPTOR))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_CACHE_DESCRIPTOR>())).Level as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_CACHE_DESCRIPTOR),
      "::",
      stringify!(Level)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_CACHE_DESCRIPTOR>())).Associativity as *const _ as usize },
    1usize,
    concat!(
      "Offset of field: ",
      stringify!(_CACHE_DESCRIPTOR),
      "::",
      stringify!(Associativity)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_CACHE_DESCRIPTOR>())).LineSize as *const _ as usize },
    2usize,
    concat!(
      "Offset of field: ",
      stringify!(_CACHE_DESCRIPTOR),
      "::",
      stringify!(LineSize)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_CACHE_DESCRIPTOR>())).Size as *const _ as usize },
    4usize,
    concat!(
      "Offset of field: ",
      stringify!(_CACHE_DESCRIPTOR),
      "::",
      stringify!(Size)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_CACHE_DESCRIPTOR>())).Type as *const _ as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_CACHE_DESCRIPTOR),
      "::",
      stringify!(Type)
    )
  );
}
pub type CACHE_DESCRIPTOR = _CACHE_DESCRIPTOR;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _SYSTEM_LOGICAL_PROCESSOR_INFORMATION {
  pub ProcessorMask: ULONG_PTR,
  pub Relationship: LOGICAL_PROCESSOR_RELATIONSHIP,
  pub __bindgen_anon_1: _SYSTEM_LOGICAL_PROCESSOR_INFORMATION__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _SYSTEM_LOGICAL_PROCESSOR_INFORMATION__bindgen_ty_1 {
  pub ProcessorCore: _SYSTEM_LOGICAL_PROCESSOR_INFORMATION__bindgen_ty_1__bindgen_ty_1,
  pub NumaNode: _SYSTEM_LOGICAL_PROCESSOR_INFORMATION__bindgen_ty_1__bindgen_ty_2,
  pub Cache: CACHE_DESCRIPTOR,
  pub Reserved: [ULONGLONG; 2usize],
  _bindgen_union_align: [u64; 2usize],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SYSTEM_LOGICAL_PROCESSOR_INFORMATION__bindgen_ty_1__bindgen_ty_1 {
  pub Flags: BYTE,
}
#[test]
fn bindgen_test_layout__SYSTEM_LOGICAL_PROCESSOR_INFORMATION__bindgen_ty_1__bindgen_ty_1() {
  assert_eq!(
    ::std::mem::size_of::<_SYSTEM_LOGICAL_PROCESSOR_INFORMATION__bindgen_ty_1__bindgen_ty_1>(),
    1usize,
    concat!(
      "Size of: ",
      stringify!(_SYSTEM_LOGICAL_PROCESSOR_INFORMATION__bindgen_ty_1__bindgen_ty_1)
    )
  );
  assert_eq!(
    ::std::mem::align_of::<_SYSTEM_LOGICAL_PROCESSOR_INFORMATION__bindgen_ty_1__bindgen_ty_1>(),
    1usize,
    concat!(
      "Alignment of ",
      stringify!(_SYSTEM_LOGICAL_PROCESSOR_INFORMATION__bindgen_ty_1__bindgen_ty_1)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_SYSTEM_LOGICAL_PROCESSOR_INFORMATION__bindgen_ty_1__bindgen_ty_1>()))
        .Flags as *const _ as usize
    },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_LOGICAL_PROCESSOR_INFORMATION__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(Flags)
    )
  );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SYSTEM_LOGICAL_PROCESSOR_INFORMATION__bindgen_ty_1__bindgen_ty_2 {
  pub NodeNumber: DWORD,
}
#[test]
fn bindgen_test_layout__SYSTEM_LOGICAL_PROCESSOR_INFORMATION__bindgen_ty_1__bindgen_ty_2() {
  assert_eq!(
    ::std::mem::size_of::<_SYSTEM_LOGICAL_PROCESSOR_INFORMATION__bindgen_ty_1__bindgen_ty_2>(),
    4usize,
    concat!(
      "Size of: ",
      stringify!(_SYSTEM_LOGICAL_PROCESSOR_INFORMATION__bindgen_ty_1__bindgen_ty_2)
    )
  );
  assert_eq!(
    ::std::mem::align_of::<_SYSTEM_LOGICAL_PROCESSOR_INFORMATION__bindgen_ty_1__bindgen_ty_2>(),
    4usize,
    concat!(
      "Alignment of ",
      stringify!(_SYSTEM_LOGICAL_PROCESSOR_INFORMATION__bindgen_ty_1__bindgen_ty_2)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_SYSTEM_LOGICAL_PROCESSOR_INFORMATION__bindgen_ty_1__bindgen_ty_2>()))
        .NodeNumber as *const _ as usize
    },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_LOGICAL_PROCESSOR_INFORMATION__bindgen_ty_1__bindgen_ty_2),
      "::",
      stringify!(NodeNumber)
    )
  );
}
#[test]
fn bindgen_test_layout__SYSTEM_LOGICAL_PROCESSOR_INFORMATION__bindgen_ty_1() {
  assert_eq!(
    ::std::mem::size_of::<_SYSTEM_LOGICAL_PROCESSOR_INFORMATION__bindgen_ty_1>(),
    16usize,
    concat!(
      "Size of: ",
      stringify!(_SYSTEM_LOGICAL_PROCESSOR_INFORMATION__bindgen_ty_1)
    )
  );
  assert_eq!(
    ::std::mem::align_of::<_SYSTEM_LOGICAL_PROCESSOR_INFORMATION__bindgen_ty_1>(),
    8usize,
    concat!(
      "Alignment of ",
      stringify!(_SYSTEM_LOGICAL_PROCESSOR_INFORMATION__bindgen_ty_1)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_SYSTEM_LOGICAL_PROCESSOR_INFORMATION__bindgen_ty_1>())).ProcessorCore
        as *const _ as usize
    },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_LOGICAL_PROCESSOR_INFORMATION__bindgen_ty_1),
      "::",
      stringify!(ProcessorCore)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_SYSTEM_LOGICAL_PROCESSOR_INFORMATION__bindgen_ty_1>())).NumaNode
        as *const _ as usize
    },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_LOGICAL_PROCESSOR_INFORMATION__bindgen_ty_1),
      "::",
      stringify!(NumaNode)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_SYSTEM_LOGICAL_PROCESSOR_INFORMATION__bindgen_ty_1>())).Cache
        as *const _ as usize
    },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_LOGICAL_PROCESSOR_INFORMATION__bindgen_ty_1),
      "::",
      stringify!(Cache)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_SYSTEM_LOGICAL_PROCESSOR_INFORMATION__bindgen_ty_1>())).Reserved
        as *const _ as usize
    },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_LOGICAL_PROCESSOR_INFORMATION__bindgen_ty_1),
      "::",
      stringify!(Reserved)
    )
  );
}
#[test]
fn bindgen_test_layout__SYSTEM_LOGICAL_PROCESSOR_INFORMATION() {
  assert_eq!(
    ::std::mem::size_of::<_SYSTEM_LOGICAL_PROCESSOR_INFORMATION>(),
    32usize,
    concat!(
      "Size of: ",
      stringify!(_SYSTEM_LOGICAL_PROCESSOR_INFORMATION)
    )
  );
  assert_eq!(
    ::std::mem::align_of::<_SYSTEM_LOGICAL_PROCESSOR_INFORMATION>(),
    8usize,
    concat!(
      "Alignment of ",
      stringify!(_SYSTEM_LOGICAL_PROCESSOR_INFORMATION)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_SYSTEM_LOGICAL_PROCESSOR_INFORMATION>())).ProcessorMask as *const _
        as usize
    },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_LOGICAL_PROCESSOR_INFORMATION),
      "::",
      stringify!(ProcessorMask)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_SYSTEM_LOGICAL_PROCESSOR_INFORMATION>())).Relationship as *const _
        as usize
    },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_LOGICAL_PROCESSOR_INFORMATION),
      "::",
      stringify!(Relationship)
    )
  );
}
pub type SYSTEM_LOGICAL_PROCESSOR_INFORMATION = _SYSTEM_LOGICAL_PROCESSOR_INFORMATION;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _PROCESSOR_RELATIONSHIP {
  pub Flags: BYTE,
  pub EfficiencyClass: BYTE,
  pub Reserved: [BYTE; 20usize],
  pub GroupCount: WORD,
  pub GroupMask: [GROUP_AFFINITY; 1usize],
}
#[test]
fn bindgen_test_layout__PROCESSOR_RELATIONSHIP() {
  assert_eq!(
    ::std::mem::size_of::<_PROCESSOR_RELATIONSHIP>(),
    40usize,
    concat!("Size of: ", stringify!(_PROCESSOR_RELATIONSHIP))
  );
  assert_eq!(
    ::std::mem::align_of::<_PROCESSOR_RELATIONSHIP>(),
    8usize,
    concat!("Alignment of ", stringify!(_PROCESSOR_RELATIONSHIP))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_PROCESSOR_RELATIONSHIP>())).Flags as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_PROCESSOR_RELATIONSHIP),
      "::",
      stringify!(Flags)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_PROCESSOR_RELATIONSHIP>())).EfficiencyClass as *const _ as usize
    },
    1usize,
    concat!(
      "Offset of field: ",
      stringify!(_PROCESSOR_RELATIONSHIP),
      "::",
      stringify!(EfficiencyClass)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_PROCESSOR_RELATIONSHIP>())).Reserved as *const _ as usize },
    2usize,
    concat!(
      "Offset of field: ",
      stringify!(_PROCESSOR_RELATIONSHIP),
      "::",
      stringify!(Reserved)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_PROCESSOR_RELATIONSHIP>())).GroupCount as *const _ as usize },
    22usize,
    concat!(
      "Offset of field: ",
      stringify!(_PROCESSOR_RELATIONSHIP),
      "::",
      stringify!(GroupCount)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_PROCESSOR_RELATIONSHIP>())).GroupMask as *const _ as usize },
    24usize,
    concat!(
      "Offset of field: ",
      stringify!(_PROCESSOR_RELATIONSHIP),
      "::",
      stringify!(GroupMask)
    )
  );
}
pub type PROCESSOR_RELATIONSHIP = _PROCESSOR_RELATIONSHIP;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _NUMA_NODE_RELATIONSHIP {
  pub NodeNumber: DWORD,
  pub Reserved: [BYTE; 20usize],
  pub GroupMask: GROUP_AFFINITY,
}
#[test]
fn bindgen_test_layout__NUMA_NODE_RELATIONSHIP() {
  assert_eq!(
    ::std::mem::size_of::<_NUMA_NODE_RELATIONSHIP>(),
    40usize,
    concat!("Size of: ", stringify!(_NUMA_NODE_RELATIONSHIP))
  );
  assert_eq!(
    ::std::mem::align_of::<_NUMA_NODE_RELATIONSHIP>(),
    8usize,
    concat!("Alignment of ", stringify!(_NUMA_NODE_RELATIONSHIP))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_NUMA_NODE_RELATIONSHIP>())).NodeNumber as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_NUMA_NODE_RELATIONSHIP),
      "::",
      stringify!(NodeNumber)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_NUMA_NODE_RELATIONSHIP>())).Reserved as *const _ as usize },
    4usize,
    concat!(
      "Offset of field: ",
      stringify!(_NUMA_NODE_RELATIONSHIP),
      "::",
      stringify!(Reserved)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_NUMA_NODE_RELATIONSHIP>())).GroupMask as *const _ as usize },
    24usize,
    concat!(
      "Offset of field: ",
      stringify!(_NUMA_NODE_RELATIONSHIP),
      "::",
      stringify!(GroupMask)
    )
  );
}
pub type NUMA_NODE_RELATIONSHIP = _NUMA_NODE_RELATIONSHIP;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _CACHE_RELATIONSHIP {
  pub Level: BYTE,
  pub Associativity: BYTE,
  pub LineSize: WORD,
  pub CacheSize: DWORD,
  pub Type: PROCESSOR_CACHE_TYPE,
  pub Reserved: [BYTE; 20usize],
  pub GroupMask: GROUP_AFFINITY,
}
#[test]
fn bindgen_test_layout__CACHE_RELATIONSHIP() {
  assert_eq!(
    ::std::mem::size_of::<_CACHE_RELATIONSHIP>(),
    48usize,
    concat!("Size of: ", stringify!(_CACHE_RELATIONSHIP))
  );
  assert_eq!(
    ::std::mem::align_of::<_CACHE_RELATIONSHIP>(),
    8usize,
    concat!("Alignment of ", stringify!(_CACHE_RELATIONSHIP))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_CACHE_RELATIONSHIP>())).Level as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_CACHE_RELATIONSHIP),
      "::",
      stringify!(Level)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_CACHE_RELATIONSHIP>())).Associativity as *const _ as usize },
    1usize,
    concat!(
      "Offset of field: ",
      stringify!(_CACHE_RELATIONSHIP),
      "::",
      stringify!(Associativity)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_CACHE_RELATIONSHIP>())).LineSize as *const _ as usize },
    2usize,
    concat!(
      "Offset of field: ",
      stringify!(_CACHE_RELATIONSHIP),
      "::",
      stringify!(LineSize)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_CACHE_RELATIONSHIP>())).CacheSize as *const _ as usize },
    4usize,
    concat!(
      "Offset of field: ",
      stringify!(_CACHE_RELATIONSHIP),
      "::",
      stringify!(CacheSize)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_CACHE_RELATIONSHIP>())).Type as *const _ as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_CACHE_RELATIONSHIP),
      "::",
      stringify!(Type)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_CACHE_RELATIONSHIP>())).Reserved as *const _ as usize },
    12usize,
    concat!(
      "Offset of field: ",
      stringify!(_CACHE_RELATIONSHIP),
      "::",
      stringify!(Reserved)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_CACHE_RELATIONSHIP>())).GroupMask as *const _ as usize },
    32usize,
    concat!(
      "Offset of field: ",
      stringify!(_CACHE_RELATIONSHIP),
      "::",
      stringify!(GroupMask)
    )
  );
}
pub type CACHE_RELATIONSHIP = _CACHE_RELATIONSHIP;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _PROCESSOR_GROUP_INFO {
  pub MaximumProcessorCount: BYTE,
  pub ActiveProcessorCount: BYTE,
  pub Reserved: [BYTE; 38usize],
  pub ActiveProcessorMask: KAFFINITY,
}
#[test]
fn bindgen_test_layout__PROCESSOR_GROUP_INFO() {
  assert_eq!(
    ::std::mem::size_of::<_PROCESSOR_GROUP_INFO>(),
    48usize,
    concat!("Size of: ", stringify!(_PROCESSOR_GROUP_INFO))
  );
  assert_eq!(
    ::std::mem::align_of::<_PROCESSOR_GROUP_INFO>(),
    8usize,
    concat!("Alignment of ", stringify!(_PROCESSOR_GROUP_INFO))
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_PROCESSOR_GROUP_INFO>())).MaximumProcessorCount as *const _ as usize
    },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_PROCESSOR_GROUP_INFO),
      "::",
      stringify!(MaximumProcessorCount)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_PROCESSOR_GROUP_INFO>())).ActiveProcessorCount as *const _ as usize
    },
    1usize,
    concat!(
      "Offset of field: ",
      stringify!(_PROCESSOR_GROUP_INFO),
      "::",
      stringify!(ActiveProcessorCount)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_PROCESSOR_GROUP_INFO>())).Reserved as *const _ as usize },
    2usize,
    concat!(
      "Offset of field: ",
      stringify!(_PROCESSOR_GROUP_INFO),
      "::",
      stringify!(Reserved)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_PROCESSOR_GROUP_INFO>())).ActiveProcessorMask as *const _ as usize
    },
    40usize,
    concat!(
      "Offset of field: ",
      stringify!(_PROCESSOR_GROUP_INFO),
      "::",
      stringify!(ActiveProcessorMask)
    )
  );
}
pub type PROCESSOR_GROUP_INFO = _PROCESSOR_GROUP_INFO;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _GROUP_RELATIONSHIP {
  pub MaximumGroupCount: WORD,
  pub ActiveGroupCount: WORD,
  pub Reserved: [BYTE; 20usize],
  pub GroupInfo: [PROCESSOR_GROUP_INFO; 1usize],
}
#[test]
fn bindgen_test_layout__GROUP_RELATIONSHIP() {
  assert_eq!(
    ::std::mem::size_of::<_GROUP_RELATIONSHIP>(),
    72usize,
    concat!("Size of: ", stringify!(_GROUP_RELATIONSHIP))
  );
  assert_eq!(
    ::std::mem::align_of::<_GROUP_RELATIONSHIP>(),
    8usize,
    concat!("Alignment of ", stringify!(_GROUP_RELATIONSHIP))
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_GROUP_RELATIONSHIP>())).MaximumGroupCount as *const _ as usize
    },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_GROUP_RELATIONSHIP),
      "::",
      stringify!(MaximumGroupCount)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_GROUP_RELATIONSHIP>())).ActiveGroupCount as *const _ as usize
    },
    2usize,
    concat!(
      "Offset of field: ",
      stringify!(_GROUP_RELATIONSHIP),
      "::",
      stringify!(ActiveGroupCount)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_GROUP_RELATIONSHIP>())).Reserved as *const _ as usize },
    4usize,
    concat!(
      "Offset of field: ",
      stringify!(_GROUP_RELATIONSHIP),
      "::",
      stringify!(Reserved)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_GROUP_RELATIONSHIP>())).GroupInfo as *const _ as usize },
    24usize,
    concat!(
      "Offset of field: ",
      stringify!(_GROUP_RELATIONSHIP),
      "::",
      stringify!(GroupInfo)
    )
  );
}
pub type GROUP_RELATIONSHIP = _GROUP_RELATIONSHIP;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _SYSTEM_LOGICAL_PROCESSOR_INFORMATION_EX {
  pub Relationship: LOGICAL_PROCESSOR_RELATIONSHIP,
  pub Size: DWORD,
  pub __bindgen_anon_1: _SYSTEM_LOGICAL_PROCESSOR_INFORMATION_EX__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _SYSTEM_LOGICAL_PROCESSOR_INFORMATION_EX__bindgen_ty_1 {
  pub Processor: PROCESSOR_RELATIONSHIP,
  pub NumaNode: NUMA_NODE_RELATIONSHIP,
  pub Cache: CACHE_RELATIONSHIP,
  pub Group: GROUP_RELATIONSHIP,
  _bindgen_union_align: [u64; 9usize],
}
#[test]
fn bindgen_test_layout__SYSTEM_LOGICAL_PROCESSOR_INFORMATION_EX__bindgen_ty_1() {
  assert_eq!(
    ::std::mem::size_of::<_SYSTEM_LOGICAL_PROCESSOR_INFORMATION_EX__bindgen_ty_1>(),
    72usize,
    concat!(
      "Size of: ",
      stringify!(_SYSTEM_LOGICAL_PROCESSOR_INFORMATION_EX__bindgen_ty_1)
    )
  );
  assert_eq!(
    ::std::mem::align_of::<_SYSTEM_LOGICAL_PROCESSOR_INFORMATION_EX__bindgen_ty_1>(),
    8usize,
    concat!(
      "Alignment of ",
      stringify!(_SYSTEM_LOGICAL_PROCESSOR_INFORMATION_EX__bindgen_ty_1)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_SYSTEM_LOGICAL_PROCESSOR_INFORMATION_EX__bindgen_ty_1>())).Processor
        as *const _ as usize
    },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_LOGICAL_PROCESSOR_INFORMATION_EX__bindgen_ty_1),
      "::",
      stringify!(Processor)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_SYSTEM_LOGICAL_PROCESSOR_INFORMATION_EX__bindgen_ty_1>())).NumaNode
        as *const _ as usize
    },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_LOGICAL_PROCESSOR_INFORMATION_EX__bindgen_ty_1),
      "::",
      stringify!(NumaNode)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_SYSTEM_LOGICAL_PROCESSOR_INFORMATION_EX__bindgen_ty_1>())).Cache
        as *const _ as usize
    },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_LOGICAL_PROCESSOR_INFORMATION_EX__bindgen_ty_1),
      "::",
      stringify!(Cache)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_SYSTEM_LOGICAL_PROCESSOR_INFORMATION_EX__bindgen_ty_1>())).Group
        as *const _ as usize
    },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_LOGICAL_PROCESSOR_INFORMATION_EX__bindgen_ty_1),
      "::",
      stringify!(Group)
    )
  );
}
#[test]
fn bindgen_test_layout__SYSTEM_LOGICAL_PROCESSOR_INFORMATION_EX() {
  assert_eq!(
    ::std::mem::size_of::<_SYSTEM_LOGICAL_PROCESSOR_INFORMATION_EX>(),
    80usize,
    concat!(
      "Size of: ",
      stringify!(_SYSTEM_LOGICAL_PROCESSOR_INFORMATION_EX)
    )
  );
  assert_eq!(
    ::std::mem::align_of::<_SYSTEM_LOGICAL_PROCESSOR_INFORMATION_EX>(),
    8usize,
    concat!(
      "Alignment of ",
      stringify!(_SYSTEM_LOGICAL_PROCESSOR_INFORMATION_EX)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_SYSTEM_LOGICAL_PROCESSOR_INFORMATION_EX>())).Relationship as *const _
        as usize
    },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_LOGICAL_PROCESSOR_INFORMATION_EX),
      "::",
      stringify!(Relationship)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_SYSTEM_LOGICAL_PROCESSOR_INFORMATION_EX>())).Size as *const _ as usize
    },
    4usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_LOGICAL_PROCESSOR_INFORMATION_EX),
      "::",
      stringify!(Size)
    )
  );
}
pub type SYSTEM_LOGICAL_PROCESSOR_INFORMATION_EX = _SYSTEM_LOGICAL_PROCESSOR_INFORMATION_EX;
pub const _CPU_SET_INFORMATION_TYPE_CpuSetInformation: _CPU_SET_INFORMATION_TYPE = 0;
pub type _CPU_SET_INFORMATION_TYPE = ::std::os::raw::c_int;
pub use self::_CPU_SET_INFORMATION_TYPE as CPU_SET_INFORMATION_TYPE;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _SYSTEM_CPU_SET_INFORMATION {
  pub Size: DWORD,
  pub Type: CPU_SET_INFORMATION_TYPE,
  pub __bindgen_anon_1: _SYSTEM_CPU_SET_INFORMATION__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _SYSTEM_CPU_SET_INFORMATION__bindgen_ty_1 {
  pub CpuSet: _SYSTEM_CPU_SET_INFORMATION__bindgen_ty_1__bindgen_ty_1,
  _bindgen_union_align: [u64; 3usize],
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _SYSTEM_CPU_SET_INFORMATION__bindgen_ty_1__bindgen_ty_1 {
  pub Id: DWORD,
  pub Group: WORD,
  pub LogicalProcessorIndex: BYTE,
  pub CoreIndex: BYTE,
  pub LastLevelCacheIndex: BYTE,
  pub NumaNodeIndex: BYTE,
  pub EfficiencyClass: BYTE,
  pub __bindgen_anon_1: _SYSTEM_CPU_SET_INFORMATION__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1,
  pub __bindgen_anon_2: _SYSTEM_CPU_SET_INFORMATION__bindgen_ty_1__bindgen_ty_1__bindgen_ty_2,
  pub AllocationTag: DWORD64,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _SYSTEM_CPU_SET_INFORMATION__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1 {
  pub AllFlags: BYTE,
  pub __bindgen_anon_1:
    _SYSTEM_CPU_SET_INFORMATION__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1,
  _bindgen_union_align: u8,
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct _SYSTEM_CPU_SET_INFORMATION__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1 {
  pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize], u8>,
}
#[test]
fn bindgen_test_layout__SYSTEM_CPU_SET_INFORMATION__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1(
) {
  assert_eq!(
    ::std::mem::size_of::<
      _SYSTEM_CPU_SET_INFORMATION__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1,
    >(),
    1usize,
    concat!(
      "Size of: ",
      stringify!(
        _SYSTEM_CPU_SET_INFORMATION__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1
      )
    )
  );
  assert_eq!(
    ::std::mem::align_of::<
      _SYSTEM_CPU_SET_INFORMATION__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1,
    >(),
    1usize,
    concat!(
      "Alignment of ",
      stringify!(
        _SYSTEM_CPU_SET_INFORMATION__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1
      )
    )
  );
}
impl _SYSTEM_CPU_SET_INFORMATION__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1 {
  #[inline]
  pub fn Parked(&self) -> BYTE {
    unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
  }
  #[inline]
  pub fn set_Parked(&mut self, val: BYTE) {
    unsafe {
      let val: u8 = ::std::mem::transmute(val);
      self._bitfield_1.set(0usize, 1u8, val as u64)
    }
  }
  #[inline]
  pub fn Allocated(&self) -> BYTE {
    unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
  }
  #[inline]
  pub fn set_Allocated(&mut self, val: BYTE) {
    unsafe {
      let val: u8 = ::std::mem::transmute(val);
      self._bitfield_1.set(1usize, 1u8, val as u64)
    }
  }
  #[inline]
  pub fn AllocatedToTargetProcess(&self) -> BYTE {
    unsafe { ::std::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u8) }
  }
  #[inline]
  pub fn set_AllocatedToTargetProcess(&mut self, val: BYTE) {
    unsafe {
      let val: u8 = ::std::mem::transmute(val);
      self._bitfield_1.set(2usize, 1u8, val as u64)
    }
  }
  #[inline]
  pub fn RealTime(&self) -> BYTE {
    unsafe { ::std::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u8) }
  }
  #[inline]
  pub fn set_RealTime(&mut self, val: BYTE) {
    unsafe {
      let val: u8 = ::std::mem::transmute(val);
      self._bitfield_1.set(3usize, 1u8, val as u64)
    }
  }
  #[inline]
  pub fn ReservedFlags(&self) -> BYTE {
    unsafe { ::std::mem::transmute(self._bitfield_1.get(4usize, 4u8) as u8) }
  }
  #[inline]
  pub fn set_ReservedFlags(&mut self, val: BYTE) {
    unsafe {
      let val: u8 = ::std::mem::transmute(val);
      self._bitfield_1.set(4usize, 4u8, val as u64)
    }
  }
  #[inline]
  pub fn new_bitfield_1(
    Parked: BYTE,
    Allocated: BYTE,
    AllocatedToTargetProcess: BYTE,
    RealTime: BYTE,
    ReservedFlags: BYTE,
  ) -> __BindgenBitfieldUnit<[u8; 1usize], u8> {
    let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize], u8> = Default::default();
    __bindgen_bitfield_unit.set(0usize, 1u8, {
      let Parked: u8 = unsafe { ::std::mem::transmute(Parked) };
      Parked as u64
    });
    __bindgen_bitfield_unit.set(1usize, 1u8, {
      let Allocated: u8 = unsafe { ::std::mem::transmute(Allocated) };
      Allocated as u64
    });
    __bindgen_bitfield_unit.set(2usize, 1u8, {
      let AllocatedToTargetProcess: u8 = unsafe { ::std::mem::transmute(AllocatedToTargetProcess) };
      AllocatedToTargetProcess as u64
    });
    __bindgen_bitfield_unit.set(3usize, 1u8, {
      let RealTime: u8 = unsafe { ::std::mem::transmute(RealTime) };
      RealTime as u64
    });
    __bindgen_bitfield_unit.set(4usize, 4u8, {
      let ReservedFlags: u8 = unsafe { ::std::mem::transmute(ReservedFlags) };
      ReservedFlags as u64
    });
    __bindgen_bitfield_unit
  }
}
#[test]
fn bindgen_test_layout__SYSTEM_CPU_SET_INFORMATION__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1() {
  assert_eq!(
    ::std::mem::size_of::<_SYSTEM_CPU_SET_INFORMATION__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1>(),
    1usize,
    concat!(
      "Size of: ",
      stringify!(_SYSTEM_CPU_SET_INFORMATION__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1)
    )
  );
  assert_eq!(
    ::std::mem::align_of::<_SYSTEM_CPU_SET_INFORMATION__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1>(),
    1usize,
    concat!(
      "Alignment of ",
      stringify!(_SYSTEM_CPU_SET_INFORMATION__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_SYSTEM_CPU_SET_INFORMATION__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1>(
      )))
      .AllFlags as *const _ as usize
    },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_CPU_SET_INFORMATION__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(AllFlags)
    )
  );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _SYSTEM_CPU_SET_INFORMATION__bindgen_ty_1__bindgen_ty_1__bindgen_ty_2 {
  pub Reserved: DWORD,
  pub SchedulingClass: BYTE,
  _bindgen_union_align: u32,
}
#[test]
fn bindgen_test_layout__SYSTEM_CPU_SET_INFORMATION__bindgen_ty_1__bindgen_ty_1__bindgen_ty_2() {
  assert_eq!(
    ::std::mem::size_of::<_SYSTEM_CPU_SET_INFORMATION__bindgen_ty_1__bindgen_ty_1__bindgen_ty_2>(),
    4usize,
    concat!(
      "Size of: ",
      stringify!(_SYSTEM_CPU_SET_INFORMATION__bindgen_ty_1__bindgen_ty_1__bindgen_ty_2)
    )
  );
  assert_eq!(
    ::std::mem::align_of::<_SYSTEM_CPU_SET_INFORMATION__bindgen_ty_1__bindgen_ty_1__bindgen_ty_2>(),
    4usize,
    concat!(
      "Alignment of ",
      stringify!(_SYSTEM_CPU_SET_INFORMATION__bindgen_ty_1__bindgen_ty_1__bindgen_ty_2)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_SYSTEM_CPU_SET_INFORMATION__bindgen_ty_1__bindgen_ty_1__bindgen_ty_2>(
      )))
      .Reserved as *const _ as usize
    },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_CPU_SET_INFORMATION__bindgen_ty_1__bindgen_ty_1__bindgen_ty_2),
      "::",
      stringify!(Reserved)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_SYSTEM_CPU_SET_INFORMATION__bindgen_ty_1__bindgen_ty_1__bindgen_ty_2>(
      )))
      .SchedulingClass as *const _ as usize
    },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_CPU_SET_INFORMATION__bindgen_ty_1__bindgen_ty_1__bindgen_ty_2),
      "::",
      stringify!(SchedulingClass)
    )
  );
}
#[test]
fn bindgen_test_layout__SYSTEM_CPU_SET_INFORMATION__bindgen_ty_1__bindgen_ty_1() {
  assert_eq!(
    ::std::mem::size_of::<_SYSTEM_CPU_SET_INFORMATION__bindgen_ty_1__bindgen_ty_1>(),
    24usize,
    concat!(
      "Size of: ",
      stringify!(_SYSTEM_CPU_SET_INFORMATION__bindgen_ty_1__bindgen_ty_1)
    )
  );
  assert_eq!(
    ::std::mem::align_of::<_SYSTEM_CPU_SET_INFORMATION__bindgen_ty_1__bindgen_ty_1>(),
    8usize,
    concat!(
      "Alignment of ",
      stringify!(_SYSTEM_CPU_SET_INFORMATION__bindgen_ty_1__bindgen_ty_1)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_SYSTEM_CPU_SET_INFORMATION__bindgen_ty_1__bindgen_ty_1>())).Id
        as *const _ as usize
    },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_CPU_SET_INFORMATION__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(Id)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_SYSTEM_CPU_SET_INFORMATION__bindgen_ty_1__bindgen_ty_1>())).Group
        as *const _ as usize
    },
    4usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_CPU_SET_INFORMATION__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(Group)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_SYSTEM_CPU_SET_INFORMATION__bindgen_ty_1__bindgen_ty_1>()))
        .LogicalProcessorIndex as *const _ as usize
    },
    6usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_CPU_SET_INFORMATION__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(LogicalProcessorIndex)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_SYSTEM_CPU_SET_INFORMATION__bindgen_ty_1__bindgen_ty_1>())).CoreIndex
        as *const _ as usize
    },
    7usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_CPU_SET_INFORMATION__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(CoreIndex)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_SYSTEM_CPU_SET_INFORMATION__bindgen_ty_1__bindgen_ty_1>()))
        .LastLevelCacheIndex as *const _ as usize
    },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_CPU_SET_INFORMATION__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(LastLevelCacheIndex)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_SYSTEM_CPU_SET_INFORMATION__bindgen_ty_1__bindgen_ty_1>()))
        .NumaNodeIndex as *const _ as usize
    },
    9usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_CPU_SET_INFORMATION__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(NumaNodeIndex)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_SYSTEM_CPU_SET_INFORMATION__bindgen_ty_1__bindgen_ty_1>()))
        .EfficiencyClass as *const _ as usize
    },
    10usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_CPU_SET_INFORMATION__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(EfficiencyClass)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_SYSTEM_CPU_SET_INFORMATION__bindgen_ty_1__bindgen_ty_1>()))
        .AllocationTag as *const _ as usize
    },
    16usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_CPU_SET_INFORMATION__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(AllocationTag)
    )
  );
}
#[test]
fn bindgen_test_layout__SYSTEM_CPU_SET_INFORMATION__bindgen_ty_1() {
  assert_eq!(
    ::std::mem::size_of::<_SYSTEM_CPU_SET_INFORMATION__bindgen_ty_1>(),
    24usize,
    concat!(
      "Size of: ",
      stringify!(_SYSTEM_CPU_SET_INFORMATION__bindgen_ty_1)
    )
  );
  assert_eq!(
    ::std::mem::align_of::<_SYSTEM_CPU_SET_INFORMATION__bindgen_ty_1>(),
    8usize,
    concat!(
      "Alignment of ",
      stringify!(_SYSTEM_CPU_SET_INFORMATION__bindgen_ty_1)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_SYSTEM_CPU_SET_INFORMATION__bindgen_ty_1>())).CpuSet as *const _
        as usize
    },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_CPU_SET_INFORMATION__bindgen_ty_1),
      "::",
      stringify!(CpuSet)
    )
  );
}
#[test]
fn bindgen_test_layout__SYSTEM_CPU_SET_INFORMATION() {
  assert_eq!(
    ::std::mem::size_of::<_SYSTEM_CPU_SET_INFORMATION>(),
    32usize,
    concat!("Size of: ", stringify!(_SYSTEM_CPU_SET_INFORMATION))
  );
  assert_eq!(
    ::std::mem::align_of::<_SYSTEM_CPU_SET_INFORMATION>(),
    8usize,
    concat!("Alignment of ", stringify!(_SYSTEM_CPU_SET_INFORMATION))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SYSTEM_CPU_SET_INFORMATION>())).Size as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_CPU_SET_INFORMATION),
      "::",
      stringify!(Size)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SYSTEM_CPU_SET_INFORMATION>())).Type as *const _ as usize },
    4usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_CPU_SET_INFORMATION),
      "::",
      stringify!(Type)
    )
  );
}
pub type SYSTEM_CPU_SET_INFORMATION = _SYSTEM_CPU_SET_INFORMATION;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SYSTEM_PROCESSOR_CYCLE_TIME_INFORMATION {
  pub CycleTime: DWORD64,
}
#[test]
fn bindgen_test_layout__SYSTEM_PROCESSOR_CYCLE_TIME_INFORMATION() {
  assert_eq!(
    ::std::mem::size_of::<_SYSTEM_PROCESSOR_CYCLE_TIME_INFORMATION>(),
    8usize,
    concat!(
      "Size of: ",
      stringify!(_SYSTEM_PROCESSOR_CYCLE_TIME_INFORMATION)
    )
  );
  assert_eq!(
    ::std::mem::align_of::<_SYSTEM_PROCESSOR_CYCLE_TIME_INFORMATION>(),
    8usize,
    concat!(
      "Alignment of ",
      stringify!(_SYSTEM_PROCESSOR_CYCLE_TIME_INFORMATION)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_SYSTEM_PROCESSOR_CYCLE_TIME_INFORMATION>())).CycleTime as *const _
        as usize
    },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_PROCESSOR_CYCLE_TIME_INFORMATION),
      "::",
      stringify!(CycleTime)
    )
  );
}
pub type SYSTEM_PROCESSOR_CYCLE_TIME_INFORMATION = _SYSTEM_PROCESSOR_CYCLE_TIME_INFORMATION;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _SCRUB_DATA_INPUT {
  pub Size: DWORD,
  pub Flags: DWORD,
  pub MaximumIos: DWORD,
  pub ObjectId: [DWORD; 4usize],
  pub Reserved: [DWORD; 25usize],
  pub ResumeContext: [BYTE; 816usize],
}
#[test]
fn bindgen_test_layout__SCRUB_DATA_INPUT() {
  assert_eq!(
    ::std::mem::size_of::<_SCRUB_DATA_INPUT>(),
    944usize,
    concat!("Size of: ", stringify!(_SCRUB_DATA_INPUT))
  );
  assert_eq!(
    ::std::mem::align_of::<_SCRUB_DATA_INPUT>(),
    4usize,
    concat!("Alignment of ", stringify!(_SCRUB_DATA_INPUT))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SCRUB_DATA_INPUT>())).Size as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_SCRUB_DATA_INPUT),
      "::",
      stringify!(Size)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SCRUB_DATA_INPUT>())).Flags as *const _ as usize },
    4usize,
    concat!(
      "Offset of field: ",
      stringify!(_SCRUB_DATA_INPUT),
      "::",
      stringify!(Flags)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SCRUB_DATA_INPUT>())).MaximumIos as *const _ as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_SCRUB_DATA_INPUT),
      "::",
      stringify!(MaximumIos)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SCRUB_DATA_INPUT>())).ObjectId as *const _ as usize },
    12usize,
    concat!(
      "Offset of field: ",
      stringify!(_SCRUB_DATA_INPUT),
      "::",
      stringify!(ObjectId)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SCRUB_DATA_INPUT>())).Reserved as *const _ as usize },
    28usize,
    concat!(
      "Offset of field: ",
      stringify!(_SCRUB_DATA_INPUT),
      "::",
      stringify!(Reserved)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SCRUB_DATA_INPUT>())).ResumeContext as *const _ as usize },
    128usize,
    concat!(
      "Offset of field: ",
      stringify!(_SCRUB_DATA_INPUT),
      "::",
      stringify!(ResumeContext)
    )
  );
}
pub type SCRUB_DATA_INPUT = _SCRUB_DATA_INPUT;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SCRUB_PARITY_EXTENT {
  pub Offset: LONGLONG,
  pub Length: ULONGLONG,
}
#[test]
fn bindgen_test_layout__SCRUB_PARITY_EXTENT() {
  assert_eq!(
    ::std::mem::size_of::<_SCRUB_PARITY_EXTENT>(),
    16usize,
    concat!("Size of: ", stringify!(_SCRUB_PARITY_EXTENT))
  );
  assert_eq!(
    ::std::mem::align_of::<_SCRUB_PARITY_EXTENT>(),
    8usize,
    concat!("Alignment of ", stringify!(_SCRUB_PARITY_EXTENT))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SCRUB_PARITY_EXTENT>())).Offset as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_SCRUB_PARITY_EXTENT),
      "::",
      stringify!(Offset)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SCRUB_PARITY_EXTENT>())).Length as *const _ as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_SCRUB_PARITY_EXTENT),
      "::",
      stringify!(Length)
    )
  );
}
pub type SCRUB_PARITY_EXTENT = _SCRUB_PARITY_EXTENT;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SCRUB_PARITY_EXTENT_DATA {
  pub Size: WORD,
  pub Flags: WORD,
  pub NumberOfParityExtents: WORD,
  pub MaximumNumberOfParityExtents: WORD,
  pub ParityExtents: [SCRUB_PARITY_EXTENT; 1usize],
}
#[test]
fn bindgen_test_layout__SCRUB_PARITY_EXTENT_DATA() {
  assert_eq!(
    ::std::mem::size_of::<_SCRUB_PARITY_EXTENT_DATA>(),
    24usize,
    concat!("Size of: ", stringify!(_SCRUB_PARITY_EXTENT_DATA))
  );
  assert_eq!(
    ::std::mem::align_of::<_SCRUB_PARITY_EXTENT_DATA>(),
    8usize,
    concat!("Alignment of ", stringify!(_SCRUB_PARITY_EXTENT_DATA))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SCRUB_PARITY_EXTENT_DATA>())).Size as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_SCRUB_PARITY_EXTENT_DATA),
      "::",
      stringify!(Size)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SCRUB_PARITY_EXTENT_DATA>())).Flags as *const _ as usize },
    2usize,
    concat!(
      "Offset of field: ",
      stringify!(_SCRUB_PARITY_EXTENT_DATA),
      "::",
      stringify!(Flags)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_SCRUB_PARITY_EXTENT_DATA>())).NumberOfParityExtents as *const _
        as usize
    },
    4usize,
    concat!(
      "Offset of field: ",
      stringify!(_SCRUB_PARITY_EXTENT_DATA),
      "::",
      stringify!(NumberOfParityExtents)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_SCRUB_PARITY_EXTENT_DATA>())).MaximumNumberOfParityExtents as *const _
        as usize
    },
    6usize,
    concat!(
      "Offset of field: ",
      stringify!(_SCRUB_PARITY_EXTENT_DATA),
      "::",
      stringify!(MaximumNumberOfParityExtents)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_SCRUB_PARITY_EXTENT_DATA>())).ParityExtents as *const _ as usize
    },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_SCRUB_PARITY_EXTENT_DATA),
      "::",
      stringify!(ParityExtents)
    )
  );
}
pub type SCRUB_PARITY_EXTENT_DATA = _SCRUB_PARITY_EXTENT_DATA;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _SCRUB_DATA_OUTPUT {
  pub Size: DWORD,
  pub Flags: DWORD,
  pub Status: DWORD,
  pub ErrorFileOffset: ULONGLONG,
  pub ErrorLength: ULONGLONG,
  pub NumberOfBytesRepaired: ULONGLONG,
  pub NumberOfBytesFailed: ULONGLONG,
  pub InternalFileReference: ULONGLONG,
  pub ResumeContextLength: WORD,
  pub ParityExtentDataOffset: WORD,
  pub Reserved: [DWORD; 9usize],
  pub NumberOfMetadataBytesProcessed: ULONGLONG,
  pub NumberOfDataBytesProcessed: ULONGLONG,
  pub TotalNumberOfMetadataBytesInUse: ULONGLONG,
  pub TotalNumberOfDataBytesInUse: ULONGLONG,
  pub ResumeContext: [BYTE; 816usize],
}
#[test]
fn bindgen_test_layout__SCRUB_DATA_OUTPUT() {
  assert_eq!(
    ::std::mem::size_of::<_SCRUB_DATA_OUTPUT>(),
    944usize,
    concat!("Size of: ", stringify!(_SCRUB_DATA_OUTPUT))
  );
  assert_eq!(
    ::std::mem::align_of::<_SCRUB_DATA_OUTPUT>(),
    8usize,
    concat!("Alignment of ", stringify!(_SCRUB_DATA_OUTPUT))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SCRUB_DATA_OUTPUT>())).Size as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_SCRUB_DATA_OUTPUT),
      "::",
      stringify!(Size)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SCRUB_DATA_OUTPUT>())).Flags as *const _ as usize },
    4usize,
    concat!(
      "Offset of field: ",
      stringify!(_SCRUB_DATA_OUTPUT),
      "::",
      stringify!(Flags)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SCRUB_DATA_OUTPUT>())).Status as *const _ as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_SCRUB_DATA_OUTPUT),
      "::",
      stringify!(Status)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SCRUB_DATA_OUTPUT>())).ErrorFileOffset as *const _ as usize },
    16usize,
    concat!(
      "Offset of field: ",
      stringify!(_SCRUB_DATA_OUTPUT),
      "::",
      stringify!(ErrorFileOffset)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SCRUB_DATA_OUTPUT>())).ErrorLength as *const _ as usize },
    24usize,
    concat!(
      "Offset of field: ",
      stringify!(_SCRUB_DATA_OUTPUT),
      "::",
      stringify!(ErrorLength)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_SCRUB_DATA_OUTPUT>())).NumberOfBytesRepaired as *const _ as usize
    },
    32usize,
    concat!(
      "Offset of field: ",
      stringify!(_SCRUB_DATA_OUTPUT),
      "::",
      stringify!(NumberOfBytesRepaired)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_SCRUB_DATA_OUTPUT>())).NumberOfBytesFailed as *const _ as usize
    },
    40usize,
    concat!(
      "Offset of field: ",
      stringify!(_SCRUB_DATA_OUTPUT),
      "::",
      stringify!(NumberOfBytesFailed)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_SCRUB_DATA_OUTPUT>())).InternalFileReference as *const _ as usize
    },
    48usize,
    concat!(
      "Offset of field: ",
      stringify!(_SCRUB_DATA_OUTPUT),
      "::",
      stringify!(InternalFileReference)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_SCRUB_DATA_OUTPUT>())).ResumeContextLength as *const _ as usize
    },
    56usize,
    concat!(
      "Offset of field: ",
      stringify!(_SCRUB_DATA_OUTPUT),
      "::",
      stringify!(ResumeContextLength)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_SCRUB_DATA_OUTPUT>())).ParityExtentDataOffset as *const _ as usize
    },
    58usize,
    concat!(
      "Offset of field: ",
      stringify!(_SCRUB_DATA_OUTPUT),
      "::",
      stringify!(ParityExtentDataOffset)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SCRUB_DATA_OUTPUT>())).Reserved as *const _ as usize },
    60usize,
    concat!(
      "Offset of field: ",
      stringify!(_SCRUB_DATA_OUTPUT),
      "::",
      stringify!(Reserved)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_SCRUB_DATA_OUTPUT>())).NumberOfMetadataBytesProcessed as *const _
        as usize
    },
    96usize,
    concat!(
      "Offset of field: ",
      stringify!(_SCRUB_DATA_OUTPUT),
      "::",
      stringify!(NumberOfMetadataBytesProcessed)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_SCRUB_DATA_OUTPUT>())).NumberOfDataBytesProcessed as *const _ as usize
    },
    104usize,
    concat!(
      "Offset of field: ",
      stringify!(_SCRUB_DATA_OUTPUT),
      "::",
      stringify!(NumberOfDataBytesProcessed)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_SCRUB_DATA_OUTPUT>())).TotalNumberOfMetadataBytesInUse as *const _
        as usize
    },
    112usize,
    concat!(
      "Offset of field: ",
      stringify!(_SCRUB_DATA_OUTPUT),
      "::",
      stringify!(TotalNumberOfMetadataBytesInUse)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_SCRUB_DATA_OUTPUT>())).TotalNumberOfDataBytesInUse as *const _
        as usize
    },
    120usize,
    concat!(
      "Offset of field: ",
      stringify!(_SCRUB_DATA_OUTPUT),
      "::",
      stringify!(TotalNumberOfDataBytesInUse)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SCRUB_DATA_OUTPUT>())).ResumeContext as *const _ as usize },
    128usize,
    concat!(
      "Offset of field: ",
      stringify!(_SCRUB_DATA_OUTPUT),
      "::",
      stringify!(ResumeContext)
    )
  );
}
pub type SCRUB_DATA_OUTPUT = _SCRUB_DATA_OUTPUT;
pub const _SharedVirtualDiskSupportType_SharedVirtualDisksUnsupported:
  _SharedVirtualDiskSupportType = 0;
pub const _SharedVirtualDiskSupportType_SharedVirtualDisksSupported: _SharedVirtualDiskSupportType =
  1;
pub const _SharedVirtualDiskSupportType_SharedVirtualDiskSnapshotsSupported:
  _SharedVirtualDiskSupportType = 3;
pub const _SharedVirtualDiskSupportType_SharedVirtualDiskCDPSnapshotsSupported:
  _SharedVirtualDiskSupportType = 7;
pub type _SharedVirtualDiskSupportType = ::std::os::raw::c_int;
pub use self::_SharedVirtualDiskSupportType as SharedVirtualDiskSupportType;
pub const _SharedVirtualDiskHandleState_SharedVirtualDiskHandleStateNone:
  _SharedVirtualDiskHandleState = 0;
pub const _SharedVirtualDiskHandleState_SharedVirtualDiskHandleStateFileShared:
  _SharedVirtualDiskHandleState = 1;
pub const _SharedVirtualDiskHandleState_SharedVirtualDiskHandleStateHandleShared:
  _SharedVirtualDiskHandleState = 3;
pub type _SharedVirtualDiskHandleState = ::std::os::raw::c_int;
pub use self::_SharedVirtualDiskHandleState as SharedVirtualDiskHandleState;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SHARED_VIRTUAL_DISK_SUPPORT {
  pub SharedVirtualDiskSupport: SharedVirtualDiskSupportType,
  pub HandleState: SharedVirtualDiskHandleState,
}
#[test]
fn bindgen_test_layout__SHARED_VIRTUAL_DISK_SUPPORT() {
  assert_eq!(
    ::std::mem::size_of::<_SHARED_VIRTUAL_DISK_SUPPORT>(),
    8usize,
    concat!("Size of: ", stringify!(_SHARED_VIRTUAL_DISK_SUPPORT))
  );
  assert_eq!(
    ::std::mem::align_of::<_SHARED_VIRTUAL_DISK_SUPPORT>(),
    4usize,
    concat!("Alignment of ", stringify!(_SHARED_VIRTUAL_DISK_SUPPORT))
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_SHARED_VIRTUAL_DISK_SUPPORT>())).SharedVirtualDiskSupport as *const _
        as usize
    },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_SHARED_VIRTUAL_DISK_SUPPORT),
      "::",
      stringify!(SharedVirtualDiskSupport)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_SHARED_VIRTUAL_DISK_SUPPORT>())).HandleState as *const _ as usize
    },
    4usize,
    concat!(
      "Offset of field: ",
      stringify!(_SHARED_VIRTUAL_DISK_SUPPORT),
      "::",
      stringify!(HandleState)
    )
  );
}
pub type SHARED_VIRTUAL_DISK_SUPPORT = _SHARED_VIRTUAL_DISK_SUPPORT;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SHUFFLE_FILE_DATA {
  pub StartingOffset: LONGLONG,
  pub Length: LONGLONG,
  pub Flags: DWORD,
}
#[test]
fn bindgen_test_layout__SHUFFLE_FILE_DATA() {
  assert_eq!(
    ::std::mem::size_of::<_SHUFFLE_FILE_DATA>(),
    24usize,
    concat!("Size of: ", stringify!(_SHUFFLE_FILE_DATA))
  );
  assert_eq!(
    ::std::mem::align_of::<_SHUFFLE_FILE_DATA>(),
    8usize,
    concat!("Alignment of ", stringify!(_SHUFFLE_FILE_DATA))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SHUFFLE_FILE_DATA>())).StartingOffset as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_SHUFFLE_FILE_DATA),
      "::",
      stringify!(StartingOffset)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SHUFFLE_FILE_DATA>())).Length as *const _ as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_SHUFFLE_FILE_DATA),
      "::",
      stringify!(Length)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SHUFFLE_FILE_DATA>())).Flags as *const _ as usize },
    16usize,
    concat!(
      "Offset of field: ",
      stringify!(_SHUFFLE_FILE_DATA),
      "::",
      stringify!(Flags)
    )
  );
}
pub type SHUFFLE_FILE_DATA = _SHUFFLE_FILE_DATA;
pub const _SYSTEM_POWER_STATE_PowerSystemUnspecified: _SYSTEM_POWER_STATE = 0;
pub const _SYSTEM_POWER_STATE_PowerSystemWorking: _SYSTEM_POWER_STATE = 1;
pub const _SYSTEM_POWER_STATE_PowerSystemSleeping1: _SYSTEM_POWER_STATE = 2;
pub const _SYSTEM_POWER_STATE_PowerSystemSleeping2: _SYSTEM_POWER_STATE = 3;
pub const _SYSTEM_POWER_STATE_PowerSystemSleeping3: _SYSTEM_POWER_STATE = 4;
pub const _SYSTEM_POWER_STATE_PowerSystemHibernate: _SYSTEM_POWER_STATE = 5;
pub const _SYSTEM_POWER_STATE_PowerSystemShutdown: _SYSTEM_POWER_STATE = 6;
pub const _SYSTEM_POWER_STATE_PowerSystemMaximum: _SYSTEM_POWER_STATE = 7;
pub type _SYSTEM_POWER_STATE = ::std::os::raw::c_int;
pub use self::_SYSTEM_POWER_STATE as SYSTEM_POWER_STATE;
pub const POWER_ACTION_PowerActionNone: POWER_ACTION = 0;
pub const POWER_ACTION_PowerActionReserved: POWER_ACTION = 1;
pub const POWER_ACTION_PowerActionSleep: POWER_ACTION = 2;
pub const POWER_ACTION_PowerActionHibernate: POWER_ACTION = 3;
pub const POWER_ACTION_PowerActionShutdown: POWER_ACTION = 4;
pub const POWER_ACTION_PowerActionShutdownReset: POWER_ACTION = 5;
pub const POWER_ACTION_PowerActionShutdownOff: POWER_ACTION = 6;
pub const POWER_ACTION_PowerActionWarmEject: POWER_ACTION = 7;
pub const POWER_ACTION_PowerActionDisplayOff: POWER_ACTION = 8;
pub type POWER_ACTION = ::std::os::raw::c_int;
pub const SYSTEM_POWER_CONDITION_PoAc: SYSTEM_POWER_CONDITION = 0;
pub const SYSTEM_POWER_CONDITION_PoDc: SYSTEM_POWER_CONDITION = 1;
pub const SYSTEM_POWER_CONDITION_PoHot: SYSTEM_POWER_CONDITION = 2;
pub const SYSTEM_POWER_CONDITION_PoConditionMaximum: SYSTEM_POWER_CONDITION = 3;
pub type SYSTEM_POWER_CONDITION = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SET_POWER_SETTING_VALUE {
  pub Version: DWORD,
  pub Guid: GUID,
  pub PowerCondition: SYSTEM_POWER_CONDITION,
  pub DataLength: DWORD,
  pub Data: [BYTE; 1usize],
}
#[test]
fn bindgen_test_layout_SET_POWER_SETTING_VALUE() {
  assert_eq!(
    ::std::mem::size_of::<SET_POWER_SETTING_VALUE>(),
    32usize,
    concat!("Size of: ", stringify!(SET_POWER_SETTING_VALUE))
  );
  assert_eq!(
    ::std::mem::align_of::<SET_POWER_SETTING_VALUE>(),
    4usize,
    concat!("Alignment of ", stringify!(SET_POWER_SETTING_VALUE))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<SET_POWER_SETTING_VALUE>())).Version as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(SET_POWER_SETTING_VALUE),
      "::",
      stringify!(Version)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<SET_POWER_SETTING_VALUE>())).Guid as *const _ as usize },
    4usize,
    concat!(
      "Offset of field: ",
      stringify!(SET_POWER_SETTING_VALUE),
      "::",
      stringify!(Guid)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<SET_POWER_SETTING_VALUE>())).PowerCondition as *const _ as usize
    },
    20usize,
    concat!(
      "Offset of field: ",
      stringify!(SET_POWER_SETTING_VALUE),
      "::",
      stringify!(PowerCondition)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<SET_POWER_SETTING_VALUE>())).DataLength as *const _ as usize },
    24usize,
    concat!(
      "Offset of field: ",
      stringify!(SET_POWER_SETTING_VALUE),
      "::",
      stringify!(DataLength)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<SET_POWER_SETTING_VALUE>())).Data as *const _ as usize },
    28usize,
    concat!(
      "Offset of field: ",
      stringify!(SET_POWER_SETTING_VALUE),
      "::",
      stringify!(Data)
    )
  );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BATTERY_REPORTING_SCALE {
  pub Granularity: DWORD,
  pub Capacity: DWORD,
}
#[test]
fn bindgen_test_layout_BATTERY_REPORTING_SCALE() {
  assert_eq!(
    ::std::mem::size_of::<BATTERY_REPORTING_SCALE>(),
    8usize,
    concat!("Size of: ", stringify!(BATTERY_REPORTING_SCALE))
  );
  assert_eq!(
    ::std::mem::align_of::<BATTERY_REPORTING_SCALE>(),
    4usize,
    concat!("Alignment of ", stringify!(BATTERY_REPORTING_SCALE))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<BATTERY_REPORTING_SCALE>())).Granularity as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(BATTERY_REPORTING_SCALE),
      "::",
      stringify!(Granularity)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<BATTERY_REPORTING_SCALE>())).Capacity as *const _ as usize },
    4usize,
    concat!(
      "Offset of field: ",
      stringify!(BATTERY_REPORTING_SCALE),
      "::",
      stringify!(Capacity)
    )
  );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct POWER_ACTION_POLICY {
  pub Action: POWER_ACTION,
  pub Flags: DWORD,
  pub EventCode: DWORD,
}
#[test]
fn bindgen_test_layout_POWER_ACTION_POLICY() {
  assert_eq!(
    ::std::mem::size_of::<POWER_ACTION_POLICY>(),
    12usize,
    concat!("Size of: ", stringify!(POWER_ACTION_POLICY))
  );
  assert_eq!(
    ::std::mem::align_of::<POWER_ACTION_POLICY>(),
    4usize,
    concat!("Alignment of ", stringify!(POWER_ACTION_POLICY))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<POWER_ACTION_POLICY>())).Action as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(POWER_ACTION_POLICY),
      "::",
      stringify!(Action)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<POWER_ACTION_POLICY>())).Flags as *const _ as usize },
    4usize,
    concat!(
      "Offset of field: ",
      stringify!(POWER_ACTION_POLICY),
      "::",
      stringify!(Flags)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<POWER_ACTION_POLICY>())).EventCode as *const _ as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(POWER_ACTION_POLICY),
      "::",
      stringify!(EventCode)
    )
  );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SYSTEM_POWER_LEVEL {
  pub Enable: BOOLEAN,
  pub Spare: [BYTE; 3usize],
  pub BatteryLevel: DWORD,
  pub PowerPolicy: POWER_ACTION_POLICY,
  pub MinSystemState: SYSTEM_POWER_STATE,
}
#[test]
fn bindgen_test_layout_SYSTEM_POWER_LEVEL() {
  assert_eq!(
    ::std::mem::size_of::<SYSTEM_POWER_LEVEL>(),
    24usize,
    concat!("Size of: ", stringify!(SYSTEM_POWER_LEVEL))
  );
  assert_eq!(
    ::std::mem::align_of::<SYSTEM_POWER_LEVEL>(),
    4usize,
    concat!("Alignment of ", stringify!(SYSTEM_POWER_LEVEL))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<SYSTEM_POWER_LEVEL>())).Enable as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(SYSTEM_POWER_LEVEL),
      "::",
      stringify!(Enable)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<SYSTEM_POWER_LEVEL>())).Spare as *const _ as usize },
    1usize,
    concat!(
      "Offset of field: ",
      stringify!(SYSTEM_POWER_LEVEL),
      "::",
      stringify!(Spare)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<SYSTEM_POWER_LEVEL>())).BatteryLevel as *const _ as usize },
    4usize,
    concat!(
      "Offset of field: ",
      stringify!(SYSTEM_POWER_LEVEL),
      "::",
      stringify!(BatteryLevel)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<SYSTEM_POWER_LEVEL>())).PowerPolicy as *const _ as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(SYSTEM_POWER_LEVEL),
      "::",
      stringify!(PowerPolicy)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<SYSTEM_POWER_LEVEL>())).MinSystemState as *const _ as usize },
    20usize,
    concat!(
      "Offset of field: ",
      stringify!(SYSTEM_POWER_LEVEL),
      "::",
      stringify!(MinSystemState)
    )
  );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SYSTEM_POWER_POLICY {
  pub Revision: DWORD,
  pub PowerButton: POWER_ACTION_POLICY,
  pub SleepButton: POWER_ACTION_POLICY,
  pub LidClose: POWER_ACTION_POLICY,
  pub LidOpenWake: SYSTEM_POWER_STATE,
  pub Reserved: DWORD,
  pub Idle: POWER_ACTION_POLICY,
  pub IdleTimeout: DWORD,
  pub IdleSensitivity: BYTE,
  pub DynamicThrottle: BYTE,
  pub Spare2: [BYTE; 2usize],
  pub MinSleep: SYSTEM_POWER_STATE,
  pub MaxSleep: SYSTEM_POWER_STATE,
  pub ReducedLatencySleep: SYSTEM_POWER_STATE,
  pub WinLogonFlags: DWORD,
  pub Spare3: DWORD,
  pub DozeS4Timeout: DWORD,
  pub BroadcastCapacityResolution: DWORD,
  pub DischargePolicy: [SYSTEM_POWER_LEVEL; 4usize],
  pub VideoTimeout: DWORD,
  pub VideoDimDisplay: BOOLEAN,
  pub VideoReserved: [DWORD; 3usize],
  pub SpindownTimeout: DWORD,
  pub OptimizeForPower: BOOLEAN,
  pub FanThrottleTolerance: BYTE,
  pub ForcedThrottle: BYTE,
  pub MinThrottle: BYTE,
  pub OverThrottled: POWER_ACTION_POLICY,
}
#[test]
fn bindgen_test_layout__SYSTEM_POWER_POLICY() {
  assert_eq!(
    ::std::mem::size_of::<_SYSTEM_POWER_POLICY>(),
    232usize,
    concat!("Size of: ", stringify!(_SYSTEM_POWER_POLICY))
  );
  assert_eq!(
    ::std::mem::align_of::<_SYSTEM_POWER_POLICY>(),
    4usize,
    concat!("Alignment of ", stringify!(_SYSTEM_POWER_POLICY))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SYSTEM_POWER_POLICY>())).Revision as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_POWER_POLICY),
      "::",
      stringify!(Revision)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SYSTEM_POWER_POLICY>())).PowerButton as *const _ as usize },
    4usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_POWER_POLICY),
      "::",
      stringify!(PowerButton)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SYSTEM_POWER_POLICY>())).SleepButton as *const _ as usize },
    16usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_POWER_POLICY),
      "::",
      stringify!(SleepButton)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SYSTEM_POWER_POLICY>())).LidClose as *const _ as usize },
    28usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_POWER_POLICY),
      "::",
      stringify!(LidClose)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SYSTEM_POWER_POLICY>())).LidOpenWake as *const _ as usize },
    40usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_POWER_POLICY),
      "::",
      stringify!(LidOpenWake)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SYSTEM_POWER_POLICY>())).Reserved as *const _ as usize },
    44usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_POWER_POLICY),
      "::",
      stringify!(Reserved)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SYSTEM_POWER_POLICY>())).Idle as *const _ as usize },
    48usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_POWER_POLICY),
      "::",
      stringify!(Idle)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SYSTEM_POWER_POLICY>())).IdleTimeout as *const _ as usize },
    60usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_POWER_POLICY),
      "::",
      stringify!(IdleTimeout)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_SYSTEM_POWER_POLICY>())).IdleSensitivity as *const _ as usize
    },
    64usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_POWER_POLICY),
      "::",
      stringify!(IdleSensitivity)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_SYSTEM_POWER_POLICY>())).DynamicThrottle as *const _ as usize
    },
    65usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_POWER_POLICY),
      "::",
      stringify!(DynamicThrottle)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SYSTEM_POWER_POLICY>())).Spare2 as *const _ as usize },
    66usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_POWER_POLICY),
      "::",
      stringify!(Spare2)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SYSTEM_POWER_POLICY>())).MinSleep as *const _ as usize },
    68usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_POWER_POLICY),
      "::",
      stringify!(MinSleep)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SYSTEM_POWER_POLICY>())).MaxSleep as *const _ as usize },
    72usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_POWER_POLICY),
      "::",
      stringify!(MaxSleep)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_SYSTEM_POWER_POLICY>())).ReducedLatencySleep as *const _ as usize
    },
    76usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_POWER_POLICY),
      "::",
      stringify!(ReducedLatencySleep)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SYSTEM_POWER_POLICY>())).WinLogonFlags as *const _ as usize },
    80usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_POWER_POLICY),
      "::",
      stringify!(WinLogonFlags)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SYSTEM_POWER_POLICY>())).Spare3 as *const _ as usize },
    84usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_POWER_POLICY),
      "::",
      stringify!(Spare3)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SYSTEM_POWER_POLICY>())).DozeS4Timeout as *const _ as usize },
    88usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_POWER_POLICY),
      "::",
      stringify!(DozeS4Timeout)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_SYSTEM_POWER_POLICY>())).BroadcastCapacityResolution as *const _
        as usize
    },
    92usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_POWER_POLICY),
      "::",
      stringify!(BroadcastCapacityResolution)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_SYSTEM_POWER_POLICY>())).DischargePolicy as *const _ as usize
    },
    96usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_POWER_POLICY),
      "::",
      stringify!(DischargePolicy)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SYSTEM_POWER_POLICY>())).VideoTimeout as *const _ as usize },
    192usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_POWER_POLICY),
      "::",
      stringify!(VideoTimeout)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_SYSTEM_POWER_POLICY>())).VideoDimDisplay as *const _ as usize
    },
    196usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_POWER_POLICY),
      "::",
      stringify!(VideoDimDisplay)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SYSTEM_POWER_POLICY>())).VideoReserved as *const _ as usize },
    200usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_POWER_POLICY),
      "::",
      stringify!(VideoReserved)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_SYSTEM_POWER_POLICY>())).SpindownTimeout as *const _ as usize
    },
    212usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_POWER_POLICY),
      "::",
      stringify!(SpindownTimeout)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_SYSTEM_POWER_POLICY>())).OptimizeForPower as *const _ as usize
    },
    216usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_POWER_POLICY),
      "::",
      stringify!(OptimizeForPower)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_SYSTEM_POWER_POLICY>())).FanThrottleTolerance as *const _ as usize
    },
    217usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_POWER_POLICY),
      "::",
      stringify!(FanThrottleTolerance)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SYSTEM_POWER_POLICY>())).ForcedThrottle as *const _ as usize },
    218usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_POWER_POLICY),
      "::",
      stringify!(ForcedThrottle)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SYSTEM_POWER_POLICY>())).MinThrottle as *const _ as usize },
    219usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_POWER_POLICY),
      "::",
      stringify!(MinThrottle)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SYSTEM_POWER_POLICY>())).OverThrottled as *const _ as usize },
    220usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_POWER_POLICY),
      "::",
      stringify!(OverThrottled)
    )
  );
}
pub type SYSTEM_POWER_POLICY = _SYSTEM_POWER_POLICY;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SYSTEM_POWER_CAPABILITIES {
  pub PowerButtonPresent: BOOLEAN,
  pub SleepButtonPresent: BOOLEAN,
  pub LidPresent: BOOLEAN,
  pub SystemS1: BOOLEAN,
  pub SystemS2: BOOLEAN,
  pub SystemS3: BOOLEAN,
  pub SystemS4: BOOLEAN,
  pub SystemS5: BOOLEAN,
  pub HiberFilePresent: BOOLEAN,
  pub FullWake: BOOLEAN,
  pub VideoDimPresent: BOOLEAN,
  pub ApmPresent: BOOLEAN,
  pub UpsPresent: BOOLEAN,
  pub ThermalControl: BOOLEAN,
  pub ProcessorThrottle: BOOLEAN,
  pub ProcessorMinThrottle: BYTE,
  pub ProcessorMaxThrottle: BYTE,
  pub FastSystemS4: BOOLEAN,
  pub Hiberboot: BOOLEAN,
  pub WakeAlarmPresent: BOOLEAN,
  pub AoAc: BOOLEAN,
  pub DiskSpinDown: BOOLEAN,
  pub HiberFileType: BYTE,
  pub AoAcConnectivitySupported: BOOLEAN,
  pub spare3: [BYTE; 6usize],
  pub SystemBatteriesPresent: BOOLEAN,
  pub BatteriesAreShortTerm: BOOLEAN,
  pub BatteryScale: [BATTERY_REPORTING_SCALE; 3usize],
  pub AcOnLineWake: SYSTEM_POWER_STATE,
  pub SoftLidWake: SYSTEM_POWER_STATE,
  pub RtcWake: SYSTEM_POWER_STATE,
  pub MinDeviceWakeState: SYSTEM_POWER_STATE,
  pub DefaultLowLatencyWake: SYSTEM_POWER_STATE,
}
#[test]
fn bindgen_test_layout_SYSTEM_POWER_CAPABILITIES() {
  assert_eq!(
    ::std::mem::size_of::<SYSTEM_POWER_CAPABILITIES>(),
    76usize,
    concat!("Size of: ", stringify!(SYSTEM_POWER_CAPABILITIES))
  );
  assert_eq!(
    ::std::mem::align_of::<SYSTEM_POWER_CAPABILITIES>(),
    4usize,
    concat!("Alignment of ", stringify!(SYSTEM_POWER_CAPABILITIES))
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<SYSTEM_POWER_CAPABILITIES>())).PowerButtonPresent as *const _ as usize
    },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(SYSTEM_POWER_CAPABILITIES),
      "::",
      stringify!(PowerButtonPresent)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<SYSTEM_POWER_CAPABILITIES>())).SleepButtonPresent as *const _ as usize
    },
    1usize,
    concat!(
      "Offset of field: ",
      stringify!(SYSTEM_POWER_CAPABILITIES),
      "::",
      stringify!(SleepButtonPresent)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<SYSTEM_POWER_CAPABILITIES>())).LidPresent as *const _ as usize
    },
    2usize,
    concat!(
      "Offset of field: ",
      stringify!(SYSTEM_POWER_CAPABILITIES),
      "::",
      stringify!(LidPresent)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<SYSTEM_POWER_CAPABILITIES>())).SystemS1 as *const _ as usize },
    3usize,
    concat!(
      "Offset of field: ",
      stringify!(SYSTEM_POWER_CAPABILITIES),
      "::",
      stringify!(SystemS1)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<SYSTEM_POWER_CAPABILITIES>())).SystemS2 as *const _ as usize },
    4usize,
    concat!(
      "Offset of field: ",
      stringify!(SYSTEM_POWER_CAPABILITIES),
      "::",
      stringify!(SystemS2)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<SYSTEM_POWER_CAPABILITIES>())).SystemS3 as *const _ as usize },
    5usize,
    concat!(
      "Offset of field: ",
      stringify!(SYSTEM_POWER_CAPABILITIES),
      "::",
      stringify!(SystemS3)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<SYSTEM_POWER_CAPABILITIES>())).SystemS4 as *const _ as usize },
    6usize,
    concat!(
      "Offset of field: ",
      stringify!(SYSTEM_POWER_CAPABILITIES),
      "::",
      stringify!(SystemS4)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<SYSTEM_POWER_CAPABILITIES>())).SystemS5 as *const _ as usize },
    7usize,
    concat!(
      "Offset of field: ",
      stringify!(SYSTEM_POWER_CAPABILITIES),
      "::",
      stringify!(SystemS5)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<SYSTEM_POWER_CAPABILITIES>())).HiberFilePresent as *const _ as usize
    },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(SYSTEM_POWER_CAPABILITIES),
      "::",
      stringify!(HiberFilePresent)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<SYSTEM_POWER_CAPABILITIES>())).FullWake as *const _ as usize },
    9usize,
    concat!(
      "Offset of field: ",
      stringify!(SYSTEM_POWER_CAPABILITIES),
      "::",
      stringify!(FullWake)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<SYSTEM_POWER_CAPABILITIES>())).VideoDimPresent as *const _ as usize
    },
    10usize,
    concat!(
      "Offset of field: ",
      stringify!(SYSTEM_POWER_CAPABILITIES),
      "::",
      stringify!(VideoDimPresent)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<SYSTEM_POWER_CAPABILITIES>())).ApmPresent as *const _ as usize
    },
    11usize,
    concat!(
      "Offset of field: ",
      stringify!(SYSTEM_POWER_CAPABILITIES),
      "::",
      stringify!(ApmPresent)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<SYSTEM_POWER_CAPABILITIES>())).UpsPresent as *const _ as usize
    },
    12usize,
    concat!(
      "Offset of field: ",
      stringify!(SYSTEM_POWER_CAPABILITIES),
      "::",
      stringify!(UpsPresent)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<SYSTEM_POWER_CAPABILITIES>())).ThermalControl as *const _ as usize
    },
    13usize,
    concat!(
      "Offset of field: ",
      stringify!(SYSTEM_POWER_CAPABILITIES),
      "::",
      stringify!(ThermalControl)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<SYSTEM_POWER_CAPABILITIES>())).ProcessorThrottle as *const _ as usize
    },
    14usize,
    concat!(
      "Offset of field: ",
      stringify!(SYSTEM_POWER_CAPABILITIES),
      "::",
      stringify!(ProcessorThrottle)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<SYSTEM_POWER_CAPABILITIES>())).ProcessorMinThrottle as *const _
        as usize
    },
    15usize,
    concat!(
      "Offset of field: ",
      stringify!(SYSTEM_POWER_CAPABILITIES),
      "::",
      stringify!(ProcessorMinThrottle)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<SYSTEM_POWER_CAPABILITIES>())).ProcessorMaxThrottle as *const _
        as usize
    },
    16usize,
    concat!(
      "Offset of field: ",
      stringify!(SYSTEM_POWER_CAPABILITIES),
      "::",
      stringify!(ProcessorMaxThrottle)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<SYSTEM_POWER_CAPABILITIES>())).FastSystemS4 as *const _ as usize
    },
    17usize,
    concat!(
      "Offset of field: ",
      stringify!(SYSTEM_POWER_CAPABILITIES),
      "::",
      stringify!(FastSystemS4)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<SYSTEM_POWER_CAPABILITIES>())).Hiberboot as *const _ as usize },
    18usize,
    concat!(
      "Offset of field: ",
      stringify!(SYSTEM_POWER_CAPABILITIES),
      "::",
      stringify!(Hiberboot)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<SYSTEM_POWER_CAPABILITIES>())).WakeAlarmPresent as *const _ as usize
    },
    19usize,
    concat!(
      "Offset of field: ",
      stringify!(SYSTEM_POWER_CAPABILITIES),
      "::",
      stringify!(WakeAlarmPresent)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<SYSTEM_POWER_CAPABILITIES>())).AoAc as *const _ as usize },
    20usize,
    concat!(
      "Offset of field: ",
      stringify!(SYSTEM_POWER_CAPABILITIES),
      "::",
      stringify!(AoAc)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<SYSTEM_POWER_CAPABILITIES>())).DiskSpinDown as *const _ as usize
    },
    21usize,
    concat!(
      "Offset of field: ",
      stringify!(SYSTEM_POWER_CAPABILITIES),
      "::",
      stringify!(DiskSpinDown)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<SYSTEM_POWER_CAPABILITIES>())).HiberFileType as *const _ as usize
    },
    22usize,
    concat!(
      "Offset of field: ",
      stringify!(SYSTEM_POWER_CAPABILITIES),
      "::",
      stringify!(HiberFileType)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<SYSTEM_POWER_CAPABILITIES>())).AoAcConnectivitySupported as *const _
        as usize
    },
    23usize,
    concat!(
      "Offset of field: ",
      stringify!(SYSTEM_POWER_CAPABILITIES),
      "::",
      stringify!(AoAcConnectivitySupported)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<SYSTEM_POWER_CAPABILITIES>())).spare3 as *const _ as usize },
    24usize,
    concat!(
      "Offset of field: ",
      stringify!(SYSTEM_POWER_CAPABILITIES),
      "::",
      stringify!(spare3)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<SYSTEM_POWER_CAPABILITIES>())).SystemBatteriesPresent as *const _
        as usize
    },
    30usize,
    concat!(
      "Offset of field: ",
      stringify!(SYSTEM_POWER_CAPABILITIES),
      "::",
      stringify!(SystemBatteriesPresent)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<SYSTEM_POWER_CAPABILITIES>())).BatteriesAreShortTerm as *const _
        as usize
    },
    31usize,
    concat!(
      "Offset of field: ",
      stringify!(SYSTEM_POWER_CAPABILITIES),
      "::",
      stringify!(BatteriesAreShortTerm)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<SYSTEM_POWER_CAPABILITIES>())).BatteryScale as *const _ as usize
    },
    32usize,
    concat!(
      "Offset of field: ",
      stringify!(SYSTEM_POWER_CAPABILITIES),
      "::",
      stringify!(BatteryScale)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<SYSTEM_POWER_CAPABILITIES>())).AcOnLineWake as *const _ as usize
    },
    56usize,
    concat!(
      "Offset of field: ",
      stringify!(SYSTEM_POWER_CAPABILITIES),
      "::",
      stringify!(AcOnLineWake)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<SYSTEM_POWER_CAPABILITIES>())).SoftLidWake as *const _ as usize
    },
    60usize,
    concat!(
      "Offset of field: ",
      stringify!(SYSTEM_POWER_CAPABILITIES),
      "::",
      stringify!(SoftLidWake)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<SYSTEM_POWER_CAPABILITIES>())).RtcWake as *const _ as usize },
    64usize,
    concat!(
      "Offset of field: ",
      stringify!(SYSTEM_POWER_CAPABILITIES),
      "::",
      stringify!(RtcWake)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<SYSTEM_POWER_CAPABILITIES>())).MinDeviceWakeState as *const _ as usize
    },
    68usize,
    concat!(
      "Offset of field: ",
      stringify!(SYSTEM_POWER_CAPABILITIES),
      "::",
      stringify!(MinDeviceWakeState)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<SYSTEM_POWER_CAPABILITIES>())).DefaultLowLatencyWake as *const _
        as usize
    },
    72usize,
    concat!(
      "Offset of field: ",
      stringify!(SYSTEM_POWER_CAPABILITIES),
      "::",
      stringify!(DefaultLowLatencyWake)
    )
  );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SYSTEM_BATTERY_STATE {
  pub AcOnLine: BOOLEAN,
  pub BatteryPresent: BOOLEAN,
  pub Charging: BOOLEAN,
  pub Discharging: BOOLEAN,
  pub Spare1: [BOOLEAN; 3usize],
  pub Tag: BYTE,
  pub MaxCapacity: DWORD,
  pub RemainingCapacity: DWORD,
  pub Rate: DWORD,
  pub EstimatedTime: DWORD,
  pub DefaultAlert1: DWORD,
  pub DefaultAlert2: DWORD,
}
#[test]
fn bindgen_test_layout_SYSTEM_BATTERY_STATE() {
  assert_eq!(
    ::std::mem::size_of::<SYSTEM_BATTERY_STATE>(),
    32usize,
    concat!("Size of: ", stringify!(SYSTEM_BATTERY_STATE))
  );
  assert_eq!(
    ::std::mem::align_of::<SYSTEM_BATTERY_STATE>(),
    4usize,
    concat!("Alignment of ", stringify!(SYSTEM_BATTERY_STATE))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<SYSTEM_BATTERY_STATE>())).AcOnLine as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(SYSTEM_BATTERY_STATE),
      "::",
      stringify!(AcOnLine)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<SYSTEM_BATTERY_STATE>())).BatteryPresent as *const _ as usize },
    1usize,
    concat!(
      "Offset of field: ",
      stringify!(SYSTEM_BATTERY_STATE),
      "::",
      stringify!(BatteryPresent)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<SYSTEM_BATTERY_STATE>())).Charging as *const _ as usize },
    2usize,
    concat!(
      "Offset of field: ",
      stringify!(SYSTEM_BATTERY_STATE),
      "::",
      stringify!(Charging)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<SYSTEM_BATTERY_STATE>())).Discharging as *const _ as usize },
    3usize,
    concat!(
      "Offset of field: ",
      stringify!(SYSTEM_BATTERY_STATE),
      "::",
      stringify!(Discharging)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<SYSTEM_BATTERY_STATE>())).Spare1 as *const _ as usize },
    4usize,
    concat!(
      "Offset of field: ",
      stringify!(SYSTEM_BATTERY_STATE),
      "::",
      stringify!(Spare1)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<SYSTEM_BATTERY_STATE>())).Tag as *const _ as usize },
    7usize,
    concat!(
      "Offset of field: ",
      stringify!(SYSTEM_BATTERY_STATE),
      "::",
      stringify!(Tag)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<SYSTEM_BATTERY_STATE>())).MaxCapacity as *const _ as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(SYSTEM_BATTERY_STATE),
      "::",
      stringify!(MaxCapacity)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<SYSTEM_BATTERY_STATE>())).RemainingCapacity as *const _ as usize
    },
    12usize,
    concat!(
      "Offset of field: ",
      stringify!(SYSTEM_BATTERY_STATE),
      "::",
      stringify!(RemainingCapacity)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<SYSTEM_BATTERY_STATE>())).Rate as *const _ as usize },
    16usize,
    concat!(
      "Offset of field: ",
      stringify!(SYSTEM_BATTERY_STATE),
      "::",
      stringify!(Rate)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<SYSTEM_BATTERY_STATE>())).EstimatedTime as *const _ as usize },
    20usize,
    concat!(
      "Offset of field: ",
      stringify!(SYSTEM_BATTERY_STATE),
      "::",
      stringify!(EstimatedTime)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<SYSTEM_BATTERY_STATE>())).DefaultAlert1 as *const _ as usize },
    24usize,
    concat!(
      "Offset of field: ",
      stringify!(SYSTEM_BATTERY_STATE),
      "::",
      stringify!(DefaultAlert1)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<SYSTEM_BATTERY_STATE>())).DefaultAlert2 as *const _ as usize },
    28usize,
    concat!(
      "Offset of field: ",
      stringify!(SYSTEM_BATTERY_STATE),
      "::",
      stringify!(DefaultAlert2)
    )
  );
}
#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Copy, Clone)]
pub struct _SLIST_ENTRY {
  pub Next: *mut _SLIST_ENTRY,
}
#[test]
fn bindgen_test_layout__SLIST_ENTRY() {
  assert_eq!(
    ::std::mem::size_of::<_SLIST_ENTRY>(),
    16usize,
    concat!("Size of: ", stringify!(_SLIST_ENTRY))
  );
  assert_eq!(
    ::std::mem::align_of::<_SLIST_ENTRY>(),
    16usize,
    concat!("Alignment of ", stringify!(_SLIST_ENTRY))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SLIST_ENTRY>())).Next as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_SLIST_ENTRY),
      "::",
      stringify!(Next)
    )
  );
}
pub type SLIST_ENTRY = _SLIST_ENTRY;
#[repr(C)]
#[repr(align(16))]
#[derive(Copy, Clone)]
pub union _SLIST_HEADER {
  pub __bindgen_anon_1: _SLIST_HEADER__bindgen_ty_1,
  pub HeaderX64: _SLIST_HEADER__bindgen_ty_2,
  _bindgen_union_align: u128,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SLIST_HEADER__bindgen_ty_1 {
  pub Alignment: ULONGLONG,
  pub Region: ULONGLONG,
}
#[test]
fn bindgen_test_layout__SLIST_HEADER__bindgen_ty_1() {
  assert_eq!(
    ::std::mem::size_of::<_SLIST_HEADER__bindgen_ty_1>(),
    16usize,
    concat!("Size of: ", stringify!(_SLIST_HEADER__bindgen_ty_1))
  );
  assert_eq!(
    ::std::mem::align_of::<_SLIST_HEADER__bindgen_ty_1>(),
    8usize,
    concat!("Alignment of ", stringify!(_SLIST_HEADER__bindgen_ty_1))
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_SLIST_HEADER__bindgen_ty_1>())).Alignment as *const _ as usize
    },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_SLIST_HEADER__bindgen_ty_1),
      "::",
      stringify!(Alignment)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SLIST_HEADER__bindgen_ty_1>())).Region as *const _ as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_SLIST_HEADER__bindgen_ty_1),
      "::",
      stringify!(Region)
    )
  );
}
#[repr(C)]
#[repr(align(8))]
#[derive(Debug, Copy, Clone)]
pub struct _SLIST_HEADER__bindgen_ty_2 {
  pub _bitfield_1: __BindgenBitfieldUnit<[u8; 16usize], u64>,
}
#[test]
fn bindgen_test_layout__SLIST_HEADER__bindgen_ty_2() {
  assert_eq!(
    ::std::mem::size_of::<_SLIST_HEADER__bindgen_ty_2>(),
    16usize,
    concat!("Size of: ", stringify!(_SLIST_HEADER__bindgen_ty_2))
  );
  assert_eq!(
    ::std::mem::align_of::<_SLIST_HEADER__bindgen_ty_2>(),
    8usize,
    concat!("Alignment of ", stringify!(_SLIST_HEADER__bindgen_ty_2))
  );
}
impl _SLIST_HEADER__bindgen_ty_2 {
  #[inline]
  pub fn Depth(&self) -> ULONGLONG {
    unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 16u8) as u64) }
  }
  #[inline]
  pub fn set_Depth(&mut self, val: ULONGLONG) {
    unsafe {
      let val: u64 = ::std::mem::transmute(val);
      self._bitfield_1.set(0usize, 16u8, val as u64)
    }
  }
  #[inline]
  pub fn Sequence(&self) -> ULONGLONG {
    unsafe { ::std::mem::transmute(self._bitfield_1.get(16usize, 48u8) as u64) }
  }
  #[inline]
  pub fn set_Sequence(&mut self, val: ULONGLONG) {
    unsafe {
      let val: u64 = ::std::mem::transmute(val);
      self._bitfield_1.set(16usize, 48u8, val as u64)
    }
  }
  #[inline]
  pub fn Reserved(&self) -> ULONGLONG {
    unsafe { ::std::mem::transmute(self._bitfield_1.get(64usize, 4u8) as u64) }
  }
  #[inline]
  pub fn set_Reserved(&mut self, val: ULONGLONG) {
    unsafe {
      let val: u64 = ::std::mem::transmute(val);
      self._bitfield_1.set(64usize, 4u8, val as u64)
    }
  }
  #[inline]
  pub fn NextEntry(&self) -> ULONGLONG {
    unsafe { ::std::mem::transmute(self._bitfield_1.get(68usize, 60u8) as u64) }
  }
  #[inline]
  pub fn set_NextEntry(&mut self, val: ULONGLONG) {
    unsafe {
      let val: u64 = ::std::mem::transmute(val);
      self._bitfield_1.set(68usize, 60u8, val as u64)
    }
  }
  #[inline]
  pub fn new_bitfield_1(
    Depth: ULONGLONG,
    Sequence: ULONGLONG,
    Reserved: ULONGLONG,
    NextEntry: ULONGLONG,
  ) -> __BindgenBitfieldUnit<[u8; 16usize], u64> {
    let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 16usize], u64> = Default::default();
    __bindgen_bitfield_unit.set(0usize, 16u8, {
      let Depth: u64 = unsafe { ::std::mem::transmute(Depth) };
      Depth as u64
    });
    __bindgen_bitfield_unit.set(16usize, 48u8, {
      let Sequence: u64 = unsafe { ::std::mem::transmute(Sequence) };
      Sequence as u64
    });
    __bindgen_bitfield_unit.set(64usize, 4u8, {
      let Reserved: u64 = unsafe { ::std::mem::transmute(Reserved) };
      Reserved as u64
    });
    __bindgen_bitfield_unit.set(68usize, 60u8, {
      let NextEntry: u64 = unsafe { ::std::mem::transmute(NextEntry) };
      NextEntry as u64
    });
    __bindgen_bitfield_unit
  }
}
#[test]
fn bindgen_test_layout__SLIST_HEADER() {
  assert_eq!(
    ::std::mem::size_of::<_SLIST_HEADER>(),
    16usize,
    concat!("Size of: ", stringify!(_SLIST_HEADER))
  );
  assert_eq!(
    ::std::mem::align_of::<_SLIST_HEADER>(),
    16usize,
    concat!("Alignment of ", stringify!(_SLIST_HEADER))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SLIST_HEADER>())).HeaderX64 as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_SLIST_HEADER),
      "::",
      stringify!(HeaderX64)
    )
  );
}
pub type SLIST_HEADER = _SLIST_HEADER;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _RTL_BARRIER {
  pub Reserved1: DWORD,
  pub Reserved2: DWORD,
  pub Reserved3: [ULONG_PTR; 2usize],
  pub Reserved4: DWORD,
  pub Reserved5: DWORD,
}
#[test]
fn bindgen_test_layout__RTL_BARRIER() {
  assert_eq!(
    ::std::mem::size_of::<_RTL_BARRIER>(),
    32usize,
    concat!("Size of: ", stringify!(_RTL_BARRIER))
  );
  assert_eq!(
    ::std::mem::align_of::<_RTL_BARRIER>(),
    8usize,
    concat!("Alignment of ", stringify!(_RTL_BARRIER))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_RTL_BARRIER>())).Reserved1 as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_RTL_BARRIER),
      "::",
      stringify!(Reserved1)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_RTL_BARRIER>())).Reserved2 as *const _ as usize },
    4usize,
    concat!(
      "Offset of field: ",
      stringify!(_RTL_BARRIER),
      "::",
      stringify!(Reserved2)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_RTL_BARRIER>())).Reserved3 as *const _ as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_RTL_BARRIER),
      "::",
      stringify!(Reserved3)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_RTL_BARRIER>())).Reserved4 as *const _ as usize },
    24usize,
    concat!(
      "Offset of field: ",
      stringify!(_RTL_BARRIER),
      "::",
      stringify!(Reserved4)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_RTL_BARRIER>())).Reserved5 as *const _ as usize },
    28usize,
    concat!(
      "Offset of field: ",
      stringify!(_RTL_BARRIER),
      "::",
      stringify!(Reserved5)
    )
  );
}
pub type RTL_BARRIER = _RTL_BARRIER;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _RTL_SRWLOCK {
  pub Ptr: PVOID,
}
#[test]
fn bindgen_test_layout__RTL_SRWLOCK() {
  assert_eq!(
    ::std::mem::size_of::<_RTL_SRWLOCK>(),
    8usize,
    concat!("Size of: ", stringify!(_RTL_SRWLOCK))
  );
  assert_eq!(
    ::std::mem::align_of::<_RTL_SRWLOCK>(),
    8usize,
    concat!("Alignment of ", stringify!(_RTL_SRWLOCK))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_RTL_SRWLOCK>())).Ptr as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_RTL_SRWLOCK),
      "::",
      stringify!(Ptr)
    )
  );
}
pub type RTL_SRWLOCK = _RTL_SRWLOCK;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SUPPORTED_OS_INFO {
  pub MajorVersion: WORD,
  pub MinorVersion: WORD,
}
#[test]
fn bindgen_test_layout__SUPPORTED_OS_INFO() {
  assert_eq!(
    ::std::mem::size_of::<_SUPPORTED_OS_INFO>(),
    4usize,
    concat!("Size of: ", stringify!(_SUPPORTED_OS_INFO))
  );
  assert_eq!(
    ::std::mem::align_of::<_SUPPORTED_OS_INFO>(),
    2usize,
    concat!("Alignment of ", stringify!(_SUPPORTED_OS_INFO))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SUPPORTED_OS_INFO>())).MajorVersion as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_SUPPORTED_OS_INFO),
      "::",
      stringify!(MajorVersion)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SUPPORTED_OS_INFO>())).MinorVersion as *const _ as usize },
    2usize,
    concat!(
      "Offset of field: ",
      stringify!(_SUPPORTED_OS_INFO),
      "::",
      stringify!(MinorVersion)
    )
  );
}
pub type SUPPORTED_OS_INFO = _SUPPORTED_OS_INFO;
pub const _CM_SERVICE_NODE_TYPE_DriverType: _CM_SERVICE_NODE_TYPE = 1;
pub const _CM_SERVICE_NODE_TYPE_FileSystemType: _CM_SERVICE_NODE_TYPE = 2;
pub const _CM_SERVICE_NODE_TYPE_Win32ServiceOwnProcess: _CM_SERVICE_NODE_TYPE = 16;
pub const _CM_SERVICE_NODE_TYPE_Win32ServiceShareProcess: _CM_SERVICE_NODE_TYPE = 32;
pub const _CM_SERVICE_NODE_TYPE_AdapterType: _CM_SERVICE_NODE_TYPE = 4;
pub const _CM_SERVICE_NODE_TYPE_RecognizerType: _CM_SERVICE_NODE_TYPE = 8;
pub type _CM_SERVICE_NODE_TYPE = ::std::os::raw::c_int;
pub use self::_CM_SERVICE_NODE_TYPE as SERVICE_NODE_TYPE;
pub const _CM_SERVICE_LOAD_TYPE_BootLoad: _CM_SERVICE_LOAD_TYPE = 0;
pub const _CM_SERVICE_LOAD_TYPE_SystemLoad: _CM_SERVICE_LOAD_TYPE = 1;
pub const _CM_SERVICE_LOAD_TYPE_AutoLoad: _CM_SERVICE_LOAD_TYPE = 2;
pub const _CM_SERVICE_LOAD_TYPE_DemandLoad: _CM_SERVICE_LOAD_TYPE = 3;
pub const _CM_SERVICE_LOAD_TYPE_DisableLoad: _CM_SERVICE_LOAD_TYPE = 4;
pub type _CM_SERVICE_LOAD_TYPE = ::std::os::raw::c_int;
pub use self::_CM_SERVICE_LOAD_TYPE as SERVICE_LOAD_TYPE;
pub const _CM_ERROR_CONTROL_TYPE_IgnoreError: _CM_ERROR_CONTROL_TYPE = 0;
pub const _CM_ERROR_CONTROL_TYPE_NormalError: _CM_ERROR_CONTROL_TYPE = 1;
pub const _CM_ERROR_CONTROL_TYPE_SevereError: _CM_ERROR_CONTROL_TYPE = 2;
pub const _CM_ERROR_CONTROL_TYPE_CriticalError: _CM_ERROR_CONTROL_TYPE = 3;
pub type _CM_ERROR_CONTROL_TYPE = ::std::os::raw::c_int;
pub use self::_CM_ERROR_CONTROL_TYPE as SERVICE_ERROR_TYPE;
pub type SAVEPOINT_ID = ULONG;
pub type LPARAM = LONG_PTR;
pub type LRESULT = LONG_PTR;
pub type SPHANDLE = *mut HANDLE;
pub type HGLOBAL = HANDLE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct HKEY__ {
  pub unused: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_HKEY__() {
  assert_eq!(
    ::std::mem::size_of::<HKEY__>(),
    4usize,
    concat!("Size of: ", stringify!(HKEY__))
  );
  assert_eq!(
    ::std::mem::align_of::<HKEY__>(),
    4usize,
    concat!("Alignment of ", stringify!(HKEY__))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<HKEY__>())).unused as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(HKEY__),
      "::",
      stringify!(unused)
    )
  );
}
pub type HKEY = *mut HKEY__;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct HINSTANCE__ {
  pub unused: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_HINSTANCE__() {
  assert_eq!(
    ::std::mem::size_of::<HINSTANCE__>(),
    4usize,
    concat!("Size of: ", stringify!(HINSTANCE__))
  );
  assert_eq!(
    ::std::mem::align_of::<HINSTANCE__>(),
    4usize,
    concat!("Alignment of ", stringify!(HINSTANCE__))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<HINSTANCE__>())).unused as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(HINSTANCE__),
      "::",
      stringify!(unused)
    )
  );
}
pub type HINSTANCE = *mut HINSTANCE__;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _FILETIME {
  pub dwLowDateTime: DWORD,
  pub dwHighDateTime: DWORD,
}
#[test]
fn bindgen_test_layout__FILETIME() {
  assert_eq!(
    ::std::mem::size_of::<_FILETIME>(),
    8usize,
    concat!("Size of: ", stringify!(_FILETIME))
  );
  assert_eq!(
    ::std::mem::align_of::<_FILETIME>(),
    4usize,
    concat!("Alignment of ", stringify!(_FILETIME))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_FILETIME>())).dwLowDateTime as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_FILETIME),
      "::",
      stringify!(dwLowDateTime)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_FILETIME>())).dwHighDateTime as *const _ as usize },
    4usize,
    concat!(
      "Offset of field: ",
      stringify!(_FILETIME),
      "::",
      stringify!(dwHighDateTime)
    )
  );
}
pub type FILETIME = _FILETIME;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct HWND__ {
  pub unused: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_HWND__() {
  assert_eq!(
    ::std::mem::size_of::<HWND__>(),
    4usize,
    concat!("Size of: ", stringify!(HWND__))
  );
  assert_eq!(
    ::std::mem::align_of::<HWND__>(),
    4usize,
    concat!("Alignment of ", stringify!(HWND__))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<HWND__>())).unused as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(HWND__),
      "::",
      stringify!(unused)
    )
  );
}
pub type HWND = *mut HWND__;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct HBITMAP__ {
  pub unused: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_HBITMAP__() {
  assert_eq!(
    ::std::mem::size_of::<HBITMAP__>(),
    4usize,
    concat!("Size of: ", stringify!(HBITMAP__))
  );
  assert_eq!(
    ::std::mem::align_of::<HBITMAP__>(),
    4usize,
    concat!("Alignment of ", stringify!(HBITMAP__))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<HBITMAP__>())).unused as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(HBITMAP__),
      "::",
      stringify!(unused)
    )
  );
}
pub type HBITMAP = *mut HBITMAP__;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct HENHMETAFILE__ {
  pub unused: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_HENHMETAFILE__() {
  assert_eq!(
    ::std::mem::size_of::<HENHMETAFILE__>(),
    4usize,
    concat!("Size of: ", stringify!(HENHMETAFILE__))
  );
  assert_eq!(
    ::std::mem::align_of::<HENHMETAFILE__>(),
    4usize,
    concat!("Alignment of ", stringify!(HENHMETAFILE__))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<HENHMETAFILE__>())).unused as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(HENHMETAFILE__),
      "::",
      stringify!(unused)
    )
  );
}
pub type HENHMETAFILE = *mut HENHMETAFILE__;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct HICON__ {
  pub unused: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_HICON__() {
  assert_eq!(
    ::std::mem::size_of::<HICON__>(),
    4usize,
    concat!("Size of: ", stringify!(HICON__))
  );
  assert_eq!(
    ::std::mem::align_of::<HICON__>(),
    4usize,
    concat!("Alignment of ", stringify!(HICON__))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<HICON__>())).unused as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(HICON__),
      "::",
      stringify!(unused)
    )
  );
}
pub type HICON = *mut HICON__;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tagRECT {
  pub left: LONG,
  pub top: LONG,
  pub right: LONG,
  pub bottom: LONG,
}
#[test]
fn bindgen_test_layout_tagRECT() {
  assert_eq!(
    ::std::mem::size_of::<tagRECT>(),
    16usize,
    concat!("Size of: ", stringify!(tagRECT))
  );
  assert_eq!(
    ::std::mem::align_of::<tagRECT>(),
    4usize,
    concat!("Alignment of ", stringify!(tagRECT))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<tagRECT>())).left as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(tagRECT),
      "::",
      stringify!(left)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<tagRECT>())).top as *const _ as usize },
    4usize,
    concat!(
      "Offset of field: ",
      stringify!(tagRECT),
      "::",
      stringify!(top)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<tagRECT>())).right as *const _ as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(tagRECT),
      "::",
      stringify!(right)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<tagRECT>())).bottom as *const _ as usize },
    12usize,
    concat!(
      "Offset of field: ",
      stringify!(tagRECT),
      "::",
      stringify!(bottom)
    )
  );
}
pub type RECT = tagRECT;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tagSIZE {
  pub cx: LONG,
  pub cy: LONG,
}
#[test]
fn bindgen_test_layout_tagSIZE() {
  assert_eq!(
    ::std::mem::size_of::<tagSIZE>(),
    8usize,
    concat!("Size of: ", stringify!(tagSIZE))
  );
  assert_eq!(
    ::std::mem::align_of::<tagSIZE>(),
    4usize,
    concat!("Alignment of ", stringify!(tagSIZE))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<tagSIZE>())).cx as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(tagSIZE),
      "::",
      stringify!(cx)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<tagSIZE>())).cy as *const _ as usize },
    4usize,
    concat!(
      "Offset of field: ",
      stringify!(tagSIZE),
      "::",
      stringify!(cy)
    )
  );
}
pub type SIZE = tagSIZE;
pub type SIZEL = SIZE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SECURITY_ATTRIBUTES {
  pub nLength: DWORD,
  pub lpSecurityDescriptor: LPVOID,
  pub bInheritHandle: BOOL,
}
#[test]
fn bindgen_test_layout__SECURITY_ATTRIBUTES() {
  assert_eq!(
    ::std::mem::size_of::<_SECURITY_ATTRIBUTES>(),
    24usize,
    concat!("Size of: ", stringify!(_SECURITY_ATTRIBUTES))
  );
  assert_eq!(
    ::std::mem::align_of::<_SECURITY_ATTRIBUTES>(),
    8usize,
    concat!("Alignment of ", stringify!(_SECURITY_ATTRIBUTES))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SECURITY_ATTRIBUTES>())).nLength as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_SECURITY_ATTRIBUTES),
      "::",
      stringify!(nLength)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_SECURITY_ATTRIBUTES>())).lpSecurityDescriptor as *const _ as usize
    },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_SECURITY_ATTRIBUTES),
      "::",
      stringify!(lpSecurityDescriptor)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SECURITY_ATTRIBUTES>())).bInheritHandle as *const _ as usize },
    16usize,
    concat!(
      "Offset of field: ",
      stringify!(_SECURITY_ATTRIBUTES),
      "::",
      stringify!(bInheritHandle)
    )
  );
}
pub type SECURITY_ATTRIBUTES = _SECURITY_ATTRIBUTES;
pub type LPSECURITY_ATTRIBUTES = *mut _SECURITY_ATTRIBUTES;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _OVERLAPPED {
  pub Internal: ULONG_PTR,
  pub InternalHigh: ULONG_PTR,
  pub __bindgen_anon_1: _OVERLAPPED__bindgen_ty_1,
  pub hEvent: HANDLE,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _OVERLAPPED__bindgen_ty_1 {
  pub __bindgen_anon_1: _OVERLAPPED__bindgen_ty_1__bindgen_ty_1,
  pub Pointer: PVOID,
  _bindgen_union_align: u64,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _OVERLAPPED__bindgen_ty_1__bindgen_ty_1 {
  pub Offset: DWORD,
  pub OffsetHigh: DWORD,
}
#[test]
fn bindgen_test_layout__OVERLAPPED__bindgen_ty_1__bindgen_ty_1() {
  assert_eq!(
    ::std::mem::size_of::<_OVERLAPPED__bindgen_ty_1__bindgen_ty_1>(),
    8usize,
    concat!(
      "Size of: ",
      stringify!(_OVERLAPPED__bindgen_ty_1__bindgen_ty_1)
    )
  );
  assert_eq!(
    ::std::mem::align_of::<_OVERLAPPED__bindgen_ty_1__bindgen_ty_1>(),
    4usize,
    concat!(
      "Alignment of ",
      stringify!(_OVERLAPPED__bindgen_ty_1__bindgen_ty_1)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_OVERLAPPED__bindgen_ty_1__bindgen_ty_1>())).Offset as *const _
        as usize
    },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_OVERLAPPED__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(Offset)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_OVERLAPPED__bindgen_ty_1__bindgen_ty_1>())).OffsetHigh as *const _
        as usize
    },
    4usize,
    concat!(
      "Offset of field: ",
      stringify!(_OVERLAPPED__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(OffsetHigh)
    )
  );
}
#[test]
fn bindgen_test_layout__OVERLAPPED__bindgen_ty_1() {
  assert_eq!(
    ::std::mem::size_of::<_OVERLAPPED__bindgen_ty_1>(),
    8usize,
    concat!("Size of: ", stringify!(_OVERLAPPED__bindgen_ty_1))
  );
  assert_eq!(
    ::std::mem::align_of::<_OVERLAPPED__bindgen_ty_1>(),
    8usize,
    concat!("Alignment of ", stringify!(_OVERLAPPED__bindgen_ty_1))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_OVERLAPPED__bindgen_ty_1>())).Pointer as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_OVERLAPPED__bindgen_ty_1),
      "::",
      stringify!(Pointer)
    )
  );
}
#[test]
fn bindgen_test_layout__OVERLAPPED() {
  assert_eq!(
    ::std::mem::size_of::<_OVERLAPPED>(),
    32usize,
    concat!("Size of: ", stringify!(_OVERLAPPED))
  );
  assert_eq!(
    ::std::mem::align_of::<_OVERLAPPED>(),
    8usize,
    concat!("Alignment of ", stringify!(_OVERLAPPED))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_OVERLAPPED>())).Internal as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_OVERLAPPED),
      "::",
      stringify!(Internal)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_OVERLAPPED>())).InternalHigh as *const _ as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_OVERLAPPED),
      "::",
      stringify!(InternalHigh)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_OVERLAPPED>())).hEvent as *const _ as usize },
    24usize,
    concat!(
      "Offset of field: ",
      stringify!(_OVERLAPPED),
      "::",
      stringify!(hEvent)
    )
  );
}
pub type LPOVERLAPPED = *mut _OVERLAPPED;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SYSTEMTIME {
  pub wYear: WORD,
  pub wMonth: WORD,
  pub wDayOfWeek: WORD,
  pub wDay: WORD,
  pub wHour: WORD,
  pub wMinute: WORD,
  pub wSecond: WORD,
  pub wMilliseconds: WORD,
}
#[test]
fn bindgen_test_layout__SYSTEMTIME() {
  assert_eq!(
    ::std::mem::size_of::<_SYSTEMTIME>(),
    16usize,
    concat!("Size of: ", stringify!(_SYSTEMTIME))
  );
  assert_eq!(
    ::std::mem::align_of::<_SYSTEMTIME>(),
    2usize,
    concat!("Alignment of ", stringify!(_SYSTEMTIME))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SYSTEMTIME>())).wYear as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEMTIME),
      "::",
      stringify!(wYear)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SYSTEMTIME>())).wMonth as *const _ as usize },
    2usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEMTIME),
      "::",
      stringify!(wMonth)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SYSTEMTIME>())).wDayOfWeek as *const _ as usize },
    4usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEMTIME),
      "::",
      stringify!(wDayOfWeek)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SYSTEMTIME>())).wDay as *const _ as usize },
    6usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEMTIME),
      "::",
      stringify!(wDay)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SYSTEMTIME>())).wHour as *const _ as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEMTIME),
      "::",
      stringify!(wHour)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SYSTEMTIME>())).wMinute as *const _ as usize },
    10usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEMTIME),
      "::",
      stringify!(wMinute)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SYSTEMTIME>())).wSecond as *const _ as usize },
    12usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEMTIME),
      "::",
      stringify!(wSecond)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SYSTEMTIME>())).wMilliseconds as *const _ as usize },
    14usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEMTIME),
      "::",
      stringify!(wMilliseconds)
    )
  );
}
pub type SYSTEMTIME = _SYSTEMTIME;
pub const _STREAM_INFO_LEVELS_FindStreamInfoStandard: _STREAM_INFO_LEVELS = 0;
pub const _STREAM_INFO_LEVELS_FindStreamInfoMaxInfoLevel: _STREAM_INFO_LEVELS = 1;
pub type _STREAM_INFO_LEVELS = ::std::os::raw::c_int;
pub use self::_STREAM_INFO_LEVELS as STREAM_INFO_LEVELS;
pub type SRWLOCK = RTL_SRWLOCK;
pub type SYNCHRONIZATION_BARRIER = RTL_BARRIER;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _PROCESS_INFORMATION {
  pub hProcess: HANDLE,
  pub hThread: HANDLE,
  pub dwProcessId: DWORD,
  pub dwThreadId: DWORD,
}
#[test]
fn bindgen_test_layout__PROCESS_INFORMATION() {
  assert_eq!(
    ::std::mem::size_of::<_PROCESS_INFORMATION>(),
    24usize,
    concat!("Size of: ", stringify!(_PROCESS_INFORMATION))
  );
  assert_eq!(
    ::std::mem::align_of::<_PROCESS_INFORMATION>(),
    8usize,
    concat!("Alignment of ", stringify!(_PROCESS_INFORMATION))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_PROCESS_INFORMATION>())).hProcess as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_PROCESS_INFORMATION),
      "::",
      stringify!(hProcess)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_PROCESS_INFORMATION>())).hThread as *const _ as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_PROCESS_INFORMATION),
      "::",
      stringify!(hThread)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_PROCESS_INFORMATION>())).dwProcessId as *const _ as usize },
    16usize,
    concat!(
      "Offset of field: ",
      stringify!(_PROCESS_INFORMATION),
      "::",
      stringify!(dwProcessId)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_PROCESS_INFORMATION>())).dwThreadId as *const _ as usize },
    20usize,
    concat!(
      "Offset of field: ",
      stringify!(_PROCESS_INFORMATION),
      "::",
      stringify!(dwThreadId)
    )
  );
}
pub type LPPROCESS_INFORMATION = *mut _PROCESS_INFORMATION;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _STARTUPINFOA {
  pub cb: DWORD,
  pub lpReserved: LPSTR,
  pub lpDesktop: LPSTR,
  pub lpTitle: LPSTR,
  pub dwX: DWORD,
  pub dwY: DWORD,
  pub dwXSize: DWORD,
  pub dwYSize: DWORD,
  pub dwXCountChars: DWORD,
  pub dwYCountChars: DWORD,
  pub dwFillAttribute: DWORD,
  pub dwFlags: DWORD,
  pub wShowWindow: WORD,
  pub cbReserved2: WORD,
  pub lpReserved2: LPBYTE,
  pub hStdInput: HANDLE,
  pub hStdOutput: HANDLE,
  pub hStdError: HANDLE,
}
#[test]
fn bindgen_test_layout__STARTUPINFOA() {
  assert_eq!(
    ::std::mem::size_of::<_STARTUPINFOA>(),
    104usize,
    concat!("Size of: ", stringify!(_STARTUPINFOA))
  );
  assert_eq!(
    ::std::mem::align_of::<_STARTUPINFOA>(),
    8usize,
    concat!("Alignment of ", stringify!(_STARTUPINFOA))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_STARTUPINFOA>())).cb as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_STARTUPINFOA),
      "::",
      stringify!(cb)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_STARTUPINFOA>())).lpReserved as *const _ as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_STARTUPINFOA),
      "::",
      stringify!(lpReserved)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_STARTUPINFOA>())).lpDesktop as *const _ as usize },
    16usize,
    concat!(
      "Offset of field: ",
      stringify!(_STARTUPINFOA),
      "::",
      stringify!(lpDesktop)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_STARTUPINFOA>())).lpTitle as *const _ as usize },
    24usize,
    concat!(
      "Offset of field: ",
      stringify!(_STARTUPINFOA),
      "::",
      stringify!(lpTitle)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_STARTUPINFOA>())).dwX as *const _ as usize },
    32usize,
    concat!(
      "Offset of field: ",
      stringify!(_STARTUPINFOA),
      "::",
      stringify!(dwX)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_STARTUPINFOA>())).dwY as *const _ as usize },
    36usize,
    concat!(
      "Offset of field: ",
      stringify!(_STARTUPINFOA),
      "::",
      stringify!(dwY)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_STARTUPINFOA>())).dwXSize as *const _ as usize },
    40usize,
    concat!(
      "Offset of field: ",
      stringify!(_STARTUPINFOA),
      "::",
      stringify!(dwXSize)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_STARTUPINFOA>())).dwYSize as *const _ as usize },
    44usize,
    concat!(
      "Offset of field: ",
      stringify!(_STARTUPINFOA),
      "::",
      stringify!(dwYSize)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_STARTUPINFOA>())).dwXCountChars as *const _ as usize },
    48usize,
    concat!(
      "Offset of field: ",
      stringify!(_STARTUPINFOA),
      "::",
      stringify!(dwXCountChars)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_STARTUPINFOA>())).dwYCountChars as *const _ as usize },
    52usize,
    concat!(
      "Offset of field: ",
      stringify!(_STARTUPINFOA),
      "::",
      stringify!(dwYCountChars)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_STARTUPINFOA>())).dwFillAttribute as *const _ as usize },
    56usize,
    concat!(
      "Offset of field: ",
      stringify!(_STARTUPINFOA),
      "::",
      stringify!(dwFillAttribute)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_STARTUPINFOA>())).dwFlags as *const _ as usize },
    60usize,
    concat!(
      "Offset of field: ",
      stringify!(_STARTUPINFOA),
      "::",
      stringify!(dwFlags)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_STARTUPINFOA>())).wShowWindow as *const _ as usize },
    64usize,
    concat!(
      "Offset of field: ",
      stringify!(_STARTUPINFOA),
      "::",
      stringify!(wShowWindow)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_STARTUPINFOA>())).cbReserved2 as *const _ as usize },
    66usize,
    concat!(
      "Offset of field: ",
      stringify!(_STARTUPINFOA),
      "::",
      stringify!(cbReserved2)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_STARTUPINFOA>())).lpReserved2 as *const _ as usize },
    72usize,
    concat!(
      "Offset of field: ",
      stringify!(_STARTUPINFOA),
      "::",
      stringify!(lpReserved2)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_STARTUPINFOA>())).hStdInput as *const _ as usize },
    80usize,
    concat!(
      "Offset of field: ",
      stringify!(_STARTUPINFOA),
      "::",
      stringify!(hStdInput)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_STARTUPINFOA>())).hStdOutput as *const _ as usize },
    88usize,
    concat!(
      "Offset of field: ",
      stringify!(_STARTUPINFOA),
      "::",
      stringify!(hStdOutput)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_STARTUPINFOA>())).hStdError as *const _ as usize },
    96usize,
    concat!(
      "Offset of field: ",
      stringify!(_STARTUPINFOA),
      "::",
      stringify!(hStdError)
    )
  );
}
pub type STARTUPINFOA = _STARTUPINFOA;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _STARTUPINFOW {
  pub cb: DWORD,
  pub lpReserved: LPWSTR,
  pub lpDesktop: LPWSTR,
  pub lpTitle: LPWSTR,
  pub dwX: DWORD,
  pub dwY: DWORD,
  pub dwXSize: DWORD,
  pub dwYSize: DWORD,
  pub dwXCountChars: DWORD,
  pub dwYCountChars: DWORD,
  pub dwFillAttribute: DWORD,
  pub dwFlags: DWORD,
  pub wShowWindow: WORD,
  pub cbReserved2: WORD,
  pub lpReserved2: LPBYTE,
  pub hStdInput: HANDLE,
  pub hStdOutput: HANDLE,
  pub hStdError: HANDLE,
}
#[test]
fn bindgen_test_layout__STARTUPINFOW() {
  assert_eq!(
    ::std::mem::size_of::<_STARTUPINFOW>(),
    104usize,
    concat!("Size of: ", stringify!(_STARTUPINFOW))
  );
  assert_eq!(
    ::std::mem::align_of::<_STARTUPINFOW>(),
    8usize,
    concat!("Alignment of ", stringify!(_STARTUPINFOW))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_STARTUPINFOW>())).cb as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_STARTUPINFOW),
      "::",
      stringify!(cb)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_STARTUPINFOW>())).lpReserved as *const _ as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_STARTUPINFOW),
      "::",
      stringify!(lpReserved)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_STARTUPINFOW>())).lpDesktop as *const _ as usize },
    16usize,
    concat!(
      "Offset of field: ",
      stringify!(_STARTUPINFOW),
      "::",
      stringify!(lpDesktop)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_STARTUPINFOW>())).lpTitle as *const _ as usize },
    24usize,
    concat!(
      "Offset of field: ",
      stringify!(_STARTUPINFOW),
      "::",
      stringify!(lpTitle)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_STARTUPINFOW>())).dwX as *const _ as usize },
    32usize,
    concat!(
      "Offset of field: ",
      stringify!(_STARTUPINFOW),
      "::",
      stringify!(dwX)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_STARTUPINFOW>())).dwY as *const _ as usize },
    36usize,
    concat!(
      "Offset of field: ",
      stringify!(_STARTUPINFOW),
      "::",
      stringify!(dwY)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_STARTUPINFOW>())).dwXSize as *const _ as usize },
    40usize,
    concat!(
      "Offset of field: ",
      stringify!(_STARTUPINFOW),
      "::",
      stringify!(dwXSize)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_STARTUPINFOW>())).dwYSize as *const _ as usize },
    44usize,
    concat!(
      "Offset of field: ",
      stringify!(_STARTUPINFOW),
      "::",
      stringify!(dwYSize)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_STARTUPINFOW>())).dwXCountChars as *const _ as usize },
    48usize,
    concat!(
      "Offset of field: ",
      stringify!(_STARTUPINFOW),
      "::",
      stringify!(dwXCountChars)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_STARTUPINFOW>())).dwYCountChars as *const _ as usize },
    52usize,
    concat!(
      "Offset of field: ",
      stringify!(_STARTUPINFOW),
      "::",
      stringify!(dwYCountChars)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_STARTUPINFOW>())).dwFillAttribute as *const _ as usize },
    56usize,
    concat!(
      "Offset of field: ",
      stringify!(_STARTUPINFOW),
      "::",
      stringify!(dwFillAttribute)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_STARTUPINFOW>())).dwFlags as *const _ as usize },
    60usize,
    concat!(
      "Offset of field: ",
      stringify!(_STARTUPINFOW),
      "::",
      stringify!(dwFlags)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_STARTUPINFOW>())).wShowWindow as *const _ as usize },
    64usize,
    concat!(
      "Offset of field: ",
      stringify!(_STARTUPINFOW),
      "::",
      stringify!(wShowWindow)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_STARTUPINFOW>())).cbReserved2 as *const _ as usize },
    66usize,
    concat!(
      "Offset of field: ",
      stringify!(_STARTUPINFOW),
      "::",
      stringify!(cbReserved2)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_STARTUPINFOW>())).lpReserved2 as *const _ as usize },
    72usize,
    concat!(
      "Offset of field: ",
      stringify!(_STARTUPINFOW),
      "::",
      stringify!(lpReserved2)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_STARTUPINFOW>())).hStdInput as *const _ as usize },
    80usize,
    concat!(
      "Offset of field: ",
      stringify!(_STARTUPINFOW),
      "::",
      stringify!(hStdInput)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_STARTUPINFOW>())).hStdOutput as *const _ as usize },
    88usize,
    concat!(
      "Offset of field: ",
      stringify!(_STARTUPINFOW),
      "::",
      stringify!(hStdOutput)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_STARTUPINFOW>())).hStdError as *const _ as usize },
    96usize,
    concat!(
      "Offset of field: ",
      stringify!(_STARTUPINFOW),
      "::",
      stringify!(hStdError)
    )
  );
}
pub type STARTUPINFOW = _STARTUPINFOW;
pub type LPSTARTUPINFOW = *mut _STARTUPINFOW;
pub type STARTUPINFO = STARTUPINFOW;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _PROC_THREAD_ATTRIBUTE_LIST {
  _unused: [u8; 0],
}
pub type LPPROC_THREAD_ATTRIBUTE_LIST = *mut _PROC_THREAD_ATTRIBUTE_LIST;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _SYSTEM_INFO {
  pub __bindgen_anon_1: _SYSTEM_INFO__bindgen_ty_1,
  pub dwPageSize: DWORD,
  pub lpMinimumApplicationAddress: LPVOID,
  pub lpMaximumApplicationAddress: LPVOID,
  pub dwActiveProcessorMask: DWORD_PTR,
  pub dwNumberOfProcessors: DWORD,
  pub dwProcessorType: DWORD,
  pub dwAllocationGranularity: DWORD,
  pub wProcessorLevel: WORD,
  pub wProcessorRevision: WORD,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _SYSTEM_INFO__bindgen_ty_1 {
  pub dwOemId: DWORD,
  pub __bindgen_anon_1: _SYSTEM_INFO__bindgen_ty_1__bindgen_ty_1,
  _bindgen_union_align: u32,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SYSTEM_INFO__bindgen_ty_1__bindgen_ty_1 {
  pub wProcessorArchitecture: WORD,
  pub wReserved: WORD,
}
#[test]
fn bindgen_test_layout__SYSTEM_INFO__bindgen_ty_1__bindgen_ty_1() {
  assert_eq!(
    ::std::mem::size_of::<_SYSTEM_INFO__bindgen_ty_1__bindgen_ty_1>(),
    4usize,
    concat!(
      "Size of: ",
      stringify!(_SYSTEM_INFO__bindgen_ty_1__bindgen_ty_1)
    )
  );
  assert_eq!(
    ::std::mem::align_of::<_SYSTEM_INFO__bindgen_ty_1__bindgen_ty_1>(),
    2usize,
    concat!(
      "Alignment of ",
      stringify!(_SYSTEM_INFO__bindgen_ty_1__bindgen_ty_1)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_SYSTEM_INFO__bindgen_ty_1__bindgen_ty_1>())).wProcessorArchitecture
        as *const _ as usize
    },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_INFO__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(wProcessorArchitecture)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_SYSTEM_INFO__bindgen_ty_1__bindgen_ty_1>())).wReserved as *const _
        as usize
    },
    2usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_INFO__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(wReserved)
    )
  );
}
#[test]
fn bindgen_test_layout__SYSTEM_INFO__bindgen_ty_1() {
  assert_eq!(
    ::std::mem::size_of::<_SYSTEM_INFO__bindgen_ty_1>(),
    4usize,
    concat!("Size of: ", stringify!(_SYSTEM_INFO__bindgen_ty_1))
  );
  assert_eq!(
    ::std::mem::align_of::<_SYSTEM_INFO__bindgen_ty_1>(),
    4usize,
    concat!("Alignment of ", stringify!(_SYSTEM_INFO__bindgen_ty_1))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SYSTEM_INFO__bindgen_ty_1>())).dwOemId as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_INFO__bindgen_ty_1),
      "::",
      stringify!(dwOemId)
    )
  );
}
#[test]
fn bindgen_test_layout__SYSTEM_INFO() {
  assert_eq!(
    ::std::mem::size_of::<_SYSTEM_INFO>(),
    48usize,
    concat!("Size of: ", stringify!(_SYSTEM_INFO))
  );
  assert_eq!(
    ::std::mem::align_of::<_SYSTEM_INFO>(),
    8usize,
    concat!("Alignment of ", stringify!(_SYSTEM_INFO))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SYSTEM_INFO>())).dwPageSize as *const _ as usize },
    4usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_INFO),
      "::",
      stringify!(dwPageSize)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_SYSTEM_INFO>())).lpMinimumApplicationAddress as *const _ as usize
    },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_INFO),
      "::",
      stringify!(lpMinimumApplicationAddress)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_SYSTEM_INFO>())).lpMaximumApplicationAddress as *const _ as usize
    },
    16usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_INFO),
      "::",
      stringify!(lpMaximumApplicationAddress)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SYSTEM_INFO>())).dwActiveProcessorMask as *const _ as usize },
    24usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_INFO),
      "::",
      stringify!(dwActiveProcessorMask)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SYSTEM_INFO>())).dwNumberOfProcessors as *const _ as usize },
    32usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_INFO),
      "::",
      stringify!(dwNumberOfProcessors)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SYSTEM_INFO>())).dwProcessorType as *const _ as usize },
    36usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_INFO),
      "::",
      stringify!(dwProcessorType)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_SYSTEM_INFO>())).dwAllocationGranularity as *const _ as usize
    },
    40usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_INFO),
      "::",
      stringify!(dwAllocationGranularity)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SYSTEM_INFO>())).wProcessorLevel as *const _ as usize },
    44usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_INFO),
      "::",
      stringify!(wProcessorLevel)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SYSTEM_INFO>())).wProcessorRevision as *const _ as usize },
    46usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_INFO),
      "::",
      stringify!(wProcessorRevision)
    )
  );
}
pub type SYSTEM_INFO = _SYSTEM_INFO;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _STARTUPINFOEXA {
  pub StartupInfo: STARTUPINFOA,
  pub lpAttributeList: LPPROC_THREAD_ATTRIBUTE_LIST,
}
#[test]
fn bindgen_test_layout__STARTUPINFOEXA() {
  assert_eq!(
    ::std::mem::size_of::<_STARTUPINFOEXA>(),
    112usize,
    concat!("Size of: ", stringify!(_STARTUPINFOEXA))
  );
  assert_eq!(
    ::std::mem::align_of::<_STARTUPINFOEXA>(),
    8usize,
    concat!("Alignment of ", stringify!(_STARTUPINFOEXA))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_STARTUPINFOEXA>())).StartupInfo as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_STARTUPINFOEXA),
      "::",
      stringify!(StartupInfo)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_STARTUPINFOEXA>())).lpAttributeList as *const _ as usize },
    104usize,
    concat!(
      "Offset of field: ",
      stringify!(_STARTUPINFOEXA),
      "::",
      stringify!(lpAttributeList)
    )
  );
}
pub type STARTUPINFOEXA = _STARTUPINFOEXA;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _STARTUPINFOEXW {
  pub StartupInfo: STARTUPINFOW,
  pub lpAttributeList: LPPROC_THREAD_ATTRIBUTE_LIST,
}
#[test]
fn bindgen_test_layout__STARTUPINFOEXW() {
  assert_eq!(
    ::std::mem::size_of::<_STARTUPINFOEXW>(),
    112usize,
    concat!("Size of: ", stringify!(_STARTUPINFOEXW))
  );
  assert_eq!(
    ::std::mem::align_of::<_STARTUPINFOEXW>(),
    8usize,
    concat!("Alignment of ", stringify!(_STARTUPINFOEXW))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_STARTUPINFOEXW>())).StartupInfo as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_STARTUPINFOEXW),
      "::",
      stringify!(StartupInfo)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_STARTUPINFOEXW>())).lpAttributeList as *const _ as usize },
    104usize,
    concat!(
      "Offset of field: ",
      stringify!(_STARTUPINFOEXW),
      "::",
      stringify!(lpAttributeList)
    )
  );
}
pub type STARTUPINFOEXW = _STARTUPINFOEXW;
pub type STARTUPINFOEX = STARTUPINFOEXW;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SYSTEM_POWER_STATUS {
  pub ACLineStatus: BYTE,
  pub BatteryFlag: BYTE,
  pub BatteryLifePercent: BYTE,
  pub SystemStatusFlag: BYTE,
  pub BatteryLifeTime: DWORD,
  pub BatteryFullLifeTime: DWORD,
}
#[test]
fn bindgen_test_layout__SYSTEM_POWER_STATUS() {
  assert_eq!(
    ::std::mem::size_of::<_SYSTEM_POWER_STATUS>(),
    12usize,
    concat!("Size of: ", stringify!(_SYSTEM_POWER_STATUS))
  );
  assert_eq!(
    ::std::mem::align_of::<_SYSTEM_POWER_STATUS>(),
    4usize,
    concat!("Alignment of ", stringify!(_SYSTEM_POWER_STATUS))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SYSTEM_POWER_STATUS>())).ACLineStatus as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_POWER_STATUS),
      "::",
      stringify!(ACLineStatus)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SYSTEM_POWER_STATUS>())).BatteryFlag as *const _ as usize },
    1usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_POWER_STATUS),
      "::",
      stringify!(BatteryFlag)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_SYSTEM_POWER_STATUS>())).BatteryLifePercent as *const _ as usize
    },
    2usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_POWER_STATUS),
      "::",
      stringify!(BatteryLifePercent)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_SYSTEM_POWER_STATUS>())).SystemStatusFlag as *const _ as usize
    },
    3usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_POWER_STATUS),
      "::",
      stringify!(SystemStatusFlag)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_SYSTEM_POWER_STATUS>())).BatteryLifeTime as *const _ as usize
    },
    4usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_POWER_STATUS),
      "::",
      stringify!(BatteryLifeTime)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_SYSTEM_POWER_STATUS>())).BatteryFullLifeTime as *const _ as usize
    },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_SYSTEM_POWER_STATUS),
      "::",
      stringify!(BatteryFullLifeTime)
    )
  );
}
pub type SYSTEM_POWER_STATUS = _SYSTEM_POWER_STATUS;
pub type SENDASYNCPROC = ::std::option::Option<
  unsafe extern "C" fn(arg1: HWND, arg2: UINT, arg3: ULONG_PTR, arg4: LRESULT),
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SHELLHOOKINFO {
  pub hwnd: HWND,
  pub rc: RECT,
}
#[test]
fn bindgen_test_layout_SHELLHOOKINFO() {
  assert_eq!(
    ::std::mem::size_of::<SHELLHOOKINFO>(),
    24usize,
    concat!("Size of: ", stringify!(SHELLHOOKINFO))
  );
  assert_eq!(
    ::std::mem::align_of::<SHELLHOOKINFO>(),
    8usize,
    concat!("Alignment of ", stringify!(SHELLHOOKINFO))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<SHELLHOOKINFO>())).hwnd as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(SHELLHOOKINFO),
      "::",
      stringify!(hwnd)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<SHELLHOOKINFO>())).rc as *const _ as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(SHELLHOOKINFO),
      "::",
      stringify!(rc)
    )
  );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tagSTYLESTRUCT {
  pub styleOld: DWORD,
  pub styleNew: DWORD,
}
#[test]
fn bindgen_test_layout_tagSTYLESTRUCT() {
  assert_eq!(
    ::std::mem::size_of::<tagSTYLESTRUCT>(),
    8usize,
    concat!("Size of: ", stringify!(tagSTYLESTRUCT))
  );
  assert_eq!(
    ::std::mem::align_of::<tagSTYLESTRUCT>(),
    4usize,
    concat!("Alignment of ", stringify!(tagSTYLESTRUCT))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<tagSTYLESTRUCT>())).styleOld as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(tagSTYLESTRUCT),
      "::",
      stringify!(styleOld)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<tagSTYLESTRUCT>())).styleNew as *const _ as usize },
    4usize,
    concat!(
      "Offset of field: ",
      stringify!(tagSTYLESTRUCT),
      "::",
      stringify!(styleNew)
    )
  );
}
pub type STYLESTRUCT = tagSTYLESTRUCT;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tagSCROLLINFO {
  pub cbSize: UINT,
  pub fMask: UINT,
  pub nMin: ::std::os::raw::c_int,
  pub nMax: ::std::os::raw::c_int,
  pub nPage: UINT,
  pub nPos: ::std::os::raw::c_int,
  pub nTrackPos: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_tagSCROLLINFO() {
  assert_eq!(
    ::std::mem::size_of::<tagSCROLLINFO>(),
    28usize,
    concat!("Size of: ", stringify!(tagSCROLLINFO))
  );
  assert_eq!(
    ::std::mem::align_of::<tagSCROLLINFO>(),
    4usize,
    concat!("Alignment of ", stringify!(tagSCROLLINFO))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<tagSCROLLINFO>())).cbSize as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(tagSCROLLINFO),
      "::",
      stringify!(cbSize)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<tagSCROLLINFO>())).fMask as *const _ as usize },
    4usize,
    concat!(
      "Offset of field: ",
      stringify!(tagSCROLLINFO),
      "::",
      stringify!(fMask)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<tagSCROLLINFO>())).nMin as *const _ as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(tagSCROLLINFO),
      "::",
      stringify!(nMin)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<tagSCROLLINFO>())).nMax as *const _ as usize },
    12usize,
    concat!(
      "Offset of field: ",
      stringify!(tagSCROLLINFO),
      "::",
      stringify!(nMax)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<tagSCROLLINFO>())).nPage as *const _ as usize },
    16usize,
    concat!(
      "Offset of field: ",
      stringify!(tagSCROLLINFO),
      "::",
      stringify!(nPage)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<tagSCROLLINFO>())).nPos as *const _ as usize },
    20usize,
    concat!(
      "Offset of field: ",
      stringify!(tagSCROLLINFO),
      "::",
      stringify!(nPos)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<tagSCROLLINFO>())).nTrackPos as *const _ as usize },
    24usize,
    concat!(
      "Offset of field: ",
      stringify!(tagSCROLLINFO),
      "::",
      stringify!(nTrackPos)
    )
  );
}
pub type SCROLLINFO = tagSCROLLINFO;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tagSERIALKEYSA {
  pub cbSize: UINT,
  pub dwFlags: DWORD,
  pub lpszActivePort: LPSTR,
  pub lpszPort: LPSTR,
  pub iBaudRate: UINT,
  pub iPortState: UINT,
  pub iActive: UINT,
}
#[test]
fn bindgen_test_layout_tagSERIALKEYSA() {
  assert_eq!(
    ::std::mem::size_of::<tagSERIALKEYSA>(),
    40usize,
    concat!("Size of: ", stringify!(tagSERIALKEYSA))
  );
  assert_eq!(
    ::std::mem::align_of::<tagSERIALKEYSA>(),
    8usize,
    concat!("Alignment of ", stringify!(tagSERIALKEYSA))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<tagSERIALKEYSA>())).cbSize as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(tagSERIALKEYSA),
      "::",
      stringify!(cbSize)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<tagSERIALKEYSA>())).dwFlags as *const _ as usize },
    4usize,
    concat!(
      "Offset of field: ",
      stringify!(tagSERIALKEYSA),
      "::",
      stringify!(dwFlags)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<tagSERIALKEYSA>())).lpszActivePort as *const _ as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(tagSERIALKEYSA),
      "::",
      stringify!(lpszActivePort)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<tagSERIALKEYSA>())).lpszPort as *const _ as usize },
    16usize,
    concat!(
      "Offset of field: ",
      stringify!(tagSERIALKEYSA),
      "::",
      stringify!(lpszPort)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<tagSERIALKEYSA>())).iBaudRate as *const _ as usize },
    24usize,
    concat!(
      "Offset of field: ",
      stringify!(tagSERIALKEYSA),
      "::",
      stringify!(iBaudRate)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<tagSERIALKEYSA>())).iPortState as *const _ as usize },
    28usize,
    concat!(
      "Offset of field: ",
      stringify!(tagSERIALKEYSA),
      "::",
      stringify!(iPortState)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<tagSERIALKEYSA>())).iActive as *const _ as usize },
    32usize,
    concat!(
      "Offset of field: ",
      stringify!(tagSERIALKEYSA),
      "::",
      stringify!(iActive)
    )
  );
}
pub type SERIALKEYSA = tagSERIALKEYSA;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tagSERIALKEYSW {
  pub cbSize: UINT,
  pub dwFlags: DWORD,
  pub lpszActivePort: LPWSTR,
  pub lpszPort: LPWSTR,
  pub iBaudRate: UINT,
  pub iPortState: UINT,
  pub iActive: UINT,
}
#[test]
fn bindgen_test_layout_tagSERIALKEYSW() {
  assert_eq!(
    ::std::mem::size_of::<tagSERIALKEYSW>(),
    40usize,
    concat!("Size of: ", stringify!(tagSERIALKEYSW))
  );
  assert_eq!(
    ::std::mem::align_of::<tagSERIALKEYSW>(),
    8usize,
    concat!("Alignment of ", stringify!(tagSERIALKEYSW))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<tagSERIALKEYSW>())).cbSize as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(tagSERIALKEYSW),
      "::",
      stringify!(cbSize)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<tagSERIALKEYSW>())).dwFlags as *const _ as usize },
    4usize,
    concat!(
      "Offset of field: ",
      stringify!(tagSERIALKEYSW),
      "::",
      stringify!(dwFlags)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<tagSERIALKEYSW>())).lpszActivePort as *const _ as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(tagSERIALKEYSW),
      "::",
      stringify!(lpszActivePort)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<tagSERIALKEYSW>())).lpszPort as *const _ as usize },
    16usize,
    concat!(
      "Offset of field: ",
      stringify!(tagSERIALKEYSW),
      "::",
      stringify!(lpszPort)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<tagSERIALKEYSW>())).iBaudRate as *const _ as usize },
    24usize,
    concat!(
      "Offset of field: ",
      stringify!(tagSERIALKEYSW),
      "::",
      stringify!(iBaudRate)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<tagSERIALKEYSW>())).iPortState as *const _ as usize },
    28usize,
    concat!(
      "Offset of field: ",
      stringify!(tagSERIALKEYSW),
      "::",
      stringify!(iPortState)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<tagSERIALKEYSW>())).iActive as *const _ as usize },
    32usize,
    concat!(
      "Offset of field: ",
      stringify!(tagSERIALKEYSW),
      "::",
      stringify!(iActive)
    )
  );
}
pub type SERIALKEYSW = tagSERIALKEYSW;
pub type SERIALKEYS = SERIALKEYSW;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tagSTICKYKEYS {
  pub cbSize: UINT,
  pub dwFlags: DWORD,
}
#[test]
fn bindgen_test_layout_tagSTICKYKEYS() {
  assert_eq!(
    ::std::mem::size_of::<tagSTICKYKEYS>(),
    8usize,
    concat!("Size of: ", stringify!(tagSTICKYKEYS))
  );
  assert_eq!(
    ::std::mem::align_of::<tagSTICKYKEYS>(),
    4usize,
    concat!("Alignment of ", stringify!(tagSTICKYKEYS))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<tagSTICKYKEYS>())).cbSize as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(tagSTICKYKEYS),
      "::",
      stringify!(cbSize)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<tagSTICKYKEYS>())).dwFlags as *const _ as usize },
    4usize,
    concat!(
      "Offset of field: ",
      stringify!(tagSTICKYKEYS),
      "::",
      stringify!(dwFlags)
    )
  );
}
pub type STICKYKEYS = tagSTICKYKEYS;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tagSOUNDSENTRYA {
  pub cbSize: UINT,
  pub dwFlags: DWORD,
  pub iFSTextEffect: DWORD,
  pub iFSTextEffectMSec: DWORD,
  pub iFSTextEffectColorBits: DWORD,
  pub iFSGrafEffect: DWORD,
  pub iFSGrafEffectMSec: DWORD,
  pub iFSGrafEffectColor: DWORD,
  pub iWindowsEffect: DWORD,
  pub iWindowsEffectMSec: DWORD,
  pub lpszWindowsEffectDLL: LPSTR,
  pub iWindowsEffectOrdinal: DWORD,
}
#[test]
fn bindgen_test_layout_tagSOUNDSENTRYA() {
  assert_eq!(
    ::std::mem::size_of::<tagSOUNDSENTRYA>(),
    56usize,
    concat!("Size of: ", stringify!(tagSOUNDSENTRYA))
  );
  assert_eq!(
    ::std::mem::align_of::<tagSOUNDSENTRYA>(),
    8usize,
    concat!("Alignment of ", stringify!(tagSOUNDSENTRYA))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<tagSOUNDSENTRYA>())).cbSize as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(tagSOUNDSENTRYA),
      "::",
      stringify!(cbSize)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<tagSOUNDSENTRYA>())).dwFlags as *const _ as usize },
    4usize,
    concat!(
      "Offset of field: ",
      stringify!(tagSOUNDSENTRYA),
      "::",
      stringify!(dwFlags)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<tagSOUNDSENTRYA>())).iFSTextEffect as *const _ as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(tagSOUNDSENTRYA),
      "::",
      stringify!(iFSTextEffect)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<tagSOUNDSENTRYA>())).iFSTextEffectMSec as *const _ as usize },
    12usize,
    concat!(
      "Offset of field: ",
      stringify!(tagSOUNDSENTRYA),
      "::",
      stringify!(iFSTextEffectMSec)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<tagSOUNDSENTRYA>())).iFSTextEffectColorBits as *const _ as usize
    },
    16usize,
    concat!(
      "Offset of field: ",
      stringify!(tagSOUNDSENTRYA),
      "::",
      stringify!(iFSTextEffectColorBits)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<tagSOUNDSENTRYA>())).iFSGrafEffect as *const _ as usize },
    20usize,
    concat!(
      "Offset of field: ",
      stringify!(tagSOUNDSENTRYA),
      "::",
      stringify!(iFSGrafEffect)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<tagSOUNDSENTRYA>())).iFSGrafEffectMSec as *const _ as usize },
    24usize,
    concat!(
      "Offset of field: ",
      stringify!(tagSOUNDSENTRYA),
      "::",
      stringify!(iFSGrafEffectMSec)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<tagSOUNDSENTRYA>())).iFSGrafEffectColor as *const _ as usize },
    28usize,
    concat!(
      "Offset of field: ",
      stringify!(tagSOUNDSENTRYA),
      "::",
      stringify!(iFSGrafEffectColor)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<tagSOUNDSENTRYA>())).iWindowsEffect as *const _ as usize },
    32usize,
    concat!(
      "Offset of field: ",
      stringify!(tagSOUNDSENTRYA),
      "::",
      stringify!(iWindowsEffect)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<tagSOUNDSENTRYA>())).iWindowsEffectMSec as *const _ as usize },
    36usize,
    concat!(
      "Offset of field: ",
      stringify!(tagSOUNDSENTRYA),
      "::",
      stringify!(iWindowsEffectMSec)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<tagSOUNDSENTRYA>())).lpszWindowsEffectDLL as *const _ as usize
    },
    40usize,
    concat!(
      "Offset of field: ",
      stringify!(tagSOUNDSENTRYA),
      "::",
      stringify!(lpszWindowsEffectDLL)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<tagSOUNDSENTRYA>())).iWindowsEffectOrdinal as *const _ as usize
    },
    48usize,
    concat!(
      "Offset of field: ",
      stringify!(tagSOUNDSENTRYA),
      "::",
      stringify!(iWindowsEffectOrdinal)
    )
  );
}
pub type SOUNDSENTRYA = tagSOUNDSENTRYA;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tagSOUNDSENTRYW {
  pub cbSize: UINT,
  pub dwFlags: DWORD,
  pub iFSTextEffect: DWORD,
  pub iFSTextEffectMSec: DWORD,
  pub iFSTextEffectColorBits: DWORD,
  pub iFSGrafEffect: DWORD,
  pub iFSGrafEffectMSec: DWORD,
  pub iFSGrafEffectColor: DWORD,
  pub iWindowsEffect: DWORD,
  pub iWindowsEffectMSec: DWORD,
  pub lpszWindowsEffectDLL: LPWSTR,
  pub iWindowsEffectOrdinal: DWORD,
}
#[test]
fn bindgen_test_layout_tagSOUNDSENTRYW() {
  assert_eq!(
    ::std::mem::size_of::<tagSOUNDSENTRYW>(),
    56usize,
    concat!("Size of: ", stringify!(tagSOUNDSENTRYW))
  );
  assert_eq!(
    ::std::mem::align_of::<tagSOUNDSENTRYW>(),
    8usize,
    concat!("Alignment of ", stringify!(tagSOUNDSENTRYW))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<tagSOUNDSENTRYW>())).cbSize as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(tagSOUNDSENTRYW),
      "::",
      stringify!(cbSize)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<tagSOUNDSENTRYW>())).dwFlags as *const _ as usize },
    4usize,
    concat!(
      "Offset of field: ",
      stringify!(tagSOUNDSENTRYW),
      "::",
      stringify!(dwFlags)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<tagSOUNDSENTRYW>())).iFSTextEffect as *const _ as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(tagSOUNDSENTRYW),
      "::",
      stringify!(iFSTextEffect)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<tagSOUNDSENTRYW>())).iFSTextEffectMSec as *const _ as usize },
    12usize,
    concat!(
      "Offset of field: ",
      stringify!(tagSOUNDSENTRYW),
      "::",
      stringify!(iFSTextEffectMSec)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<tagSOUNDSENTRYW>())).iFSTextEffectColorBits as *const _ as usize
    },
    16usize,
    concat!(
      "Offset of field: ",
      stringify!(tagSOUNDSENTRYW),
      "::",
      stringify!(iFSTextEffectColorBits)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<tagSOUNDSENTRYW>())).iFSGrafEffect as *const _ as usize },
    20usize,
    concat!(
      "Offset of field: ",
      stringify!(tagSOUNDSENTRYW),
      "::",
      stringify!(iFSGrafEffect)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<tagSOUNDSENTRYW>())).iFSGrafEffectMSec as *const _ as usize },
    24usize,
    concat!(
      "Offset of field: ",
      stringify!(tagSOUNDSENTRYW),
      "::",
      stringify!(iFSGrafEffectMSec)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<tagSOUNDSENTRYW>())).iFSGrafEffectColor as *const _ as usize },
    28usize,
    concat!(
      "Offset of field: ",
      stringify!(tagSOUNDSENTRYW),
      "::",
      stringify!(iFSGrafEffectColor)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<tagSOUNDSENTRYW>())).iWindowsEffect as *const _ as usize },
    32usize,
    concat!(
      "Offset of field: ",
      stringify!(tagSOUNDSENTRYW),
      "::",
      stringify!(iWindowsEffect)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<tagSOUNDSENTRYW>())).iWindowsEffectMSec as *const _ as usize },
    36usize,
    concat!(
      "Offset of field: ",
      stringify!(tagSOUNDSENTRYW),
      "::",
      stringify!(iWindowsEffectMSec)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<tagSOUNDSENTRYW>())).lpszWindowsEffectDLL as *const _ as usize
    },
    40usize,
    concat!(
      "Offset of field: ",
      stringify!(tagSOUNDSENTRYW),
      "::",
      stringify!(lpszWindowsEffectDLL)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<tagSOUNDSENTRYW>())).iWindowsEffectOrdinal as *const _ as usize
    },
    48usize,
    concat!(
      "Offset of field: ",
      stringify!(tagSOUNDSENTRYW),
      "::",
      stringify!(iWindowsEffectOrdinal)
    )
  );
}
pub type SOUNDSENTRYW = tagSOUNDSENTRYW;
pub type SOUNDSENTRY = SOUNDSENTRYW;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tagSCROLLBARINFO {
  pub cbSize: DWORD,
  pub rcScrollBar: RECT,
  pub dxyLineButton: ::std::os::raw::c_int,
  pub xyThumbTop: ::std::os::raw::c_int,
  pub xyThumbBottom: ::std::os::raw::c_int,
  pub reserved: ::std::os::raw::c_int,
  pub rgstate: [DWORD; 6usize],
}
#[test]
fn bindgen_test_layout_tagSCROLLBARINFO() {
  assert_eq!(
    ::std::mem::size_of::<tagSCROLLBARINFO>(),
    60usize,
    concat!("Size of: ", stringify!(tagSCROLLBARINFO))
  );
  assert_eq!(
    ::std::mem::align_of::<tagSCROLLBARINFO>(),
    4usize,
    concat!("Alignment of ", stringify!(tagSCROLLBARINFO))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<tagSCROLLBARINFO>())).cbSize as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(tagSCROLLBARINFO),
      "::",
      stringify!(cbSize)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<tagSCROLLBARINFO>())).rcScrollBar as *const _ as usize },
    4usize,
    concat!(
      "Offset of field: ",
      stringify!(tagSCROLLBARINFO),
      "::",
      stringify!(rcScrollBar)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<tagSCROLLBARINFO>())).dxyLineButton as *const _ as usize },
    20usize,
    concat!(
      "Offset of field: ",
      stringify!(tagSCROLLBARINFO),
      "::",
      stringify!(dxyLineButton)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<tagSCROLLBARINFO>())).xyThumbTop as *const _ as usize },
    24usize,
    concat!(
      "Offset of field: ",
      stringify!(tagSCROLLBARINFO),
      "::",
      stringify!(xyThumbTop)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<tagSCROLLBARINFO>())).xyThumbBottom as *const _ as usize },
    28usize,
    concat!(
      "Offset of field: ",
      stringify!(tagSCROLLBARINFO),
      "::",
      stringify!(xyThumbBottom)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<tagSCROLLBARINFO>())).reserved as *const _ as usize },
    32usize,
    concat!(
      "Offset of field: ",
      stringify!(tagSCROLLBARINFO),
      "::",
      stringify!(reserved)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<tagSCROLLBARINFO>())).rgstate as *const _ as usize },
    36usize,
    concat!(
      "Offset of field: ",
      stringify!(tagSCROLLBARINFO),
      "::",
      stringify!(rgstate)
    )
  );
}
pub type SCROLLBARINFO = tagSCROLLBARINFO;
pub const SYSNLS_FUNCTION_COMPARE_STRING: SYSNLS_FUNCTION = 1;
pub type SYSNLS_FUNCTION = ::std::os::raw::c_int;
pub const SYSGEOTYPE_GEO_NATION: SYSGEOTYPE = 1;
pub const SYSGEOTYPE_GEO_LATITUDE: SYSGEOTYPE = 2;
pub const SYSGEOTYPE_GEO_LONGITUDE: SYSGEOTYPE = 3;
pub const SYSGEOTYPE_GEO_ISO2: SYSGEOTYPE = 4;
pub const SYSGEOTYPE_GEO_ISO3: SYSGEOTYPE = 5;
pub const SYSGEOTYPE_GEO_RFC1766: SYSGEOTYPE = 6;
pub const SYSGEOTYPE_GEO_LCID: SYSGEOTYPE = 7;
pub const SYSGEOTYPE_GEO_FRIENDLYNAME: SYSGEOTYPE = 8;
pub const SYSGEOTYPE_GEO_OFFICIALNAME: SYSGEOTYPE = 9;
pub const SYSGEOTYPE_GEO_TIMEZONES: SYSGEOTYPE = 10;
pub const SYSGEOTYPE_GEO_OFFICIALLANGUAGES: SYSGEOTYPE = 11;
pub const SYSGEOTYPE_GEO_ISO_UN_NUMBER: SYSGEOTYPE = 12;
pub const SYSGEOTYPE_GEO_PARENT: SYSGEOTYPE = 13;
pub const SYSGEOTYPE_GEO_DIALINGCODE: SYSGEOTYPE = 14;
pub const SYSGEOTYPE_GEO_CURRENCYCODE: SYSGEOTYPE = 15;
pub const SYSGEOTYPE_GEO_CURRENCYSYMBOL: SYSGEOTYPE = 16;
pub const SYSGEOTYPE_GEO_NAME: SYSGEOTYPE = 17;
pub const SYSGEOTYPE_GEO_ID: SYSGEOTYPE = 18;
pub type SYSGEOTYPE = ::std::os::raw::c_int;
pub const SYSGEOCLASS_GEOCLASS_NATION: SYSGEOCLASS = 16;
pub const SYSGEOCLASS_GEOCLASS_REGION: SYSGEOCLASS = 14;
pub const SYSGEOCLASS_GEOCLASS_ALL: SYSGEOCLASS = 0;
pub type SYSGEOCLASS = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SMALL_RECT {
  pub Left: SHORT,
  pub Top: SHORT,
  pub Right: SHORT,
  pub Bottom: SHORT,
}
#[test]
fn bindgen_test_layout__SMALL_RECT() {
  assert_eq!(
    ::std::mem::size_of::<_SMALL_RECT>(),
    8usize,
    concat!("Size of: ", stringify!(_SMALL_RECT))
  );
  assert_eq!(
    ::std::mem::align_of::<_SMALL_RECT>(),
    2usize,
    concat!("Alignment of ", stringify!(_SMALL_RECT))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SMALL_RECT>())).Left as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_SMALL_RECT),
      "::",
      stringify!(Left)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SMALL_RECT>())).Top as *const _ as usize },
    2usize,
    concat!(
      "Offset of field: ",
      stringify!(_SMALL_RECT),
      "::",
      stringify!(Top)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SMALL_RECT>())).Right as *const _ as usize },
    4usize,
    concat!(
      "Offset of field: ",
      stringify!(_SMALL_RECT),
      "::",
      stringify!(Right)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SMALL_RECT>())).Bottom as *const _ as usize },
    6usize,
    concat!(
      "Offset of field: ",
      stringify!(_SMALL_RECT),
      "::",
      stringify!(Bottom)
    )
  );
}
pub type SMALL_RECT = _SMALL_RECT;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SESSION_HEADER {
  pub sess_name: UCHAR,
  pub num_sess: UCHAR,
  pub rcv_dg_outstanding: UCHAR,
  pub rcv_any_outstanding: UCHAR,
}
#[test]
fn bindgen_test_layout__SESSION_HEADER() {
  assert_eq!(
    ::std::mem::size_of::<_SESSION_HEADER>(),
    4usize,
    concat!("Size of: ", stringify!(_SESSION_HEADER))
  );
  assert_eq!(
    ::std::mem::align_of::<_SESSION_HEADER>(),
    1usize,
    concat!("Alignment of ", stringify!(_SESSION_HEADER))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SESSION_HEADER>())).sess_name as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_SESSION_HEADER),
      "::",
      stringify!(sess_name)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SESSION_HEADER>())).num_sess as *const _ as usize },
    1usize,
    concat!(
      "Offset of field: ",
      stringify!(_SESSION_HEADER),
      "::",
      stringify!(num_sess)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SESSION_HEADER>())).rcv_dg_outstanding as *const _ as usize },
    2usize,
    concat!(
      "Offset of field: ",
      stringify!(_SESSION_HEADER),
      "::",
      stringify!(rcv_dg_outstanding)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SESSION_HEADER>())).rcv_any_outstanding as *const _ as usize },
    3usize,
    concat!(
      "Offset of field: ",
      stringify!(_SESSION_HEADER),
      "::",
      stringify!(rcv_any_outstanding)
    )
  );
}
pub type SESSION_HEADER = _SESSION_HEADER;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SESSION_BUFFER {
  pub lsn: UCHAR,
  pub state: UCHAR,
  pub local_name: [UCHAR; 16usize],
  pub remote_name: [UCHAR; 16usize],
  pub rcvs_outstanding: UCHAR,
  pub sends_outstanding: UCHAR,
}
#[test]
fn bindgen_test_layout__SESSION_BUFFER() {
  assert_eq!(
    ::std::mem::size_of::<_SESSION_BUFFER>(),
    36usize,
    concat!("Size of: ", stringify!(_SESSION_BUFFER))
  );
  assert_eq!(
    ::std::mem::align_of::<_SESSION_BUFFER>(),
    1usize,
    concat!("Alignment of ", stringify!(_SESSION_BUFFER))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SESSION_BUFFER>())).lsn as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_SESSION_BUFFER),
      "::",
      stringify!(lsn)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SESSION_BUFFER>())).state as *const _ as usize },
    1usize,
    concat!(
      "Offset of field: ",
      stringify!(_SESSION_BUFFER),
      "::",
      stringify!(state)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SESSION_BUFFER>())).local_name as *const _ as usize },
    2usize,
    concat!(
      "Offset of field: ",
      stringify!(_SESSION_BUFFER),
      "::",
      stringify!(local_name)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SESSION_BUFFER>())).remote_name as *const _ as usize },
    18usize,
    concat!(
      "Offset of field: ",
      stringify!(_SESSION_BUFFER),
      "::",
      stringify!(remote_name)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SESSION_BUFFER>())).rcvs_outstanding as *const _ as usize },
    34usize,
    concat!(
      "Offset of field: ",
      stringify!(_SESSION_BUFFER),
      "::",
      stringify!(rcvs_outstanding)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SESSION_BUFFER>())).sends_outstanding as *const _ as usize },
    35usize,
    concat!(
      "Offset of field: ",
      stringify!(_SESSION_BUFFER),
      "::",
      stringify!(sends_outstanding)
    )
  );
}
pub type SESSION_BUFFER = _SESSION_BUFFER;
pub type I_RPC_HANDLE = *mut ::std::os::raw::c_void;
pub type RPC_BINDING_HANDLE = I_RPC_HANDLE;
pub type handle_t = RPC_BINDING_HANDLE;
pub type UUID = GUID;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SEC_WINNT_AUTH_IDENTITY_W {
  pub User: *mut ::std::os::raw::c_ushort,
  pub UserLength: ::std::os::raw::c_ulong,
  pub Domain: *mut ::std::os::raw::c_ushort,
  pub DomainLength: ::std::os::raw::c_ulong,
  pub Password: *mut ::std::os::raw::c_ushort,
  pub PasswordLength: ::std::os::raw::c_ulong,
  pub Flags: ::std::os::raw::c_ulong,
}
#[test]
fn bindgen_test_layout__SEC_WINNT_AUTH_IDENTITY_W() {
  assert_eq!(
    ::std::mem::size_of::<_SEC_WINNT_AUTH_IDENTITY_W>(),
    48usize,
    concat!("Size of: ", stringify!(_SEC_WINNT_AUTH_IDENTITY_W))
  );
  assert_eq!(
    ::std::mem::align_of::<_SEC_WINNT_AUTH_IDENTITY_W>(),
    8usize,
    concat!("Alignment of ", stringify!(_SEC_WINNT_AUTH_IDENTITY_W))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SEC_WINNT_AUTH_IDENTITY_W>())).User as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_SEC_WINNT_AUTH_IDENTITY_W),
      "::",
      stringify!(User)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_SEC_WINNT_AUTH_IDENTITY_W>())).UserLength as *const _ as usize
    },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_SEC_WINNT_AUTH_IDENTITY_W),
      "::",
      stringify!(UserLength)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SEC_WINNT_AUTH_IDENTITY_W>())).Domain as *const _ as usize },
    16usize,
    concat!(
      "Offset of field: ",
      stringify!(_SEC_WINNT_AUTH_IDENTITY_W),
      "::",
      stringify!(Domain)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_SEC_WINNT_AUTH_IDENTITY_W>())).DomainLength as *const _ as usize
    },
    24usize,
    concat!(
      "Offset of field: ",
      stringify!(_SEC_WINNT_AUTH_IDENTITY_W),
      "::",
      stringify!(DomainLength)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SEC_WINNT_AUTH_IDENTITY_W>())).Password as *const _ as usize },
    32usize,
    concat!(
      "Offset of field: ",
      stringify!(_SEC_WINNT_AUTH_IDENTITY_W),
      "::",
      stringify!(Password)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_SEC_WINNT_AUTH_IDENTITY_W>())).PasswordLength as *const _ as usize
    },
    40usize,
    concat!(
      "Offset of field: ",
      stringify!(_SEC_WINNT_AUTH_IDENTITY_W),
      "::",
      stringify!(PasswordLength)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SEC_WINNT_AUTH_IDENTITY_W>())).Flags as *const _ as usize },
    44usize,
    concat!(
      "Offset of field: ",
      stringify!(_SEC_WINNT_AUTH_IDENTITY_W),
      "::",
      stringify!(Flags)
    )
  );
}
pub type SEC_WINNT_AUTH_IDENTITY_W = _SEC_WINNT_AUTH_IDENTITY_W;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SEC_WINNT_AUTH_IDENTITY_A {
  pub User: *mut ::std::os::raw::c_uchar,
  pub UserLength: ::std::os::raw::c_ulong,
  pub Domain: *mut ::std::os::raw::c_uchar,
  pub DomainLength: ::std::os::raw::c_ulong,
  pub Password: *mut ::std::os::raw::c_uchar,
  pub PasswordLength: ::std::os::raw::c_ulong,
  pub Flags: ::std::os::raw::c_ulong,
}
#[test]
fn bindgen_test_layout__SEC_WINNT_AUTH_IDENTITY_A() {
  assert_eq!(
    ::std::mem::size_of::<_SEC_WINNT_AUTH_IDENTITY_A>(),
    48usize,
    concat!("Size of: ", stringify!(_SEC_WINNT_AUTH_IDENTITY_A))
  );
  assert_eq!(
    ::std::mem::align_of::<_SEC_WINNT_AUTH_IDENTITY_A>(),
    8usize,
    concat!("Alignment of ", stringify!(_SEC_WINNT_AUTH_IDENTITY_A))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SEC_WINNT_AUTH_IDENTITY_A>())).User as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_SEC_WINNT_AUTH_IDENTITY_A),
      "::",
      stringify!(User)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_SEC_WINNT_AUTH_IDENTITY_A>())).UserLength as *const _ as usize
    },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_SEC_WINNT_AUTH_IDENTITY_A),
      "::",
      stringify!(UserLength)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SEC_WINNT_AUTH_IDENTITY_A>())).Domain as *const _ as usize },
    16usize,
    concat!(
      "Offset of field: ",
      stringify!(_SEC_WINNT_AUTH_IDENTITY_A),
      "::",
      stringify!(Domain)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_SEC_WINNT_AUTH_IDENTITY_A>())).DomainLength as *const _ as usize
    },
    24usize,
    concat!(
      "Offset of field: ",
      stringify!(_SEC_WINNT_AUTH_IDENTITY_A),
      "::",
      stringify!(DomainLength)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SEC_WINNT_AUTH_IDENTITY_A>())).Password as *const _ as usize },
    32usize,
    concat!(
      "Offset of field: ",
      stringify!(_SEC_WINNT_AUTH_IDENTITY_A),
      "::",
      stringify!(Password)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_SEC_WINNT_AUTH_IDENTITY_A>())).PasswordLength as *const _ as usize
    },
    40usize,
    concat!(
      "Offset of field: ",
      stringify!(_SEC_WINNT_AUTH_IDENTITY_A),
      "::",
      stringify!(PasswordLength)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SEC_WINNT_AUTH_IDENTITY_A>())).Flags as *const _ as usize },
    44usize,
    concat!(
      "Offset of field: ",
      stringify!(_SEC_WINNT_AUTH_IDENTITY_A),
      "::",
      stringify!(Flags)
    )
  );
}
pub type SEC_WINNT_AUTH_IDENTITY_A = _SEC_WINNT_AUTH_IDENTITY_A;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _RPC_VERSION {
  pub MajorVersion: ::std::os::raw::c_ushort,
  pub MinorVersion: ::std::os::raw::c_ushort,
}
#[test]
fn bindgen_test_layout__RPC_VERSION() {
  assert_eq!(
    ::std::mem::size_of::<_RPC_VERSION>(),
    4usize,
    concat!("Size of: ", stringify!(_RPC_VERSION))
  );
  assert_eq!(
    ::std::mem::align_of::<_RPC_VERSION>(),
    2usize,
    concat!("Alignment of ", stringify!(_RPC_VERSION))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_RPC_VERSION>())).MajorVersion as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_RPC_VERSION),
      "::",
      stringify!(MajorVersion)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_RPC_VERSION>())).MinorVersion as *const _ as usize },
    2usize,
    concat!(
      "Offset of field: ",
      stringify!(_RPC_VERSION),
      "::",
      stringify!(MinorVersion)
    )
  );
}
pub type RPC_VERSION = _RPC_VERSION;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _RPC_SYNTAX_IDENTIFIER {
  pub SyntaxGUID: GUID,
  pub SyntaxVersion: RPC_VERSION,
}
#[test]
fn bindgen_test_layout__RPC_SYNTAX_IDENTIFIER() {
  assert_eq!(
    ::std::mem::size_of::<_RPC_SYNTAX_IDENTIFIER>(),
    20usize,
    concat!("Size of: ", stringify!(_RPC_SYNTAX_IDENTIFIER))
  );
  assert_eq!(
    ::std::mem::align_of::<_RPC_SYNTAX_IDENTIFIER>(),
    4usize,
    concat!("Alignment of ", stringify!(_RPC_SYNTAX_IDENTIFIER))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_RPC_SYNTAX_IDENTIFIER>())).SyntaxGUID as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_RPC_SYNTAX_IDENTIFIER),
      "::",
      stringify!(SyntaxGUID)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_RPC_SYNTAX_IDENTIFIER>())).SyntaxVersion as *const _ as usize
    },
    16usize,
    concat!(
      "Offset of field: ",
      stringify!(_RPC_SYNTAX_IDENTIFIER),
      "::",
      stringify!(SyntaxVersion)
    )
  );
}
pub type PRPC_SYNTAX_IDENTIFIER = *mut _RPC_SYNTAX_IDENTIFIER;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _RPC_MESSAGE {
  pub Handle: RPC_BINDING_HANDLE,
  pub DataRepresentation: ::std::os::raw::c_ulong,
  pub Buffer: *mut ::std::os::raw::c_void,
  pub BufferLength: ::std::os::raw::c_uint,
  pub ProcNum: ::std::os::raw::c_uint,
  pub TransferSyntax: PRPC_SYNTAX_IDENTIFIER,
  pub RpcInterfaceInformation: *mut ::std::os::raw::c_void,
  pub ReservedForRuntime: *mut ::std::os::raw::c_void,
  pub ManagerEpv: *mut ::std::os::raw::c_void,
  pub ImportContext: *mut ::std::os::raw::c_void,
  pub RpcFlags: ::std::os::raw::c_ulong,
}
#[test]
fn bindgen_test_layout__RPC_MESSAGE() {
  assert_eq!(
    ::std::mem::size_of::<_RPC_MESSAGE>(),
    80usize,
    concat!("Size of: ", stringify!(_RPC_MESSAGE))
  );
  assert_eq!(
    ::std::mem::align_of::<_RPC_MESSAGE>(),
    8usize,
    concat!("Alignment of ", stringify!(_RPC_MESSAGE))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_RPC_MESSAGE>())).Handle as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_RPC_MESSAGE),
      "::",
      stringify!(Handle)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_RPC_MESSAGE>())).DataRepresentation as *const _ as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_RPC_MESSAGE),
      "::",
      stringify!(DataRepresentation)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_RPC_MESSAGE>())).Buffer as *const _ as usize },
    16usize,
    concat!(
      "Offset of field: ",
      stringify!(_RPC_MESSAGE),
      "::",
      stringify!(Buffer)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_RPC_MESSAGE>())).BufferLength as *const _ as usize },
    24usize,
    concat!(
      "Offset of field: ",
      stringify!(_RPC_MESSAGE),
      "::",
      stringify!(BufferLength)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_RPC_MESSAGE>())).ProcNum as *const _ as usize },
    28usize,
    concat!(
      "Offset of field: ",
      stringify!(_RPC_MESSAGE),
      "::",
      stringify!(ProcNum)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_RPC_MESSAGE>())).TransferSyntax as *const _ as usize },
    32usize,
    concat!(
      "Offset of field: ",
      stringify!(_RPC_MESSAGE),
      "::",
      stringify!(TransferSyntax)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_RPC_MESSAGE>())).RpcInterfaceInformation as *const _ as usize
    },
    40usize,
    concat!(
      "Offset of field: ",
      stringify!(_RPC_MESSAGE),
      "::",
      stringify!(RpcInterfaceInformation)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_RPC_MESSAGE>())).ReservedForRuntime as *const _ as usize },
    48usize,
    concat!(
      "Offset of field: ",
      stringify!(_RPC_MESSAGE),
      "::",
      stringify!(ReservedForRuntime)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_RPC_MESSAGE>())).ManagerEpv as *const _ as usize },
    56usize,
    concat!(
      "Offset of field: ",
      stringify!(_RPC_MESSAGE),
      "::",
      stringify!(ManagerEpv)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_RPC_MESSAGE>())).ImportContext as *const _ as usize },
    64usize,
    concat!(
      "Offset of field: ",
      stringify!(_RPC_MESSAGE),
      "::",
      stringify!(ImportContext)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_RPC_MESSAGE>())).RpcFlags as *const _ as usize },
    72usize,
    concat!(
      "Offset of field: ",
      stringify!(_RPC_MESSAGE),
      "::",
      stringify!(RpcFlags)
    )
  );
}
pub type PRPC_MESSAGE = *mut _RPC_MESSAGE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _AppBarData {
  pub cbSize: DWORD,
  pub hWnd: HWND,
  pub uCallbackMessage: UINT,
  pub uEdge: UINT,
  pub rc: RECT,
  pub lParam: LPARAM,
}
#[test]
fn bindgen_test_layout__AppBarData() {
  assert_eq!(
    ::std::mem::size_of::<_AppBarData>(),
    48usize,
    concat!("Size of: ", stringify!(_AppBarData))
  );
  assert_eq!(
    ::std::mem::align_of::<_AppBarData>(),
    8usize,
    concat!("Alignment of ", stringify!(_AppBarData))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_AppBarData>())).cbSize as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_AppBarData),
      "::",
      stringify!(cbSize)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_AppBarData>())).hWnd as *const _ as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_AppBarData),
      "::",
      stringify!(hWnd)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_AppBarData>())).uCallbackMessage as *const _ as usize },
    16usize,
    concat!(
      "Offset of field: ",
      stringify!(_AppBarData),
      "::",
      stringify!(uCallbackMessage)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_AppBarData>())).uEdge as *const _ as usize },
    20usize,
    concat!(
      "Offset of field: ",
      stringify!(_AppBarData),
      "::",
      stringify!(uEdge)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_AppBarData>())).rc as *const _ as usize },
    24usize,
    concat!(
      "Offset of field: ",
      stringify!(_AppBarData),
      "::",
      stringify!(rc)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_AppBarData>())).lParam as *const _ as usize },
    40usize,
    concat!(
      "Offset of field: ",
      stringify!(_AppBarData),
      "::",
      stringify!(lParam)
    )
  );
}
pub type PAPPBARDATA = *mut _AppBarData;
extern "C" {
  pub fn SHAppBarMessage(dwMessage: DWORD, pData: PAPPBARDATA) -> UINT_PTR;
}
pub type FILEOP_FLAGS = WORD;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SHFILEOPSTRUCTA {
  pub hwnd: HWND,
  pub wFunc: UINT,
  pub pFrom: PCZZSTR,
  pub pTo: PCZZSTR,
  pub fFlags: FILEOP_FLAGS,
  pub fAnyOperationsAborted: BOOL,
  pub hNameMappings: LPVOID,
  pub lpszProgressTitle: PCSTR,
}
#[test]
fn bindgen_test_layout__SHFILEOPSTRUCTA() {
  assert_eq!(
    ::std::mem::size_of::<_SHFILEOPSTRUCTA>(),
    56usize,
    concat!("Size of: ", stringify!(_SHFILEOPSTRUCTA))
  );
  assert_eq!(
    ::std::mem::align_of::<_SHFILEOPSTRUCTA>(),
    8usize,
    concat!("Alignment of ", stringify!(_SHFILEOPSTRUCTA))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SHFILEOPSTRUCTA>())).hwnd as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_SHFILEOPSTRUCTA),
      "::",
      stringify!(hwnd)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SHFILEOPSTRUCTA>())).wFunc as *const _ as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_SHFILEOPSTRUCTA),
      "::",
      stringify!(wFunc)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SHFILEOPSTRUCTA>())).pFrom as *const _ as usize },
    16usize,
    concat!(
      "Offset of field: ",
      stringify!(_SHFILEOPSTRUCTA),
      "::",
      stringify!(pFrom)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SHFILEOPSTRUCTA>())).pTo as *const _ as usize },
    24usize,
    concat!(
      "Offset of field: ",
      stringify!(_SHFILEOPSTRUCTA),
      "::",
      stringify!(pTo)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SHFILEOPSTRUCTA>())).fFlags as *const _ as usize },
    32usize,
    concat!(
      "Offset of field: ",
      stringify!(_SHFILEOPSTRUCTA),
      "::",
      stringify!(fFlags)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_SHFILEOPSTRUCTA>())).fAnyOperationsAborted as *const _ as usize
    },
    36usize,
    concat!(
      "Offset of field: ",
      stringify!(_SHFILEOPSTRUCTA),
      "::",
      stringify!(fAnyOperationsAborted)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SHFILEOPSTRUCTA>())).hNameMappings as *const _ as usize },
    40usize,
    concat!(
      "Offset of field: ",
      stringify!(_SHFILEOPSTRUCTA),
      "::",
      stringify!(hNameMappings)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SHFILEOPSTRUCTA>())).lpszProgressTitle as *const _ as usize },
    48usize,
    concat!(
      "Offset of field: ",
      stringify!(_SHFILEOPSTRUCTA),
      "::",
      stringify!(lpszProgressTitle)
    )
  );
}
pub type SHFILEOPSTRUCTA = _SHFILEOPSTRUCTA;
pub type LPSHFILEOPSTRUCTA = *mut _SHFILEOPSTRUCTA;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SHFILEOPSTRUCTW {
  pub hwnd: HWND,
  pub wFunc: UINT,
  pub pFrom: PCZZWSTR,
  pub pTo: PCZZWSTR,
  pub fFlags: FILEOP_FLAGS,
  pub fAnyOperationsAborted: BOOL,
  pub hNameMappings: LPVOID,
  pub lpszProgressTitle: PCWSTR,
}
#[test]
fn bindgen_test_layout__SHFILEOPSTRUCTW() {
  assert_eq!(
    ::std::mem::size_of::<_SHFILEOPSTRUCTW>(),
    56usize,
    concat!("Size of: ", stringify!(_SHFILEOPSTRUCTW))
  );
  assert_eq!(
    ::std::mem::align_of::<_SHFILEOPSTRUCTW>(),
    8usize,
    concat!("Alignment of ", stringify!(_SHFILEOPSTRUCTW))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SHFILEOPSTRUCTW>())).hwnd as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_SHFILEOPSTRUCTW),
      "::",
      stringify!(hwnd)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SHFILEOPSTRUCTW>())).wFunc as *const _ as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_SHFILEOPSTRUCTW),
      "::",
      stringify!(wFunc)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SHFILEOPSTRUCTW>())).pFrom as *const _ as usize },
    16usize,
    concat!(
      "Offset of field: ",
      stringify!(_SHFILEOPSTRUCTW),
      "::",
      stringify!(pFrom)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SHFILEOPSTRUCTW>())).pTo as *const _ as usize },
    24usize,
    concat!(
      "Offset of field: ",
      stringify!(_SHFILEOPSTRUCTW),
      "::",
      stringify!(pTo)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SHFILEOPSTRUCTW>())).fFlags as *const _ as usize },
    32usize,
    concat!(
      "Offset of field: ",
      stringify!(_SHFILEOPSTRUCTW),
      "::",
      stringify!(fFlags)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_SHFILEOPSTRUCTW>())).fAnyOperationsAborted as *const _ as usize
    },
    36usize,
    concat!(
      "Offset of field: ",
      stringify!(_SHFILEOPSTRUCTW),
      "::",
      stringify!(fAnyOperationsAborted)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SHFILEOPSTRUCTW>())).hNameMappings as *const _ as usize },
    40usize,
    concat!(
      "Offset of field: ",
      stringify!(_SHFILEOPSTRUCTW),
      "::",
      stringify!(hNameMappings)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SHFILEOPSTRUCTW>())).lpszProgressTitle as *const _ as usize },
    48usize,
    concat!(
      "Offset of field: ",
      stringify!(_SHFILEOPSTRUCTW),
      "::",
      stringify!(lpszProgressTitle)
    )
  );
}
pub type SHFILEOPSTRUCTW = _SHFILEOPSTRUCTW;
pub type LPSHFILEOPSTRUCTW = *mut _SHFILEOPSTRUCTW;
pub type SHFILEOPSTRUCT = SHFILEOPSTRUCTW;
extern "C" {
  pub fn SHFileOperationA(lpFileOp: LPSHFILEOPSTRUCTA) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn SHFileOperationW(lpFileOp: LPSHFILEOPSTRUCTW) -> ::std::os::raw::c_int;
}
extern "C" {
  pub fn SHFreeNameMappings(hNameMappings: HANDLE);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SHNAMEMAPPINGA {
  pub pszOldPath: LPSTR,
  pub pszNewPath: LPSTR,
  pub cchOldPath: ::std::os::raw::c_int,
  pub cchNewPath: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout__SHNAMEMAPPINGA() {
  assert_eq!(
    ::std::mem::size_of::<_SHNAMEMAPPINGA>(),
    24usize,
    concat!("Size of: ", stringify!(_SHNAMEMAPPINGA))
  );
  assert_eq!(
    ::std::mem::align_of::<_SHNAMEMAPPINGA>(),
    8usize,
    concat!("Alignment of ", stringify!(_SHNAMEMAPPINGA))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SHNAMEMAPPINGA>())).pszOldPath as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_SHNAMEMAPPINGA),
      "::",
      stringify!(pszOldPath)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SHNAMEMAPPINGA>())).pszNewPath as *const _ as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_SHNAMEMAPPINGA),
      "::",
      stringify!(pszNewPath)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SHNAMEMAPPINGA>())).cchOldPath as *const _ as usize },
    16usize,
    concat!(
      "Offset of field: ",
      stringify!(_SHNAMEMAPPINGA),
      "::",
      stringify!(cchOldPath)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SHNAMEMAPPINGA>())).cchNewPath as *const _ as usize },
    20usize,
    concat!(
      "Offset of field: ",
      stringify!(_SHNAMEMAPPINGA),
      "::",
      stringify!(cchNewPath)
    )
  );
}
pub type SHNAMEMAPPINGA = _SHNAMEMAPPINGA;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SHNAMEMAPPINGW {
  pub pszOldPath: LPWSTR,
  pub pszNewPath: LPWSTR,
  pub cchOldPath: ::std::os::raw::c_int,
  pub cchNewPath: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout__SHNAMEMAPPINGW() {
  assert_eq!(
    ::std::mem::size_of::<_SHNAMEMAPPINGW>(),
    24usize,
    concat!("Size of: ", stringify!(_SHNAMEMAPPINGW))
  );
  assert_eq!(
    ::std::mem::align_of::<_SHNAMEMAPPINGW>(),
    8usize,
    concat!("Alignment of ", stringify!(_SHNAMEMAPPINGW))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SHNAMEMAPPINGW>())).pszOldPath as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_SHNAMEMAPPINGW),
      "::",
      stringify!(pszOldPath)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SHNAMEMAPPINGW>())).pszNewPath as *const _ as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_SHNAMEMAPPINGW),
      "::",
      stringify!(pszNewPath)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SHNAMEMAPPINGW>())).cchOldPath as *const _ as usize },
    16usize,
    concat!(
      "Offset of field: ",
      stringify!(_SHNAMEMAPPINGW),
      "::",
      stringify!(cchOldPath)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SHNAMEMAPPINGW>())).cchNewPath as *const _ as usize },
    20usize,
    concat!(
      "Offset of field: ",
      stringify!(_SHNAMEMAPPINGW),
      "::",
      stringify!(cchNewPath)
    )
  );
}
pub type SHNAMEMAPPINGW = _SHNAMEMAPPINGW;
pub type SHNAMEMAPPING = SHNAMEMAPPINGW;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _SHELLEXECUTEINFOA {
  pub cbSize: DWORD,
  pub fMask: ULONG,
  pub hwnd: HWND,
  pub lpVerb: LPCSTR,
  pub lpFile: LPCSTR,
  pub lpParameters: LPCSTR,
  pub lpDirectory: LPCSTR,
  pub nShow: ::std::os::raw::c_int,
  pub hInstApp: HINSTANCE,
  pub lpIDList: *mut ::std::os::raw::c_void,
  pub lpClass: LPCSTR,
  pub hkeyClass: HKEY,
  pub dwHotKey: DWORD,
  pub __bindgen_anon_1: _SHELLEXECUTEINFOA__bindgen_ty_1,
  pub hProcess: HANDLE,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _SHELLEXECUTEINFOA__bindgen_ty_1 {
  pub hIcon: HANDLE,
  pub hMonitor: HANDLE,
  _bindgen_union_align: u64,
}
#[test]
fn bindgen_test_layout__SHELLEXECUTEINFOA__bindgen_ty_1() {
  assert_eq!(
    ::std::mem::size_of::<_SHELLEXECUTEINFOA__bindgen_ty_1>(),
    8usize,
    concat!("Size of: ", stringify!(_SHELLEXECUTEINFOA__bindgen_ty_1))
  );
  assert_eq!(
    ::std::mem::align_of::<_SHELLEXECUTEINFOA__bindgen_ty_1>(),
    8usize,
    concat!(
      "Alignment of ",
      stringify!(_SHELLEXECUTEINFOA__bindgen_ty_1)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_SHELLEXECUTEINFOA__bindgen_ty_1>())).hIcon as *const _ as usize
    },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_SHELLEXECUTEINFOA__bindgen_ty_1),
      "::",
      stringify!(hIcon)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_SHELLEXECUTEINFOA__bindgen_ty_1>())).hMonitor as *const _ as usize
    },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_SHELLEXECUTEINFOA__bindgen_ty_1),
      "::",
      stringify!(hMonitor)
    )
  );
}
#[test]
fn bindgen_test_layout__SHELLEXECUTEINFOA() {
  assert_eq!(
    ::std::mem::size_of::<_SHELLEXECUTEINFOA>(),
    112usize,
    concat!("Size of: ", stringify!(_SHELLEXECUTEINFOA))
  );
  assert_eq!(
    ::std::mem::align_of::<_SHELLEXECUTEINFOA>(),
    8usize,
    concat!("Alignment of ", stringify!(_SHELLEXECUTEINFOA))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SHELLEXECUTEINFOA>())).cbSize as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_SHELLEXECUTEINFOA),
      "::",
      stringify!(cbSize)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SHELLEXECUTEINFOA>())).fMask as *const _ as usize },
    4usize,
    concat!(
      "Offset of field: ",
      stringify!(_SHELLEXECUTEINFOA),
      "::",
      stringify!(fMask)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SHELLEXECUTEINFOA>())).hwnd as *const _ as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_SHELLEXECUTEINFOA),
      "::",
      stringify!(hwnd)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SHELLEXECUTEINFOA>())).lpVerb as *const _ as usize },
    16usize,
    concat!(
      "Offset of field: ",
      stringify!(_SHELLEXECUTEINFOA),
      "::",
      stringify!(lpVerb)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SHELLEXECUTEINFOA>())).lpFile as *const _ as usize },
    24usize,
    concat!(
      "Offset of field: ",
      stringify!(_SHELLEXECUTEINFOA),
      "::",
      stringify!(lpFile)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SHELLEXECUTEINFOA>())).lpParameters as *const _ as usize },
    32usize,
    concat!(
      "Offset of field: ",
      stringify!(_SHELLEXECUTEINFOA),
      "::",
      stringify!(lpParameters)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SHELLEXECUTEINFOA>())).lpDirectory as *const _ as usize },
    40usize,
    concat!(
      "Offset of field: ",
      stringify!(_SHELLEXECUTEINFOA),
      "::",
      stringify!(lpDirectory)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SHELLEXECUTEINFOA>())).nShow as *const _ as usize },
    48usize,
    concat!(
      "Offset of field: ",
      stringify!(_SHELLEXECUTEINFOA),
      "::",
      stringify!(nShow)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SHELLEXECUTEINFOA>())).hInstApp as *const _ as usize },
    56usize,
    concat!(
      "Offset of field: ",
      stringify!(_SHELLEXECUTEINFOA),
      "::",
      stringify!(hInstApp)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SHELLEXECUTEINFOA>())).lpIDList as *const _ as usize },
    64usize,
    concat!(
      "Offset of field: ",
      stringify!(_SHELLEXECUTEINFOA),
      "::",
      stringify!(lpIDList)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SHELLEXECUTEINFOA>())).lpClass as *const _ as usize },
    72usize,
    concat!(
      "Offset of field: ",
      stringify!(_SHELLEXECUTEINFOA),
      "::",
      stringify!(lpClass)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SHELLEXECUTEINFOA>())).hkeyClass as *const _ as usize },
    80usize,
    concat!(
      "Offset of field: ",
      stringify!(_SHELLEXECUTEINFOA),
      "::",
      stringify!(hkeyClass)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SHELLEXECUTEINFOA>())).dwHotKey as *const _ as usize },
    88usize,
    concat!(
      "Offset of field: ",
      stringify!(_SHELLEXECUTEINFOA),
      "::",
      stringify!(dwHotKey)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SHELLEXECUTEINFOA>())).hProcess as *const _ as usize },
    104usize,
    concat!(
      "Offset of field: ",
      stringify!(_SHELLEXECUTEINFOA),
      "::",
      stringify!(hProcess)
    )
  );
}
pub type SHELLEXECUTEINFOA = _SHELLEXECUTEINFOA;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _SHELLEXECUTEINFOW {
  pub cbSize: DWORD,
  pub fMask: ULONG,
  pub hwnd: HWND,
  pub lpVerb: LPCWSTR,
  pub lpFile: LPCWSTR,
  pub lpParameters: LPCWSTR,
  pub lpDirectory: LPCWSTR,
  pub nShow: ::std::os::raw::c_int,
  pub hInstApp: HINSTANCE,
  pub lpIDList: *mut ::std::os::raw::c_void,
  pub lpClass: LPCWSTR,
  pub hkeyClass: HKEY,
  pub dwHotKey: DWORD,
  pub __bindgen_anon_1: _SHELLEXECUTEINFOW__bindgen_ty_1,
  pub hProcess: HANDLE,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _SHELLEXECUTEINFOW__bindgen_ty_1 {
  pub hIcon: HANDLE,
  pub hMonitor: HANDLE,
  _bindgen_union_align: u64,
}
#[test]
fn bindgen_test_layout__SHELLEXECUTEINFOW__bindgen_ty_1() {
  assert_eq!(
    ::std::mem::size_of::<_SHELLEXECUTEINFOW__bindgen_ty_1>(),
    8usize,
    concat!("Size of: ", stringify!(_SHELLEXECUTEINFOW__bindgen_ty_1))
  );
  assert_eq!(
    ::std::mem::align_of::<_SHELLEXECUTEINFOW__bindgen_ty_1>(),
    8usize,
    concat!(
      "Alignment of ",
      stringify!(_SHELLEXECUTEINFOW__bindgen_ty_1)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_SHELLEXECUTEINFOW__bindgen_ty_1>())).hIcon as *const _ as usize
    },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_SHELLEXECUTEINFOW__bindgen_ty_1),
      "::",
      stringify!(hIcon)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_SHELLEXECUTEINFOW__bindgen_ty_1>())).hMonitor as *const _ as usize
    },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_SHELLEXECUTEINFOW__bindgen_ty_1),
      "::",
      stringify!(hMonitor)
    )
  );
}
#[test]
fn bindgen_test_layout__SHELLEXECUTEINFOW() {
  assert_eq!(
    ::std::mem::size_of::<_SHELLEXECUTEINFOW>(),
    112usize,
    concat!("Size of: ", stringify!(_SHELLEXECUTEINFOW))
  );
  assert_eq!(
    ::std::mem::align_of::<_SHELLEXECUTEINFOW>(),
    8usize,
    concat!("Alignment of ", stringify!(_SHELLEXECUTEINFOW))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SHELLEXECUTEINFOW>())).cbSize as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_SHELLEXECUTEINFOW),
      "::",
      stringify!(cbSize)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SHELLEXECUTEINFOW>())).fMask as *const _ as usize },
    4usize,
    concat!(
      "Offset of field: ",
      stringify!(_SHELLEXECUTEINFOW),
      "::",
      stringify!(fMask)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SHELLEXECUTEINFOW>())).hwnd as *const _ as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_SHELLEXECUTEINFOW),
      "::",
      stringify!(hwnd)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SHELLEXECUTEINFOW>())).lpVerb as *const _ as usize },
    16usize,
    concat!(
      "Offset of field: ",
      stringify!(_SHELLEXECUTEINFOW),
      "::",
      stringify!(lpVerb)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SHELLEXECUTEINFOW>())).lpFile as *const _ as usize },
    24usize,
    concat!(
      "Offset of field: ",
      stringify!(_SHELLEXECUTEINFOW),
      "::",
      stringify!(lpFile)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SHELLEXECUTEINFOW>())).lpParameters as *const _ as usize },
    32usize,
    concat!(
      "Offset of field: ",
      stringify!(_SHELLEXECUTEINFOW),
      "::",
      stringify!(lpParameters)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SHELLEXECUTEINFOW>())).lpDirectory as *const _ as usize },
    40usize,
    concat!(
      "Offset of field: ",
      stringify!(_SHELLEXECUTEINFOW),
      "::",
      stringify!(lpDirectory)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SHELLEXECUTEINFOW>())).nShow as *const _ as usize },
    48usize,
    concat!(
      "Offset of field: ",
      stringify!(_SHELLEXECUTEINFOW),
      "::",
      stringify!(nShow)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SHELLEXECUTEINFOW>())).hInstApp as *const _ as usize },
    56usize,
    concat!(
      "Offset of field: ",
      stringify!(_SHELLEXECUTEINFOW),
      "::",
      stringify!(hInstApp)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SHELLEXECUTEINFOW>())).lpIDList as *const _ as usize },
    64usize,
    concat!(
      "Offset of field: ",
      stringify!(_SHELLEXECUTEINFOW),
      "::",
      stringify!(lpIDList)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SHELLEXECUTEINFOW>())).lpClass as *const _ as usize },
    72usize,
    concat!(
      "Offset of field: ",
      stringify!(_SHELLEXECUTEINFOW),
      "::",
      stringify!(lpClass)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SHELLEXECUTEINFOW>())).hkeyClass as *const _ as usize },
    80usize,
    concat!(
      "Offset of field: ",
      stringify!(_SHELLEXECUTEINFOW),
      "::",
      stringify!(hkeyClass)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SHELLEXECUTEINFOW>())).dwHotKey as *const _ as usize },
    88usize,
    concat!(
      "Offset of field: ",
      stringify!(_SHELLEXECUTEINFOW),
      "::",
      stringify!(dwHotKey)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SHELLEXECUTEINFOW>())).hProcess as *const _ as usize },
    104usize,
    concat!(
      "Offset of field: ",
      stringify!(_SHELLEXECUTEINFOW),
      "::",
      stringify!(hProcess)
    )
  );
}
pub type SHELLEXECUTEINFOW = _SHELLEXECUTEINFOW;
pub type SHELLEXECUTEINFO = SHELLEXECUTEINFOW;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SHCREATEPROCESSINFOW {
  pub cbSize: DWORD,
  pub fMask: ULONG,
  pub hwnd: HWND,
  pub pszFile: LPCWSTR,
  pub pszParameters: LPCWSTR,
  pub pszCurrentDirectory: LPCWSTR,
  pub hUserToken: HANDLE,
  pub lpProcessAttributes: LPSECURITY_ATTRIBUTES,
  pub lpThreadAttributes: LPSECURITY_ATTRIBUTES,
  pub bInheritHandles: BOOL,
  pub dwCreationFlags: DWORD,
  pub lpStartupInfo: LPSTARTUPINFOW,
  pub lpProcessInformation: LPPROCESS_INFORMATION,
}
#[test]
fn bindgen_test_layout__SHCREATEPROCESSINFOW() {
  assert_eq!(
    ::std::mem::size_of::<_SHCREATEPROCESSINFOW>(),
    88usize,
    concat!("Size of: ", stringify!(_SHCREATEPROCESSINFOW))
  );
  assert_eq!(
    ::std::mem::align_of::<_SHCREATEPROCESSINFOW>(),
    8usize,
    concat!("Alignment of ", stringify!(_SHCREATEPROCESSINFOW))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SHCREATEPROCESSINFOW>())).cbSize as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_SHCREATEPROCESSINFOW),
      "::",
      stringify!(cbSize)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SHCREATEPROCESSINFOW>())).fMask as *const _ as usize },
    4usize,
    concat!(
      "Offset of field: ",
      stringify!(_SHCREATEPROCESSINFOW),
      "::",
      stringify!(fMask)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SHCREATEPROCESSINFOW>())).hwnd as *const _ as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_SHCREATEPROCESSINFOW),
      "::",
      stringify!(hwnd)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SHCREATEPROCESSINFOW>())).pszFile as *const _ as usize },
    16usize,
    concat!(
      "Offset of field: ",
      stringify!(_SHCREATEPROCESSINFOW),
      "::",
      stringify!(pszFile)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SHCREATEPROCESSINFOW>())).pszParameters as *const _ as usize },
    24usize,
    concat!(
      "Offset of field: ",
      stringify!(_SHCREATEPROCESSINFOW),
      "::",
      stringify!(pszParameters)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_SHCREATEPROCESSINFOW>())).pszCurrentDirectory as *const _ as usize
    },
    32usize,
    concat!(
      "Offset of field: ",
      stringify!(_SHCREATEPROCESSINFOW),
      "::",
      stringify!(pszCurrentDirectory)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SHCREATEPROCESSINFOW>())).hUserToken as *const _ as usize },
    40usize,
    concat!(
      "Offset of field: ",
      stringify!(_SHCREATEPROCESSINFOW),
      "::",
      stringify!(hUserToken)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_SHCREATEPROCESSINFOW>())).lpProcessAttributes as *const _ as usize
    },
    48usize,
    concat!(
      "Offset of field: ",
      stringify!(_SHCREATEPROCESSINFOW),
      "::",
      stringify!(lpProcessAttributes)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_SHCREATEPROCESSINFOW>())).lpThreadAttributes as *const _ as usize
    },
    56usize,
    concat!(
      "Offset of field: ",
      stringify!(_SHCREATEPROCESSINFOW),
      "::",
      stringify!(lpThreadAttributes)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_SHCREATEPROCESSINFOW>())).bInheritHandles as *const _ as usize
    },
    64usize,
    concat!(
      "Offset of field: ",
      stringify!(_SHCREATEPROCESSINFOW),
      "::",
      stringify!(bInheritHandles)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_SHCREATEPROCESSINFOW>())).dwCreationFlags as *const _ as usize
    },
    68usize,
    concat!(
      "Offset of field: ",
      stringify!(_SHCREATEPROCESSINFOW),
      "::",
      stringify!(dwCreationFlags)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SHCREATEPROCESSINFOW>())).lpStartupInfo as *const _ as usize },
    72usize,
    concat!(
      "Offset of field: ",
      stringify!(_SHCREATEPROCESSINFOW),
      "::",
      stringify!(lpStartupInfo)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<_SHCREATEPROCESSINFOW>())).lpProcessInformation as *const _ as usize
    },
    80usize,
    concat!(
      "Offset of field: ",
      stringify!(_SHCREATEPROCESSINFOW),
      "::",
      stringify!(lpProcessInformation)
    )
  );
}
pub type SHCREATEPROCESSINFOW = _SHCREATEPROCESSINFOW;
pub type PSHCREATEPROCESSINFOW = *mut _SHCREATEPROCESSINFOW;
extern "C" {
  pub fn SHCreateProcessAsUserW(pscpi: PSHCREATEPROCESSINFOW) -> BOOL;
}
extern "C" {
  pub fn SHEvaluateSystemCommandTemplate(
    pszCmdTemplate: PCWSTR,
    ppszApplication: *mut PWSTR,
    ppszCommandLine: *mut PWSTR,
    ppszParameters: *mut PWSTR,
  ) -> HRESULT;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SHQUERYRBINFO {
  pub cbSize: DWORD,
  pub i64Size: ::std::os::raw::c_longlong,
  pub i64NumItems: ::std::os::raw::c_longlong,
}
#[test]
fn bindgen_test_layout__SHQUERYRBINFO() {
  assert_eq!(
    ::std::mem::size_of::<_SHQUERYRBINFO>(),
    24usize,
    concat!("Size of: ", stringify!(_SHQUERYRBINFO))
  );
  assert_eq!(
    ::std::mem::align_of::<_SHQUERYRBINFO>(),
    8usize,
    concat!("Alignment of ", stringify!(_SHQUERYRBINFO))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SHQUERYRBINFO>())).cbSize as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_SHQUERYRBINFO),
      "::",
      stringify!(cbSize)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SHQUERYRBINFO>())).i64Size as *const _ as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_SHQUERYRBINFO),
      "::",
      stringify!(i64Size)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SHQUERYRBINFO>())).i64NumItems as *const _ as usize },
    16usize,
    concat!(
      "Offset of field: ",
      stringify!(_SHQUERYRBINFO),
      "::",
      stringify!(i64NumItems)
    )
  );
}
pub type SHQUERYRBINFO = _SHQUERYRBINFO;
pub type LPSHQUERYRBINFO = *mut _SHQUERYRBINFO;
extern "C" {
  pub fn SHQueryRecycleBinA(pszRootPath: LPCSTR, pSHQueryRBInfo: LPSHQUERYRBINFO) -> HRESULT;
}
extern "C" {
  pub fn SHQueryRecycleBinW(pszRootPath: LPCWSTR, pSHQueryRBInfo: LPSHQUERYRBINFO) -> HRESULT;
}
extern "C" {
  pub fn SHEmptyRecycleBinA(hwnd: HWND, pszRootPath: LPCSTR, dwFlags: DWORD) -> HRESULT;
}
extern "C" {
  pub fn SHEmptyRecycleBinW(hwnd: HWND, pszRootPath: LPCWSTR, dwFlags: DWORD) -> HRESULT;
}
pub const QUERY_USER_NOTIFICATION_STATE_QUNS_NOT_PRESENT: QUERY_USER_NOTIFICATION_STATE = 1;
pub const QUERY_USER_NOTIFICATION_STATE_QUNS_BUSY: QUERY_USER_NOTIFICATION_STATE = 2;
pub const QUERY_USER_NOTIFICATION_STATE_QUNS_RUNNING_D3D_FULL_SCREEN:
  QUERY_USER_NOTIFICATION_STATE = 3;
pub const QUERY_USER_NOTIFICATION_STATE_QUNS_PRESENTATION_MODE: QUERY_USER_NOTIFICATION_STATE = 4;
pub const QUERY_USER_NOTIFICATION_STATE_QUNS_ACCEPTS_NOTIFICATIONS: QUERY_USER_NOTIFICATION_STATE =
  5;
pub const QUERY_USER_NOTIFICATION_STATE_QUNS_QUIET_TIME: QUERY_USER_NOTIFICATION_STATE = 6;
pub const QUERY_USER_NOTIFICATION_STATE_QUNS_APP: QUERY_USER_NOTIFICATION_STATE = 7;
pub type QUERY_USER_NOTIFICATION_STATE = ::std::os::raw::c_int;
extern "C" {
  pub fn SHQueryUserNotificationState(pquns: *mut QUERY_USER_NOTIFICATION_STATE) -> HRESULT;
}
extern "C" {
  pub fn SHGetPropertyStoreForWindow(
    hwnd: HWND,
    riid: *const IID,
    ppv: *mut *mut ::std::os::raw::c_void,
  ) -> HRESULT;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _SHFILEINFOA {
  pub hIcon: HICON,
  pub iIcon: ::std::os::raw::c_int,
  pub dwAttributes: DWORD,
  pub szDisplayName: [CHAR; 260usize],
  pub szTypeName: [CHAR; 80usize],
}
#[test]
fn bindgen_test_layout__SHFILEINFOA() {
  assert_eq!(
    ::std::mem::size_of::<_SHFILEINFOA>(),
    360usize,
    concat!("Size of: ", stringify!(_SHFILEINFOA))
  );
  assert_eq!(
    ::std::mem::align_of::<_SHFILEINFOA>(),
    8usize,
    concat!("Alignment of ", stringify!(_SHFILEINFOA))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SHFILEINFOA>())).hIcon as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_SHFILEINFOA),
      "::",
      stringify!(hIcon)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SHFILEINFOA>())).iIcon as *const _ as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_SHFILEINFOA),
      "::",
      stringify!(iIcon)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SHFILEINFOA>())).dwAttributes as *const _ as usize },
    12usize,
    concat!(
      "Offset of field: ",
      stringify!(_SHFILEINFOA),
      "::",
      stringify!(dwAttributes)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SHFILEINFOA>())).szDisplayName as *const _ as usize },
    16usize,
    concat!(
      "Offset of field: ",
      stringify!(_SHFILEINFOA),
      "::",
      stringify!(szDisplayName)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SHFILEINFOA>())).szTypeName as *const _ as usize },
    276usize,
    concat!(
      "Offset of field: ",
      stringify!(_SHFILEINFOA),
      "::",
      stringify!(szTypeName)
    )
  );
}
pub type SHFILEINFOA = _SHFILEINFOA;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _SHFILEINFOW {
  pub hIcon: HICON,
  pub iIcon: ::std::os::raw::c_int,
  pub dwAttributes: DWORD,
  pub szDisplayName: [WCHAR; 260usize],
  pub szTypeName: [WCHAR; 80usize],
}
#[test]
fn bindgen_test_layout__SHFILEINFOW() {
  assert_eq!(
    ::std::mem::size_of::<_SHFILEINFOW>(),
    696usize,
    concat!("Size of: ", stringify!(_SHFILEINFOW))
  );
  assert_eq!(
    ::std::mem::align_of::<_SHFILEINFOW>(),
    8usize,
    concat!("Alignment of ", stringify!(_SHFILEINFOW))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SHFILEINFOW>())).hIcon as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_SHFILEINFOW),
      "::",
      stringify!(hIcon)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SHFILEINFOW>())).iIcon as *const _ as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_SHFILEINFOW),
      "::",
      stringify!(iIcon)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SHFILEINFOW>())).dwAttributes as *const _ as usize },
    12usize,
    concat!(
      "Offset of field: ",
      stringify!(_SHFILEINFOW),
      "::",
      stringify!(dwAttributes)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SHFILEINFOW>())).szDisplayName as *const _ as usize },
    16usize,
    concat!(
      "Offset of field: ",
      stringify!(_SHFILEINFOW),
      "::",
      stringify!(szDisplayName)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SHFILEINFOW>())).szTypeName as *const _ as usize },
    536usize,
    concat!(
      "Offset of field: ",
      stringify!(_SHFILEINFOW),
      "::",
      stringify!(szTypeName)
    )
  );
}
pub type SHFILEINFOW = _SHFILEINFOW;
pub type SHFILEINFO = SHFILEINFOW;
extern "C" {
  pub fn SHGetFileInfoA(
    pszPath: LPCSTR,
    dwFileAttributes: DWORD,
    psfi: *mut SHFILEINFOA,
    cbFileInfo: UINT,
    uFlags: UINT,
  ) -> DWORD_PTR;
}
extern "C" {
  pub fn SHGetFileInfoW(
    pszPath: LPCWSTR,
    dwFileAttributes: DWORD,
    psfi: *mut SHFILEINFOW,
    cbFileInfo: UINT,
    uFlags: UINT,
  ) -> DWORD_PTR;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _SHSTOCKICONINFO {
  pub cbSize: DWORD,
  pub hIcon: HICON,
  pub iSysImageIndex: ::std::os::raw::c_int,
  pub iIcon: ::std::os::raw::c_int,
  pub szPath: [WCHAR; 260usize],
}
#[test]
fn bindgen_test_layout__SHSTOCKICONINFO() {
  assert_eq!(
    ::std::mem::size_of::<_SHSTOCKICONINFO>(),
    544usize,
    concat!("Size of: ", stringify!(_SHSTOCKICONINFO))
  );
  assert_eq!(
    ::std::mem::align_of::<_SHSTOCKICONINFO>(),
    8usize,
    concat!("Alignment of ", stringify!(_SHSTOCKICONINFO))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SHSTOCKICONINFO>())).cbSize as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(_SHSTOCKICONINFO),
      "::",
      stringify!(cbSize)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SHSTOCKICONINFO>())).hIcon as *const _ as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(_SHSTOCKICONINFO),
      "::",
      stringify!(hIcon)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SHSTOCKICONINFO>())).iSysImageIndex as *const _ as usize },
    16usize,
    concat!(
      "Offset of field: ",
      stringify!(_SHSTOCKICONINFO),
      "::",
      stringify!(iSysImageIndex)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SHSTOCKICONINFO>())).iIcon as *const _ as usize },
    20usize,
    concat!(
      "Offset of field: ",
      stringify!(_SHSTOCKICONINFO),
      "::",
      stringify!(iIcon)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<_SHSTOCKICONINFO>())).szPath as *const _ as usize },
    24usize,
    concat!(
      "Offset of field: ",
      stringify!(_SHSTOCKICONINFO),
      "::",
      stringify!(szPath)
    )
  );
}
pub type SHSTOCKICONINFO = _SHSTOCKICONINFO;
pub const SHSTOCKICONID_SIID_DOCNOASSOC: SHSTOCKICONID = 0;
pub const SHSTOCKICONID_SIID_DOCASSOC: SHSTOCKICONID = 1;
pub const SHSTOCKICONID_SIID_APPLICATION: SHSTOCKICONID = 2;
pub const SHSTOCKICONID_SIID_FOLDER: SHSTOCKICONID = 3;
pub const SHSTOCKICONID_SIID_FOLDEROPEN: SHSTOCKICONID = 4;
pub const SHSTOCKICONID_SIID_DRIVE525: SHSTOCKICONID = 5;
pub const SHSTOCKICONID_SIID_DRIVE35: SHSTOCKICONID = 6;
pub const SHSTOCKICONID_SIID_DRIVEREMOVE: SHSTOCKICONID = 7;
pub const SHSTOCKICONID_SIID_DRIVEFIXED: SHSTOCKICONID = 8;
pub const SHSTOCKICONID_SIID_DRIVENET: SHSTOCKICONID = 9;
pub const SHSTOCKICONID_SIID_DRIVENETDISABLED: SHSTOCKICONID = 10;
pub const SHSTOCKICONID_SIID_DRIVECD: SHSTOCKICONID = 11;
pub const SHSTOCKICONID_SIID_DRIVERAM: SHSTOCKICONID = 12;
pub const SHSTOCKICONID_SIID_WORLD: SHSTOCKICONID = 13;
pub const SHSTOCKICONID_SIID_SERVER: SHSTOCKICONID = 15;
pub const SHSTOCKICONID_SIID_PRINTER: SHSTOCKICONID = 16;
pub const SHSTOCKICONID_SIID_MYNETWORK: SHSTOCKICONID = 17;
pub const SHSTOCKICONID_SIID_FIND: SHSTOCKICONID = 22;
pub const SHSTOCKICONID_SIID_HELP: SHSTOCKICONID = 23;
pub const SHSTOCKICONID_SIID_SHARE: SHSTOCKICONID = 28;
pub const SHSTOCKICONID_SIID_LINK: SHSTOCKICONID = 29;
pub const SHSTOCKICONID_SIID_SLOWFILE: SHSTOCKICONID = 30;
pub const SHSTOCKICONID_SIID_RECYCLER: SHSTOCKICONID = 31;
pub const SHSTOCKICONID_SIID_RECYCLERFULL: SHSTOCKICONID = 32;
pub const SHSTOCKICONID_SIID_MEDIACDAUDIO: SHSTOCKICONID = 40;
pub const SHSTOCKICONID_SIID_LOCK: SHSTOCKICONID = 47;
pub const SHSTOCKICONID_SIID_AUTOLIST: SHSTOCKICONID = 49;
pub const SHSTOCKICONID_SIID_PRINTERNET: SHSTOCKICONID = 50;
pub const SHSTOCKICONID_SIID_SERVERSHARE: SHSTOCKICONID = 51;
pub const SHSTOCKICONID_SIID_PRINTERFAX: SHSTOCKICONID = 52;
pub const SHSTOCKICONID_SIID_PRINTERFAXNET: SHSTOCKICONID = 53;
pub const SHSTOCKICONID_SIID_PRINTERFILE: SHSTOCKICONID = 54;
pub const SHSTOCKICONID_SIID_STACK: SHSTOCKICONID = 55;
pub const SHSTOCKICONID_SIID_MEDIASVCD: SHSTOCKICONID = 56;
pub const SHSTOCKICONID_SIID_STUFFEDFOLDER: SHSTOCKICONID = 57;
pub const SHSTOCKICONID_SIID_DRIVEUNKNOWN: SHSTOCKICONID = 58;
pub const SHSTOCKICONID_SIID_DRIVEDVD: SHSTOCKICONID = 59;
pub const SHSTOCKICONID_SIID_MEDIADVD: SHSTOCKICONID = 60;
pub const SHSTOCKICONID_SIID_MEDIADVDRAM: SHSTOCKICONID = 61;
pub const SHSTOCKICONID_SIID_MEDIADVDRW: SHSTOCKICONID = 62;
pub const SHSTOCKICONID_SIID_MEDIADVDR: SHSTOCKICONID = 63;
pub const SHSTOCKICONID_SIID_MEDIADVDROM: SHSTOCKICONID = 64;
pub const SHSTOCKICONID_SIID_MEDIACDAUDIOPLUS: SHSTOCKICONID = 65;
pub const SHSTOCKICONID_SIID_MEDIACDRW: SHSTOCKICONID = 66;
pub const SHSTOCKICONID_SIID_MEDIACDR: SHSTOCKICONID = 67;
pub const SHSTOCKICONID_SIID_MEDIACDBURN: SHSTOCKICONID = 68;
pub const SHSTOCKICONID_SIID_MEDIABLANKCD: SHSTOCKICONID = 69;
pub const SHSTOCKICONID_SIID_MEDIACDROM: SHSTOCKICONID = 70;
pub const SHSTOCKICONID_SIID_AUDIOFILES: SHSTOCKICONID = 71;
pub const SHSTOCKICONID_SIID_IMAGEFILES: SHSTOCKICONID = 72;
pub const SHSTOCKICONID_SIID_VIDEOFILES: SHSTOCKICONID = 73;
pub const SHSTOCKICONID_SIID_MIXEDFILES: SHSTOCKICONID = 74;
pub const SHSTOCKICONID_SIID_FOLDERBACK: SHSTOCKICONID = 75;
pub const SHSTOCKICONID_SIID_FOLDERFRONT: SHSTOCKICONID = 76;
pub const SHSTOCKICONID_SIID_SHIELD: SHSTOCKICONID = 77;
pub const SHSTOCKICONID_SIID_WARNING: SHSTOCKICONID = 78;
pub const SHSTOCKICONID_SIID_INFO: SHSTOCKICONID = 79;
pub const SHSTOCKICONID_SIID_ERROR: SHSTOCKICONID = 80;
pub const SHSTOCKICONID_SIID_KEY: SHSTOCKICONID = 81;
pub const SHSTOCKICONID_SIID_SOFTWARE: SHSTOCKICONID = 82;
pub const SHSTOCKICONID_SIID_RENAME: SHSTOCKICONID = 83;
pub const SHSTOCKICONID_SIID_DELETE: SHSTOCKICONID = 84;
pub const SHSTOCKICONID_SIID_MEDIAAUDIODVD: SHSTOCKICONID = 85;
pub const SHSTOCKICONID_SIID_MEDIAMOVIEDVD: SHSTOCKICONID = 86;
pub const SHSTOCKICONID_SIID_MEDIAENHANCEDCD: SHSTOCKICONID = 87;
pub const SHSTOCKICONID_SIID_MEDIAENHANCEDDVD: SHSTOCKICONID = 88;
pub const SHSTOCKICONID_SIID_MEDIAHDDVD: SHSTOCKICONID = 89;
pub const SHSTOCKICONID_SIID_MEDIABLURAY: SHSTOCKICONID = 90;
pub const SHSTOCKICONID_SIID_MEDIAVCD: SHSTOCKICONID = 91;
pub const SHSTOCKICONID_SIID_MEDIADVDPLUSR: SHSTOCKICONID = 92;
pub const SHSTOCKICONID_SIID_MEDIADVDPLUSRW: SHSTOCKICONID = 93;
pub const SHSTOCKICONID_SIID_DESKTOPPC: SHSTOCKICONID = 94;
pub const SHSTOCKICONID_SIID_MOBILEPC: SHSTOCKICONID = 95;
pub const SHSTOCKICONID_SIID_USERS: SHSTOCKICONID = 96;
pub const SHSTOCKICONID_SIID_MEDIASMARTMEDIA: SHSTOCKICONID = 97;
pub const SHSTOCKICONID_SIID_MEDIACOMPACTFLASH: SHSTOCKICONID = 98;
pub const SHSTOCKICONID_SIID_DEVICECELLPHONE: SHSTOCKICONID = 99;
pub const SHSTOCKICONID_SIID_DEVICECAMERA: SHSTOCKICONID = 100;
pub const SHSTOCKICONID_SIID_DEVICEVIDEOCAMERA: SHSTOCKICONID = 101;
pub const SHSTOCKICONID_SIID_DEVICEAUDIOPLAYER: SHSTOCKICONID = 102;
pub const SHSTOCKICONID_SIID_NETWORKCONNECT: SHSTOCKICONID = 103;
pub const SHSTOCKICONID_SIID_INTERNET: SHSTOCKICONID = 104;
pub const SHSTOCKICONID_SIID_ZIPFILE: SHSTOCKICONID = 105;
pub const SHSTOCKICONID_SIID_SETTINGS: SHSTOCKICONID = 106;
pub const SHSTOCKICONID_SIID_DRIVEHDDVD: SHSTOCKICONID = 132;
pub const SHSTOCKICONID_SIID_DRIVEBD: SHSTOCKICONID = 133;
pub const SHSTOCKICONID_SIID_MEDIAHDDVDROM: SHSTOCKICONID = 134;
pub const SHSTOCKICONID_SIID_MEDIAHDDVDR: SHSTOCKICONID = 135;
pub const SHSTOCKICONID_SIID_MEDIAHDDVDRAM: SHSTOCKICONID = 136;
pub const SHSTOCKICONID_SIID_MEDIABDROM: SHSTOCKICONID = 137;
pub const SHSTOCKICONID_SIID_MEDIABDR: SHSTOCKICONID = 138;
pub const SHSTOCKICONID_SIID_MEDIABDRE: SHSTOCKICONID = 139;
pub const SHSTOCKICONID_SIID_CLUSTEREDDRIVE: SHSTOCKICONID = 140;
pub const SHSTOCKICONID_SIID_MAX_ICONS: SHSTOCKICONID = 181;
pub type SHSTOCKICONID = ::std::os::raw::c_int;
extern "C" {
  pub fn SHGetStockIconInfo(
    siid: SHSTOCKICONID,
    uFlags: UINT,
    psii: *mut SHSTOCKICONINFO,
  ) -> HRESULT;
}
extern "C" {
  pub fn SHGetDiskFreeSpaceExA(
    pszDirectoryName: LPCSTR,
    pulFreeBytesAvailableToCaller: *mut ULARGE_INTEGER,
    pulTotalNumberOfBytes: *mut ULARGE_INTEGER,
    pulTotalNumberOfFreeBytes: *mut ULARGE_INTEGER,
  ) -> BOOL;
}
extern "C" {
  pub fn SHGetDiskFreeSpaceExW(
    pszDirectoryName: LPCWSTR,
    pulFreeBytesAvailableToCaller: *mut ULARGE_INTEGER,
    pulTotalNumberOfBytes: *mut ULARGE_INTEGER,
    pulTotalNumberOfFreeBytes: *mut ULARGE_INTEGER,
  ) -> BOOL;
}
extern "C" {
  pub fn SHGetNewLinkInfoA(
    pszLinkTo: LPCSTR,
    pszDir: LPCSTR,
    pszName: LPSTR,
    pfMustCopy: *mut BOOL,
    uFlags: UINT,
  ) -> BOOL;
}
extern "C" {
  pub fn SHGetNewLinkInfoW(
    pszLinkTo: LPCWSTR,
    pszDir: LPCWSTR,
    pszName: LPWSTR,
    pfMustCopy: *mut BOOL,
    uFlags: UINT,
  ) -> BOOL;
}
extern "C" {
  pub fn SHInvokePrinterCommandA(
    hwnd: HWND,
    uAction: UINT,
    lpBuf1: LPCSTR,
    lpBuf2: LPCSTR,
    fModal: BOOL,
  ) -> BOOL;
}
extern "C" {
  pub fn SHInvokePrinterCommandW(
    hwnd: HWND,
    uAction: UINT,
    lpBuf1: LPCWSTR,
    lpBuf2: LPCWSTR,
    fModal: BOOL,
  ) -> BOOL;
}
extern "C" {
  pub fn SHLoadNonloadedIconOverlayIdentifiers() -> HRESULT;
}
extern "C" {
  pub fn SHIsFileAvailableOffline(pwszPath: PCWSTR, pdwStatus: *mut DWORD) -> HRESULT;
}
extern "C" {
  pub fn SHSetLocalizedName(
    pszPath: PCWSTR,
    pszResModule: PCWSTR,
    idsRes: ::std::os::raw::c_int,
  ) -> HRESULT;
}
extern "C" {
  pub fn SHRemoveLocalizedName(pszPath: PCWSTR) -> HRESULT;
}
extern "C" {
  pub fn SHGetLocalizedName(
    pszPath: PCWSTR,
    pszResModule: PWSTR,
    cch: UINT,
    pidsRes: *mut ::std::os::raw::c_int,
  ) -> HRESULT;
}
extern "C" {
  pub fn SHEnumerateUnreadMailAccountsA(
    hKeyUser: HKEY,
    dwIndex: DWORD,
    pszMailAddress: LPSTR,
    cchMailAddress: ::std::os::raw::c_int,
  ) -> HRESULT;
}
extern "C" {
  pub fn SHEnumerateUnreadMailAccountsW(
    hKeyUser: HKEY,
    dwIndex: DWORD,
    pszMailAddress: LPWSTR,
    cchMailAddress: ::std::os::raw::c_int,
  ) -> HRESULT;
}
extern "C" {
  pub fn SHGetUnreadMailCountA(
    hKeyUser: HKEY,
    pszMailAddress: LPCSTR,
    pdwCount: *mut DWORD,
    pFileTime: *mut FILETIME,
    pszShellExecuteCommand: LPSTR,
    cchShellExecuteCommand: ::std::os::raw::c_int,
  ) -> HRESULT;
}
extern "C" {
  pub fn SHGetUnreadMailCountW(
    hKeyUser: HKEY,
    pszMailAddress: LPCWSTR,
    pdwCount: *mut DWORD,
    pFileTime: *mut FILETIME,
    pszShellExecuteCommand: LPWSTR,
    cchShellExecuteCommand: ::std::os::raw::c_int,
  ) -> HRESULT;
}
extern "C" {
  pub fn SHSetUnreadMailCountA(
    pszMailAddress: LPCSTR,
    dwCount: DWORD,
    pszShellExecuteCommand: LPCSTR,
  ) -> HRESULT;
}
extern "C" {
  pub fn SHSetUnreadMailCountW(
    pszMailAddress: LPCWSTR,
    dwCount: DWORD,
    pszShellExecuteCommand: LPCWSTR,
  ) -> HRESULT;
}
extern "C" {
  pub fn SHTestTokenMembership(hToken: HANDLE, ulRID: ULONG) -> BOOL;
}
extern "C" {
  pub fn SHGetImageList(
    iImageList: ::std::os::raw::c_int,
    riid: *const IID,
    ppvObj: *mut *mut ::std::os::raw::c_void,
  ) -> HRESULT;
}
extern "C" {
  pub fn SHGetDriveMedia(pszDrive: PCWSTR, pdwMediaContent: *mut DWORD) -> HRESULT;
}
pub type u_short = ::std::os::raw::c_ushort;
pub type SOCKET = UINT_PTR;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct servent {
  pub s_name: *mut ::std::os::raw::c_char,
  pub s_aliases: *mut *mut ::std::os::raw::c_char,
  pub s_proto: *mut ::std::os::raw::c_char,
  pub s_port: ::std::os::raw::c_short,
}
#[test]
fn bindgen_test_layout_servent() {
  assert_eq!(
    ::std::mem::size_of::<servent>(),
    32usize,
    concat!("Size of: ", stringify!(servent))
  );
  assert_eq!(
    ::std::mem::align_of::<servent>(),
    8usize,
    concat!("Alignment of ", stringify!(servent))
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<servent>())).s_name as *const _ as usize },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(servent),
      "::",
      stringify!(s_name)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<servent>())).s_aliases as *const _ as usize },
    8usize,
    concat!(
      "Offset of field: ",
      stringify!(servent),
      "::",
      stringify!(s_aliases)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<servent>())).s_proto as *const _ as usize },
    16usize,
    concat!(
      "Offset of field: ",
      stringify!(servent),
      "::",
      stringify!(s_proto)
    )
  );
  assert_eq!(
    unsafe { &(*(::std::ptr::null::<servent>())).s_port as *const _ as usize },
    24usize,
    concat!(
      "Offset of field: ",
      stringify!(servent),
      "::",
      stringify!(s_port)
    )
  );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct in_addr {
  pub S_un: in_addr__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union in_addr__bindgen_ty_1 {
  pub S_un_b: in_addr__bindgen_ty_1__bindgen_ty_1,
  pub S_un_w: in_addr__bindgen_ty_1__bindgen_ty_2,
  pub S_addr: ULONG,
  _bindgen_union_align: u32,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct in_addr__bindgen_ty_1__bindgen_ty_1 {
  pub s_b1: UCHAR,
  pub s_b2: UCHAR,
  pub s_b3: UCHAR,
  pub s_b4: UCHAR,
}
#[test]
fn bindgen_test_layout_in_addr__bindgen_ty_1__bindgen_ty_1() {
  assert_eq!(
    ::std::mem::size_of::<in_addr__bindgen_ty_1__bindgen_ty_1>(),
    4usize,
    concat!("Size of: ", stringify!(in_addr__bindgen_ty_1__bindgen_ty_1))
  );
  assert_eq!(
    ::std::mem::align_of::<in_addr__bindgen_ty_1__bindgen_ty_1>(),
    1usize,
    concat!(
      "Alignment of ",
      stringify!(in_addr__bindgen_ty_1__bindgen_ty_1)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<in_addr__bindgen_ty_1__bindgen_ty_1>())).s_b1 as *const _ as usize
    },
    0usize,
    concat!(
      "Offset of field: ",
      stringify!(in_addr__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(s_b1)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<in_addr__bindgen_ty_1__bindgen_ty_1>())).s_b2 as *const _ as usize
    },
    1usize,
    concat!(
      "Offset of field: ",
      stringify!(in_addr__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(s_b2)
    )
  );
  assert_eq!(
    unsafe {
      &(*(::std::ptr::null::<in_addr__bindgen_ty_1__bindgen_ty_1>())).s_b3 as *const _ as usize
    },
    2usize,
    concat!(
      "Offset of field: ",
      stringify!(in_addr__bindgen_ty_1__bindgen_ty_1),
      "::",
      stringify!(s_b3)
    )
  );
  assert_eq!(
    unsafe {
